{"url": "https://www.washingtonpost.com/blogs/behind-the-numbers/post/new-high-supports-legalizing-marijuana-cain-and-romney-close-in-sc-and-other-top-polls/2011/10/07/gIQAkRFnxL_blog.html", "domain": "washingtonpost.com", "title": "New high supports legalizing marijuana, Cain and Romney close in S.C., and other top polls", "authors": ["Scott Clement"], "publish_date": "10-19-2011", "text": "Follow @sfcpoll Todays top polls ... New high in support for legalizing marijuana Fully 50 percent of Americans say the use of marijuana should be legal according to a Gallup poll released Tuesday, the highest in polls since 1969, when just 12 percent favored legalization. Almost as many, 46 percent say marijuana should remain against the law, but that number has softened over the past decade, down from more than seven in 10 in the mid-1990s. Liberals and those under age 30 are the strongest supporters of legalizing marijuana, while support is lowest among conservatives and those over age 65. Cain, Romney close in South Carolina and Florida Presidential candidates Herman Cain and Mitt Romney are in a close fight for support in Republican primaries in South Carolina and Florida, according to two new NBC/Marist polls . Cain stands at 31 percent to Romneys 28 in South Carolina among likely GOP voters (the difference is not statistically significant). In Florida, Cain and Romney stand at 32 and 33 percent, respectively (including those who lean toward a candidate). Texas Gov. Rick Perry places a distant third in both states with about 10 percent support; other candidates are in single digits. Blame government or Wall Street for economy? The Occupy Wall Street movement has heightened scrutiny of the role banks and financial institutions played in the financial crisis, but a new Gallup poll finds that when forced to pick a bogeyman for the nations economic problems, the public blames government over Wall Street by more than 2 to 1 (64 percent to 30 percent). Even among supporters of the new movement, the blame splits 54 percent for Wall Street and 44 percent for government. Tea party supporters are less divided; 82 percent say the federal government deserves the most blame. Wall Street still earns plenty of blame from the public. In separate questions, 78 percent of adults say financial institutions on Wall Street deserve at least a fair amount of blame for the nations economic woes. Somewhat more, 87 percent, say the federal government deserved substantial blame. Republicans see Romney as most electable More than four in 10 Republicans and GOP leaning independents say Mitt Romney has the best chance of defeating President Obama in 2012, according to a CNN poll released Tuesday. Fewer, 24 percent, choose the fast rising Herman Cain, 12 percent choose Perry and all other candidates are in single digits. Cain, however, is seen as the most likable candidate and the person who is most likely to get the economy moving. Follow Post polling on Twitter Like Post Politics on Facebook Scott Clement is the polling manager at The Washington Post, specializing in public opinion about politics, election campaigns and public policy. politics Please provide a valid email address.", "summary": null}
{"url": "https://www.washingtonpost.com/blogs/govbeat/wp/2014/03/11/pot-sales-spark-warehouse-boom-in-colorado/", "domain": "washingtonpost.com", "title": "Pot sales spark warehouse boom in Colorado", "authors": ["Fred Barbash"], "publish_date": "03-11-2014", "text": "Follow @fbarbash A Feb. 10, 2012 photo shows Matthew Huron, owner of two medical marijuana dispensaries and an edible marijuana company in Denver, examining a marijuana plant in his grow house. Medical marijuana is legal in 17 states, but the industry has a decidedly black-market aspect its mostly cash-only. Thats because banks wont touch pot money. (AP Photo/Ed Andrieski) Theyre scrambling for space to grow marijuana in Denver. The demand is so great that warehouse space is renting for four times the price it fetched before marijuana sales began in Colorado, the Denver Post reports. Commercial real estate tracker Xceligent Inc. estimates that marijuana cultivation and manufacturing facilities in the city occupy about 4.5 million square feet the equivalent of 78 football fields. This industry has come on so fast that initially I was uneasy it seemed like a fad, said Brad Calbert, president of the Colliers International brokerage in Denver. But whats making it sustainable is supply, demand and capital. Supply is deficient, demand is excessive, and capital is abundant. But recreational marijuana sales brought in only $2 million in tax revenue in January, according the figures from thestates Department of Revenue. That represents about $14 million worth of pot, sold from about 59 businesses. According to the Washington Posts Niraj Chokshi : When compared to expectations for the first six months of the year, January sales appear discouraging. If they hold for the remainder of the fiscal year, the state will see about $21 million in revenue. A mid-2013 fiscal analysis of the proposal that became the law, however, foresaw an additional $33.5 million in revenue generated in the first six months of the year. An estimate last month from Gov. John Hickenloopers (D) budget office predicted revenues of about $35.2 million. The new tax figures are the first official accounting of pot sales since they began on Jan. 1 under a new Colorado law enacted in 2012. The state of Washington has also legalized marijuana sales but legal retailing hasnt started up there yet. There are numerous reports of pot being sold via Craigslist and other sites, however, with customers ordering it up as if it were pizza. Washington issued its first legal marijuana growing and processing license last week, according to the Associated Press . It was issued to Sean Green, who has previously operated medicalmarijuanadispensaries in Spokane as well as the Seattle suburb of Shoreline. Green is the chief executive of Spokanes Kouchlock Productions. The state is set to issue retail licenses later this spring, with sales expected to begin in June or July. Fred Barbash, the editor of Morning Mix, is a former National Editor and London Bureau Chief for the Washington Post. politics govbeat Please provide a valid email address.", "summary": null}
{"url": "https://www.washingtonpost.com/blogs/govbeat/wp/2014/07/08/theres-more-than-one-way-to-legalize-marijuana/", "domain": "washingtonpost.com", "title": "There’s more than one way to legalize marijuana", "authors": ["Niraj Chokshi"], "publish_date": "07-8-2014", "text": "Follow @NirajC Cloned marijuana plants at the Sea of Green Farms growing facility in Seattle. (Jason Redmond/Reuters) Update, 11:45 a.m.: The transcript below has been updated with follow-up comments from Kleiman to provide further clarity on his views. Legal sales of recreational marijuana begin in Washington state Tuesday, just seven months afterpot went on salein Colorado. The two states are the first in the nation to regulate and allow sales of the drug for recreational use and, despite their differences, bothregulate the new industry inbroadly similar ways. Taxes are higher in Washington than in Colorado, and Colorado residents may grow limited amounts at home while Washingtonians cannot. But the differences are of degree, not kind: Both allowprivatesalesof the drug whilelimiting the amount purchased per transaction and imposing relatively high taxes. But thats not the only way to regulate marijuana. To get one perspective on an alternative, we spoke with Mark Kleiman , a professor of public policy at the University of CaliforniaatLos Angeles . Kleiman specializes in, among other things, drug policy and hiscompany, BOTEC Analysis, provided technical advice toWashington state regulators as they began creating rules for the new industry. Although his is just one view, itsan informed and prominent onein the market of ideas. What follows is an edited version of our interview discussing Washingtons systemand Kleimans views on how marijuana should, in an ideal world, be regulated. (Although BOTEC maintains acontract with the state, Kleiman notes he is free to discuss the states regulations.) Question: Whats your take on the way Washingtons regulations have beenrolled out? Kleiman: There were lots of choices made in the law in Washington that were not the choices I would have made. But then I didnt have to persuade 50 percent, plus one, of the voters to go for it. So thats where the Washington State Liquor Control Board [which is assigned the responsibility to regulate pot] was starting from and, within those constraints, I think their choices were reasonable, by and large. I pushed hard for delivery as an option. That was a fight they fought and won around liquor and didnt want to revisit for cannabis. I would have pushed for much tighter marketing restrictions than their lawyers said they were allowed to get away with. I would have had price as an explicit target of policy. The main question is how quickly does production capacity get built out to facilitate the price drop that Im sure is coming. And then what does the state do to deal with the price drop. I would strongly argue that preventing a price drop is a major policy objective. Aone-gram packet of a variety of recreational marijuana named Space Needle during packaging operations at Sea of Green Farms in Seattle.. (AP Photo/Ted S. Warren) Q: The counterargument there is that it might be overly burdensome on the heavy users. K: Yes, yes, thats a particular worry. Well, then you ought to make a lot of treatment available. If theres a group of people who smokes a lot and wont stop due to high prices, then you have to ask whether the impoverishment is justified. But even if theyre spending a lot of money, theyre probably smoking less pot than they would be if it were cheaper. And whether theyre net ahead or net behind is hard to tell. The people who are ahead are the people who would have been in that category but arent because its moreexpensive. Q: Interesting. Well, absent political considerations, what does your ideal system look like? K: My ideal system would have it legal nationally or at least have it illegal nationally but with an exception for some states. If they were allowed to do it fully legally, then I would have pressed for state stores. That seems to be a pretty clear choice. [posttv url=\"\" ] Q: Why is that? K: Because you can do state stores or you can do not-for profits. But if you have for-profit retailers, you have retailers devoted to selling as much product as they can. And, with respect to cannabis, thats not the public objective. The public objective is to have the material available to adults who want to use it responsibly while minimizing the increase of drug abuse and access to minors. The commercial industry does not have those objectives, theyre dependent on the dependentusers. The free market is an excellent system for maximizing consumption. Thats why I dont want it to apply to this product. I wouldnt want that systemforalcohol either, but we lost that battle. I propose the following system: If you want to buy one of those commodities, you should sign up as a buyer, you should probably take some kind of minimal test like a driving test to make sure you know what youre talking about and then you should be asked to set for yourself a purchase quote on, say, a monthly basis. How many joint-equivalents a month do you want to use? Give us a number. Every time you make a purchase, that purchase will be recorded against that quota. And if you bought as much this month as you said you wanted to be able to buy this month, the clerk will say Im sorry the order was refused. Justwhat happens whenyou go over yourcredit card limit. Its the sameprinciple. Now, some people will just set a very high quota to start with, in which case the system will not matter at all to them. Other people will set a low quota, hit it and and say Oh, that was a mistake, and immediately go to a high quota, so it wouldnt do them much good. (Though, if you require a two-week delay to change your quota, youd at least slow them down.) And some people would set a low quota and never hit it, so it wouldnt matter. But some people would set a lower quota and hit it sometime early in the month and say to themselves Hmm, I guess I didnt know I was using that much and not reset it. Andthoseare the people who would obviously benefit from the system. Now, I dont know how many there would be, but its hard to see who would be harmed by this system. A pamphlet at the Cannabis City recreational marijuana shop in Seattle. The store will be the first and only store in Seattle to sell recreational marijuana when legal sales begin on Tuesday. (AP Photo/Ted S. Warren) Q: Is this based on some psychological principle? K: Its based on Schellings ideas about self-command . Its based on an idea about substance abuse and other bad habits, which is that they are essentially a time-mismatch problem. The reward is now, the cost is later. And none of us are very good about that. Schelling tells a story in one of his essays, about a company I think its a real case which is worried about weight gain among its executives. [Retold here, on page 81 , with citation.] So they changed the policy in the executive dining room so that you had to order lunch at 9:30 in the morning. People consumed fewer calories ordering when they werent hungry. Look, these guys werent stupid. It wasnt hard to figure out, at least after the first time, that at 12:30 you were going to want the chocolate cake that you werent ordering at 9:30. But at 9:30 you didnt want it and you actually didnt want the 12:30 self to have it. And so people lost weight. The thing in the literature this links to is the Thaler-Sunstein nudge idea. Youre changing the choice architecture. My essay on this in Washington Monthly was called A Nudge Toward Temperance . Again, I have no idea how much it would work and theres lots of design questions, but why the hell not? Wed like to nudge people not to use too much. Cannabis City owner James Lathrop gestures as he stands in the middle of his new marijuana shop days before the grand opening Wednesday, July 2, in Seattle. (AP Photo/Elaine Thompson) Q: So what are some of the looming questions that have to be answered? K: The questions remaining to be answered are: How fast are prices going to move? What happens to the nature of demand in the market? Does the tendency toward wanting the highest THC reverse now that THCs no longer scarce? Does the tendency toward edibles and concentrate continue? And, if so, do people learn to use those safely? Is dabbing a problem? [Dabbing is the process of inhaling flash-vaporized, concentrated hash oil.]What happens to juvenile use? Among the various ways of getting cannabis growing it yourself legally in Colorado, illegally in Washington, having it legally produced in state, having it illegally produced and brought in from out of state, getting it from a medical outlet, getting it from a commercial outlet or getting it diverted from a medical outlet what are the market shares of those things and how do they change over time? What happens to price, what happens to revenue? Whats the impact of legal cannabis on alcohol? Thats the big wild card. It turns out the two drugs are substitutes and the argument for legalization and keeping it cheap get to be pretty overwhelming. [posttv url=\"\" ] Niraj Chokshi is a general assignment reporter for The Washington Post. politics govbeat Please provide a valid email address.", "summary": null}
{"url": "https://www.washingtonpost.com/blogs/govbeat/wp/2014/07/11/marijuana-demand-in-colorado-may-be-nearly-a-third-higher-than-previously-estimated/", "domain": "washingtonpost.com", "title": "Marijuana demand in Colorado may be nearly a third higher than previously estimated", "authors": ["Niraj Chokshi"], "publish_date": "07-11-2014", "text": "Follow @NirajC Tyler Williams of Blanchester, Ohio, selects marijuana strains to purchase in Colorado. (Theo Stroomer/Getty) Adult Coloradans consume roughly 121 metric tons of marijuana a year, according to a new Colorado Department of Revenue study that estimates demand at31 percent more than a recent projection and virtuallydouble some outside estimates. The study, released this week,sought to ascertain how often and how much pot is consumed by the states adult residents and visitors. What they found was that there are 485,000 regular adult users of marijuana, a group that accounts for roughly9 percent ofthe states forecast 2014 population. Toss in adult residents who have used the drug in the past year and estimates of those under 21 years old who have used in the past year and that share rises to more than 15 percent of the population. Thestudy is unique in that, according to the authors, its the first to look at both demand and supply. Measuring supply is convenient becausesales data is recorded, but it leaves outthe significant role of black market, home-grown and imported marijuana. Measuring demand gives a better sense of how much of the drug is in use. While the amount of underground and illegal production is expected to decline significantly, some level is believed to exist to date, the authors write.Therefore, in order to determine the total market for licensed and unlicensed marijuana, a demand approach is more practical. To measure demand, the researchers first estimated the number of users and then the amount consumed by each over a given period of time. But that just gives an estimate of how often people are using, not how much. To measure demand, they relied on surveys. And becausethere are myriad ways to consume pot, each with varying potency, theymeasured by dried flower weight. Heres a tour of some of the reports conclusions about marijuana use in Colorado, seven months after legal sales began there: About 9 percent of adultsareprojected to use marijuana at least once a month The state predicts that 485,000 adults consume the drug at least once a month, translating to about 9 percent of the forecast population for the year. Another 201,000 reported using it in the past year, roughly 3.8 percent of the population.And while the report focuses on adult use, the report did mention an estimated 184,000 residents under 21 years old who have used the drug within the past year. Frequency of pot use is concentrated at the extremes Adult residents either smoke pot (relatively)few times a monthor nearly every daythere are few in the middle. More than half of all adult resident users consume the drug in some form fewer than six times a month. (More than 1 in 4 consume less than once a month.) At the same time, about 1 in 5 users are near or at daily consumption. Frequent users consume the vast majority of marijuana While those roughly daily users account for just a fifth of the userpopulation, they consume fully two thirds of the product. Niraj Chokshi is a general assignment reporter for The Washington Post. politics govbeat Please provide a valid email address.", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/national/vermont-governor-vetoes-bill-to-legalize-marijuana-suggests-revisions/2017/05/24/7cc80e2e-3d03-11e7-a058-ddbb23c75d82_story.html", "domain": "washingtonpost.com", "title": "Vermont governor vetoes bill to legalize marijuana, suggests revisions", "authors": [], "publish_date": "05-24-2017", "text": "at 5:42 PM VERMONT Governor vetoes bill tolegalize marijuana Gov. Phil Scott (R) on Wednesday vetoed a bill that would have made Vermont the ninth state to legalize recreational marijuana but indicated that he was willing to work with the legislature on a compromise. Scott said he was sending the bill back with suggestions for another path forward and called for changes to be made to the proposal, such as more aggressive penalties for smoking pot while driving or in the presence of children. \"We must get this right,\" said Scott, who is hoping that the legislature can make the fixes during a veto session in late June. Scott has said he's not philosophically opposed to marijuana legalization but has concerns about public safety, children's health and how to measure impaired drivers. Under the legislation, small amounts of marijuana would have been legal to possess and grow for anyone over age 21. Eight other states, plus the District of Columbia, have legalized recreational marijuana. Vermont would have been the first state to legalize marijuana by vote of a state legislative body. The other states and the District legalized marijuana after public referendums. Associated Press OKLAHOMA 1 dead after stolen truck is crashed The driver of a stolen utility truck crashed through a fence at a Tulsa airport and into oncoming freeway traffic, where it plowed head-on into a car and killed one person early Wednesday, according to the Oklahoma Highway Patrol. Troopers said the driver later abandoned the vehicle and ran off. Officers were still searching for him Wednesday afternoon. A trooper chasing the stolen vehicle on Tulsa International Airport property saw it barreling toward a parked private jet, Highway Patrolman Dwight Durant said. Worried there were passengers on the jet, the trooper tried to ram the truck, even though the truck weighed about two to three times as much as his cruiser, Durant said. The maneuver diverted the truck away from the plane. The truck then crossed over a runway twice during the pursuit and burst through a fence onto nearby U.S. 75. Airport spokeswoman Alexis Higgins said the truck came near a parked Gulfstream jet that had one person aboard but wasn't preparing to take off. Associated Press KANSAS Court says man didn't violate federal gun law An appeals court said that someone convicted of a misdemeanor domestic battery under a city ordinance can legally have a gun. The ruling from the U.S. Court of Appeals for the 10th Circuit in Denver could have broader implications for gun sales. The court on Tuesday threw out the case of a Kansas man who was convicted of violating a federal law that prohibits someone who has been convicted of domestic violence \"under federal, state or tribal law\" from owning a gun. Alexander Pauler had been convicted of misdemeanor domestic violence under a Wichita ordinance. The appeals court found that the federal gun law doesn't apply to such municipal ordinances. Associated Press Reynolds sworn in as Iowa's first female governor: Kim Reynolds (R) was sworn in as Iowa's governor Wednesday, becoming the state's first woman to hold the job after taking over for Gov. Terry Branstad the same day he was sworn in as the U.S. ambassador to China. Reynolds, 57, was Branstad's lieutenant governor. Associated Press", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/news/early-lead/wp/2017/07/25/a-former-jets-player-is-suing-jeff-sessions-to-legalize-marijuana/", "domain": "washingtonpost.com", "title": "A former Jets player is suing Jeff Sessions to legalize marijuana", "authors": ["Matt Bonesteel"], "publish_date": "07-25-2017", "text": "at 9:36 AM Jeff Sessions, under fire from all sides. (Matt Rourke, Associated Press file photo) Former NFL player Marvin Washington is one of five plaintiffs who are suing Attorney General Jeff Sessions, the Department of Justice and the Drug Enforcement Administration in federal court to legalize marijuana, the New York Post reported Monday night. Washington, a defensive lineman known mostly for his time with the New York Jets over his 11-year NFL career, is the co-founder of a company that sells hemp-based sports performance products that do not contain THC, the component of cannabis that causes a high in marijuana users . In the lawsuit, he claims that the federal government's classification of marijuana as a Schedule I drug in other words, a substance that has a high potential for abuse and one that has no accepted medical use prevents him from receiving federal grants to open a business that \"would allow pro football players to use medical marijuana for pain management in lieu of more addictive opioids,\" the Post reports. NFL players \" are fed opiates and pharmaceuticals throughout the week, from training camp until the end of season. That can be June to January. It's not normal,\" Washington told the New York Daily News in June. \" I think the Players Association should demand that [players] have an alternative to opiates. This is scientific-based. This is not hocus pocus. That's where I want to see this in the very near future, players that have an alternative to opiates.\" As delineated by the Controlled Substances Act of 1970 (CSA), substances such as marijuana, heroin and LSD are considered Schedule I drugs but drugs such as cocaine and methamphetamine are considered less dangerous Schedule II drugs because, while also addictive and subject to abuse, they have accepted medical uses in the eyes of the federal government. \"The record makes clear that the CSA doesn't make any rational sense and the federal government knows it,\" attorney Michael Hiller, who represents Washington and the other plaintiffs in the lawsuit, told the New York Post. Joining Washington as plaintiffs in the lawsuit are Alexis Bortell , an 11-year-old girl who needs medical marijuana to treat her epilepsy, and Jose Belen, a disabled military veteran who uses marijuana to treat his post traumatic stress syndrome. More on the NFL: Police clear Lucky Whitehead after false accusation and arrest warrant The latest brain study examined 111 former NFL players. Only one didn't have CTE. Robert Griffin III set to work out for Chargers After spending the first 17 years of his Post career writing and editing, Matt and the printed paper had an amicable divorce in 2014. He's now blogging and editing for the Early Lead and The Post's other Web-based products.", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/national/2018/01/10/study-legal-marijuana-could-generate-more-than-132-billion-in-federal-tax-revenue-and-1-million-jobs/", "domain": "washingtonpost.com", "title": "Study: Legal marijuana could generate more than $132 billion in federal tax revenue and 1 million jobs", "authors": ["Katie Zezima"], "publish_date": "01-10-2018", "text": "at 5:47 PM Amy Goodwin removes the yellow leaves and checks for damage on the marijuana plants at SPARC in Glen Ellen, Calif. in October. (Photo by Mason Trinca for The Washington Post) Legalizing marijuana nationwide would create at least $132 billion in tax revenue and more than a million new jobs across the United States in the next decade, according to a new study. New Frontier Data, a data analytics firm focused on the cannabis industry, forecasts that if legalized on the federal level, the marijuana industry could create an entirely new tax revenue stream for the government, generating millions of dollars in sales tax and payroll deductions. When there are budget deficits and the like, everybody wants to know where is there an additional revenue stream, and one of the most logical places is to go after cannabis and cannabis taxes, said Beau Whitney, a senior economist at New Frontier Data. The analysis shows that if marijuana were fully legal in all 50 states, it would create at least a combined $131.8 billion in in federal tax revenue between 2017 and 2025. That is based on an estimated 15 percent retail sales tax, payroll tax deductions and business tax revenue. The federal government would reap $51.7 billion in sales tax from a legal marijuana market between 2017 and 2025, entirely new revenue for a business that remains illegal -- and unable to be taxed -- federally. The business tax rate for the study was calculated at 35 percent. The corporate tax rate was lowered to 21 percent in a sweeping tax bill President Trump signed last month. If cannabis businesses were legalized tomorrow and taxed as normal businesses with a standard 35 percent tax rate, cannabis businesses would infuse the U.S. economy with an additional $12.6 billion this year, said Giadha Aguirre De Carcer, the CEO of New Frontier. The study also calculates that there would be 782,000 additional jobs nationwide if cannabis were legalized today, a number that would increase to 1.1 million by 2025. That includes workers at all ends of the marijuana supply chain, from farmers to transporters to sellers. The study estimates that about 25 percent of the marijuana market will continue to be illicit, and will shrink if the legal marketplace is not overly taxed or expensive. Consumers want to do things legally in general, but they dont want to do it at too much of a price, Whitney said. If they go to 7-11 to pick up cannabis, theyre willing to pay 10 to 15 percent on top of what they get on the street. Once they get above that, it slows the transition and makes the consumer think twice about making that legal purchase. Marijuana is legal for adult recreational use in eight states. California, the worlds largest market, started its recreational sales on Jan. 1. Twenty-nine states allow the use of medical marijuana. In the three states where adult use has been legal for the longest period of time Colorado, Washington and Oregon there had been a combined total of $1.3 billion in tax receipts, according to the study. The nationwide legalization of marijuana, however, is looking unlikely under the Trump administration. While there has been a bipartisan push in Congress to both legalize marijuana nationally and protect the individual states where it is legal, Attorney General Jeff Sessions has gone after the industry. Last week Sessions made it easier for U.S. Attorneys in places where marijuana is legal to enforce federal law, rescinding Obama-era guidance that discouraged enforcement of federal marijuana law in states that legalized the drug. The decision has been pilloried by the cannabis industry, which argued that Sessions is trying to stop the momentum of a growing business and restart the war on drugs. The decision has been harshly criticized even by some Republicans. Sen. Cory Gardner (R-Colo.) threatened to hold up the confirmation of Justice Department posts in response to the announcement. Sessions said hes enforcing federal law, simply directing all U.S. Attorneys to use previously established prosecutorial principles that provide them all the necessary tools to disrupt criminal organizations, tackle the growing drug crisis, and thwart violent crime across our country, Sessions said in a statement. Some in the industry believe Sessionss actions could force Congress to step in and regulate the market, or move to legalize marijuana altogether. Okay, now Congress, do something, said Morgan Paxhia, managing director at Poseidon Asset Management, which invests in marijuana businesses. Heres a chance to do something meaningful that could move the industry in a much safer direction. To some, there is no safe direction in which the marijuana industry can move. Kevin Sabet, president of Smart Approaches to Marijuana, which opposes marijuana legalization, said doing so would impose significant costs on taxpayers, resulting from workplace losses, car crashes, lost tourism revenue, administrative enforcement, and a multitude of other issues. They include, Sabet said, sales to minors and increased marijuana use. We shouldnt let Big Marijuana fool us into believing their billion-dollar industry will somehow result in a net benefit for the country, Sabet said.", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/national/health-science/how-medical-marijuana-made-me-a-better-mom/2018/11/16/37f4a28a-dc76-11e8-b732-3c72cbf131f2_story.html?noredirect=on", "domain": "washingtonpost.com", "title": "How medical marijuana made me a better mom", "authors": ["Diana Whitney"], "publish_date": "11-17-2018", "text": "at 9:00 AM Diana Calvert, manager of the River City Retail Marijuana Dispensary in Merlin, Ore., stocks the shelves with product. (Timothy Bullard/Grants Pass Oregons Daily Courier/Associated Press) I had a medical marijuana card for nearly two years before I worked up the nerve to buy legal weed. Living in laid-back Vermont, I had access to a friends homegrown herb, which my husband used to make me cannabis-infused coconut butter in the family Crock-Pot. Applying the butter topically soothed my chronic pelvic pain and relieved symptoms of the debilitating bladder syndrome that had plagued me for a decade and warranted the card. Occasionally, I ingested a tiny lick of butter during a flare-up an imprecise home remedy. I savored the full-body relaxation that followed but loathed the disorienting mental side effects. Id been a cannabis skeptic from the start: I never much liked getting high for fun, tending to feel nervous and paranoid rather than happy and chill. I also carried childhood shame about catching my mom smoking a little pipe in secret the strange pungent smell, her altered state, her mortified reaction when I walked in on her. And I worried that using more cannabis would alter me in turn, distance me from my children and prevent good parenting. How wrong I was. It turns out the costs of living with chronic pain and depression are far greater than the risks of using medical marijuana to help those conditions. This past summer, although I was physically pain-free, a sudden depression knocked me to the ground. Crippled by anxiety and insomnia, I struggled to get out of bed and function for my two daughters, ages 10 and 12, who had both experienced some depression themselves. Id read in Scientific American that mood disorders may be passed genetically from mother to daughter , and I feared what my girls would learn from watching me break down in tears or lash out in rage. Even in the fog of despair, I knew taking care of myself was essential to my ability to take care of them. Diana Whitney says Americans are starting to dispel the shame and secrecy around cannabis. For her, this means she doesnt have to hide in a backroom with a secret pipe, as her mother did. (Carmen Whitney/) When my therapist-husband gave me Victoria Costellos memoir, A Lethal Inheritance: A Mother Uncovers the Science Behind Three Generations of Mental Illness, I took its message to heart: One of the best things a depressed parent can do to help a child prone to mental illness is to treat her own depression. So I went to my doctor, but all he could offer was a prescription for Ativan, an anti-anxiety med, and an increase in my antidepressant dosage. I was already going to therapy, practicing yoga and exercising regularly. Rather than become dependent on benzodiazepines or suffer more pharmaceutical side effects, I got out my green card and made an appointment at the local dispensary. The modest office felt like a hippie health spa, with green-and-white decor and posters displaying different plant strains. My consultant, Mike, quickly put me at ease with his cheerful brown eyes and gentle manner. Clad in jeans and plaid flannel, Mike told me that cannabis had been his exit drug from opiates, then listened carefully to my history of chronic pain and depressed mood. He explained the healing properties of endocannabinoids and cited a recent study in which cannabis significantly reduced reports of stress, anxiety and depression, especially in women. Because I didnt like to smoke and wanted minimal psychoactive effects, Mike recommended I try microdosing taking small amounts of cannabis to reap the therapeutic benefits without getting stoned. I took home a tin of indica-dominant butter-mints, some salted caramel gummies and a high-CBD oral tincture. (Indica strains of cannabis tend to be more sedating and relaxing; CBD, or cannabidiol , is a non-psychoactive cannabis compound with anti-inflammatory and pain-relieving properties.) The sativa-strain gummies were strangely activating and made me irritable, but even one tiny buttermint allowed me a blissful nights sleep. And the oral tincture proved the holy grail one dropper-full to relieve anxiety and sustain a mellow relaxation for hours. Within a week, I felt my depression lighten, and for the first time all summer, I could laugh with my family. Stigmas and false stereotypes have surrounded marijuana use since the 1930s, when it was classified a federal Schedule 1 substance, like heroin. Maybe because of this disrepute, I never expected the gifts of cannabis to go beyond symptom relief. But Ive discovered that the plant slows me down and tunes me in, softens my competitive edges. When I microdose, I experience a heightened sense of gratitude and patience, as well as lighthearted humor. Joining the kids on the couch for a lovefest with the dog or playing a family game of cards, I feel more present, more grounded in my body, free from mental agitation. Other mothers have told me they enjoy these benefits, too. Jane Lanza, a yoga teacher certified in cannabis science and medicine through the University of Vermonts Robert Larner, M.D. College of Medicine, says she sees cannabis as a healthier alternative to the socially accepted wine mom culture, especially when taken in small amounts. The cannabis medicine we use is the feminized version of the plant, Lanza told me at a canna-wellness retreat I attended with my husband, adding that cannabis growers cull the male plants and use the flowering female plants for the cannabinoids they produce. The spirit of healing I receive from medical cannabis is nurturing and supportive, Lanza said. It amplifies positive feelings for me, so I experience greater love, patience and compassion when it comes to my kids. I hope that, by speaking honestly about my own use, more women will come out of the cannabis closet, a crucial step toward ending the stigma. While Im grateful for my medical card, I recognize how my white privilege and economic advantages play into my access to cannabis. Marijuana prohibition has racist origins, and the criminalization of cannabis continues to disproportionally affect people of color. According to the American Civil Liberties Union, black people are 3.7 times as likely as whites to be arrested for marijuana. Its ironic and unjust that many mothers of color are in prison for using the same plant that has benefited me. Meanwhile, the tide of legalization keeps rising. Although federal law still classifies marijuana as an illegal drug, 10 states plus the District have legalized recreational cannabis, while 33 states and the District now allow adult medical use . To our north, Canada just became the first major industrialized nation to fully legalize cannabis. Clearly, were starting to dispel the shame and secrecy around cannabis. This means I dont have to hide in a backroom with a secret pipe, like my mother did. My daughters see the green, zipped lock-bag where I keep my tinctures and edibles. They know I take the medicine to help with pain, depression and anxiety, and Ive talked to them about microdosing for symptom relief using the substance consciously, rather than as a form of escapism. Its a healing plant for grown-ups, and for kids with epilepsy, I say. But it has negative effects on adolescent brains , so please wait to try it. Lanza told me that for cannabis to work therapeutically, it takes an alchemy of all the right factors the right time in your life, plus the right strain, method of ingestion, environment and time of day. All these factors have come together for me in my 40s, and Im a better mother because of it. Still, I dont relate to the stoner stereotype. Ive never been a wine mom, and I dont feel like a weed mom, either. Im ready to embrace a new kind of cannabis culture, free from stigma and judgment, where the plants healing benefits are studied and shared, and the medicine is available to all in need.", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/news/food/wp/2017/04/18/brands-want-to-capitalize-on-420-munchies-pot-advocates-say-its-time-to-grow-up/", "domain": "washingtonpost.com", "title": "Brands want to capitalize on 4/20 munchies. Pot advocates say it's time to grow up.", "authors": ["Maura Judkis"], "publish_date": "04-18-2017", "text": "at 9:30 AM A Ben & Jerrys Chill-aco (Photo by Greg Comollo) When you and your buds get the munchies on April 20, the high holidayfor marijuana users, a small army of marketing professionals is working to ensure that in your haze, you'll reach for their brand of blazed, er, glazed doughnuts. Or Totino's Pizza Rolls. Or Burger King. Or any other brand of junk food even from a wholesome, family-friendly company thatsuspects its biggest fans may be spending the day more flame-broiled than a Whopper. 4/20, as the holiday is known, is when brands want you toget baked (goods). They want you to have a huge (ice cream) bowl or a (burrito) roll.In other words, it's the day when corporate-sanctioned pot punsfly high on Twitter. It's no surprise that Ben & Jerry's, the tie-dyed Vermont ice cream maker that has namedice creams \"Half Baked\" and \"Phish Food\" and \"Dave Matthews Band Magic Brownies,\" wouldcapitalize on the spirit of 4/20.\"Jerry and Ben started the company in 1978, and they were definitely two hippies that were enjoying life, if you will,\" said spokeswomanLindsay Bumps. Two years ago, on 4/20, the brand's scoop shops debuted the Brrr-ito, an ice-cream filled burrito that definitely seems like a late-night stoner innovation. This year, they're introducing another new menu item: The Chill-aco, a waffle-cone taco with two scoops of ice cream and fudgedrizzle, \"which gives it that ooey-gooey component,\" Bumps said. \"I think a lot of brands aim to stand out on that day.\" Related: [Dank and resinous, this is the 4/20 beer youve been searching for] The same goes for Lagunitas. The northern California brewery, owned in part by Heineken , is bringing back its Waldos' Ale, a beer that Washington Post beer columnistFritz Hahn called \" the stickiest of the icky .\" The Waldos were a group of students who are said to havecoined the term 420 in the 1970s and who worked with the brewery to develop the beer's dank flavor. It's\"one of our best selling beers,\" said spokeswomanKaren Hamilton. Alluding to marijuana in names for beer is \"just something that we've always done, and it's not only on April 20.\" But it's not just companies from the liberal enclaves of California and Vermont who are partaking in 4/20 marketing campaigns. It's also big, mainstream brands, such as Pepsi , Chipotle, Burger King and Denny's, all of whom have alludedto 4/20 on social media in previous years. If you make food that's baked, or comes in a bowl, well, thead copy writes itself. Denny's tweeted its favorite, allegedly culinary words: \"Baked, cooked, fried, stewed, toasted.\" Chipotle's photo of a burrito bowl came with the caption, \"Sometimes you need a huge bowl to get you through the day.\" Why are they so coy about it though? Even as more states legalize marijuana,acknowledging 4/20 can still be atricky business move. So brands do it with a wink and a nudge for consumers who know that \"fried\" doesn't exactly refer to chicken,but they stop just short of spelling it out in fear of pushing away their othercustomers. Case in point: Ask any one of these brands what it is, exactly, thatpeople are celebrating on 4/20, and you'll make tricky work for its spokesmen, whohaveto acknowledge the \"holiday,\" but don't want to cross a line for their corporation by actually, you know, acknowledging the holiday. Which leads to clinically worded, coded emails like this one, from Totino's Pizza Rolls spokesman MikeSiemienas: \"Totino's does some regional promotions focused on current events in specific markets ,\" he said. \"We are running a similar campaign this year by celebrating our fans who love pizza rolls.\" Related: [Pizza chains are making a desperate push to avoid posting calories on menus] But pizza isn't the only thing that's going to be rolling on Thursday right, Mike? Ever the professional, he will not budge.\"This current event is relevant to our pizza roll fans in Colorado so that makes it important to us,\" Siemienas said in a subsequent email, studiously avoiding the words \"marijuana\" and \"4/20.\" It's pretty clear that the brand knows its audience isn't just time-strapped moms and hungry kids. Some of the taglines that Totino's will be using in its advertising this week will include:\"Remember before you forget,\" \"It's high time for some Pizza Rolls,\" and the very Keanu Reeves-esque , \"It's pizza. In a roll. Whoa.\" They've also filmed a riff on \"A Christmas Carol,\" except when Scrooge wakes up in the morning and looks out the window, astonished that he hasn't missed the big day 4/20, of course heinquires not about the prizeturkey in the window, but about the availability of pizza rolls. It ends with the hashtag #betterwhenbaked. Other brands practice flat-out denial. \"We're really known for our tongue-in-cheek humor but it's pretty coincidental that it's coming out on the 20th,\" said Bumps, the Ben & Jerry's spokeswoman. \"That's the official line.\" Butprofessionals in the cannabis industry don't love the pile-on from junk-food brands, which they say promotes negative stereotypes about the lifestyle. Cannabis \"is becominga wellness product. We do not want people to believe that you just get munchies, and you're just reaching for junk food. It's part of a healthy lifestyle,\" said Olivia Mannix, chief executive of Cannabrand , a marketingagency for cannabis companies. Related: [An Irish restaurant chain is upset that McDonalds owns so many Mc trademarks] The branding pile-on is also, for cannabis connoisseurs, a sign that their holiday is becoming as commercialized as Christmas or Valentine's Day.\"It's just another holiday for brands to jump on the bandwagon to market themselves,\" said Mannix, and already, thebig brands' pot jokes are played-out cliches.\"It's going to take a lot to be clever. A lot of the things have been said and done.\" College kids might get a chuckle out of that burrito that looks like a joint , but cannabis consumers are more than just the \"Harold and Kumar Go to White Castle\" crowd, said J.J. Walker, the founder of My420Tours , a travel company that'shosting World Cannabis Week in Colorado April 19 through 23 . \"The bottom line is, this is a really good spending demographic\" that encompasses \"everything from your 21-year-old stoner, to CEOs, to your grandma,\" Walker said. \"Once these brands get over themselves and realize what cannabis can do, I think you're going to see a lot of brands coming on board.\" In the meantime,don't expect the digital marketing teams behind your favoritebrands to be, well, blunt. Bumps says that even though Ben & Jerry's has a good sense of humor on Twitter, they have to be careful not to go too far. \"Wetry to get almost to that line, but we never really cross that line,\" Bumps said. Though she will acknowledge, \"Our numbers in store do quite well on that day.\" Read more: This is why you're seeing so much beef jerky lately Servers, stop handing the check to my husband. I can pay, too. One woman has stirred the pot at Ben's Chili Bowl for 40 years. Her name is Peaches. 0", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/news/posteverything/wp/2017/08/01/why-jeff-sessions-is-going-to-lose-his-war-against-cannabis/", "domain": "washingtonpost.com", "title": "Why Jeff Sessions is going to lose his war against cannabis", "authors": ["Ashley C. Bradford, W. David Bradford"], "publish_date": "08-1-2017", "text": "at 6:00 AM Watch more! In a Senate drug hearing in April 2016, Sessions said that 'we need grown-ups in charge in Washington to say marijuana is not the kind of thing that ought to be legalized, it ought not to be minimized, that its in fact a very real danger.' (U.S. Senate Drug Caucus) Attorney General Jeff Sessions will soon receive a report he has been waiting for. The document, from the Presidents Task Force on Crime Reduction and Public Safety, is expected to clarify the federal governments position on marijuana and the conflicts that exist between state and federal laws. It clear what Sessions wants to do: Over the past month, he has asked Congress for permission to prosecute medical cannabis suppliers who are acting in accordance with their states laws, reauthorized civil asset forfeiture (a highly controversial practice used in drug cases), and announced his desire to start a new war on drugs. On at least one front, however, Sessionss new war on drugs is likely to fail. In taking on cannabis particularly the medical uses of cannabis heis staking out a position that is at odds with powerful interests and an overwhelming majority of Americans from nearly all walks of life. This tide is too strong to swim against. The first obstacle is that the medical community has largely resolved the question of whether cannabis is clinically useful. In January, the National Academies of Sciences, Engineering and Medicine (NAS) reported that there is conclusive evidence that cannabis (both whole plant and extracts) is clinically effective at treating some diseases, including chronic pain. Cannabis may prove to be a pain management strategy that could substitute for opioids for many desperate patients, and the National Institute on Drug Abuse (NIDA) acknowledges that cannabis may be an effective tool to combat the opioid crisis. Researchers studying the relationship between medical cannabis laws and opioid use have found that states with such laws have nearly a 25 percent reduction in opioid-related deaths . The contrast between opioids which killed more than 33,000 Americans in 2015 and cannabis could not be more striking. As NIDA states on its DrugFacts Marijuana Web page: There are no reports of teens or adults fatally overdosing (dying) on marijuana alone. Related: [Pot is increasingly legal. Employers need to stop screening for it.] Further, medical cannabis may also save lives in unexpected ways. Data published in the American Journal of Public Health in February suggests that laws allowing it were associated with fewer traffic fatalities. While we always have to be careful about making claims that a policy caused an outcome, evidence from multiple studies, with careful statistical analyses, is building a case that medical cannabis has real, beneficial, spillover effects. State governments are a second major hurdle for Sessions. States are sharply opposed to his moves to crack down on their cannabis policies. Eight states (with nearly one-fifth of the U.S. population) have legalized recreational cannabis use by adults. Even more striking, 29 states and the District of Columbia have approved the medical use of botanical cannabis, with 17 more having cannabis extract laws in place. This doesnt just save lives; it also saves money. In two studies, we find substantial reductions in a broad array of prescription spending for both Medicare and Medicaid in states that have medical cannabis laws in effect. Medicare and Medicaid dont cover cannabis, but it nevertheless appears to substitute for many prescription drugs that the programs do cover. Nationally, the savings could be in the billions of dollars across the two programs if all states would adopt medical cannabis laws. States benefit directly. Our work on Medicaid spending shows that they saved money as much as $98 million in the case of California in 2014 when they implemented medical cannabis laws in an environment in which the federal government took a hands-off attitude. Related: [Yes, pot should be legal. But it shouldnt be sold for a profit.] And its not just about savings: Cannabis generates substantial economic benefits as well. In 2016, Colorado saw the cannabis industry grow to about $1.3 billion in sales. Colorado levies substantial taxes on cannabis; as a consequence, it generated almost $200 million in tax revenue. Recent estimates suggest that states will collect nearly $655 million in tax revenue from cannabis sales nationwide. Not only are those direct contributions to stressed state budgets, but those taxes represent tens of thousands of jobs and the associated economic activity. At least four state governors recently wrote Sessions to ask him to let states pursue their own policies without federal interference. Because state budgets would suffer if Sessions reversed the current federal position, state attorneys general would have standing to sue the Justice Department to force Sessions to actually implement the 1970 Controlled Substances Act, which insists that a drug can be listed as Schedule I only if there is no currently accepted medical use. The January NAS report, recent revisions to the NIDA position, and literally hundreds of peer-reviewed clinical research articles make clear that cannabis has many medical uses. This, finally, could end conflicts between state medical cannabis laws and federal law: Physicians could legally prescribe cannabis and patients could get medical supervision for their care. (Of course, states would still be free to restrict access to medical cannabis if they chose to do so.) If Sessions does target cannabis as part of his new war on drugs, there is one final reason to believe the states would win and he would lose. The American people want access to medical cannabis. The most recent Quinnipiac Poll found that 94percent of Americans support medical access when directed by a physician (including 96 percent of Democrats and 90 percent of Republicans). That poll found 73percent of respondents oppose enforcing federal cannabis laws against state laws. Nearly three-quarters of the U.S. population lives in states that have legalized medical cannabis, and states have powerful incentives to preserve their laws. There is almost universal popular opinion in favor of the availability of medical cannabis. The tide has already turned. Related: [The junk science behind the marijuana legalization movement] 0", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/news/early-lead/wp/2018/01/03/mike-tyson-breaks-ground-on-40-acre-marijuana-ranch-in-california/", "domain": "washingtonpost.com", "title": "Mike Tyson breaks ground on 40-acre marijuana ranch in California", "authors": ["Des Bieler"], "publish_date": "01-3-2018", "text": "at 1:58 AM From Iron Mike to Marijuana Mike? (Mike Stobe/Getty Images for USTA/) Mike Tyson is on the verge of becoming a heavyweight in Californias burgeoning marijuana industry. The former boxer and some business partners have broken ground on a 40-acre ranch in the state that they envision as a destination for growers and consumers of newly legal weed. California, which had allowed licensed medical marijuana use, legalized recreational pot Jan. 1, and Tyson is looking to capitalize in a big way. The Blast reported Monday that the 51-year-old former heavyweight champion broke ground last month on a cannabis resort to be locatedin California City, a town in the Mojave Desert about a 110-mile drive north from Los Angeles. The location is also a much shorter drive north from Edwards Air Force Base, and according to The Blast, taking care of men and women who have served in the armed forces is a top priority forTysonHolistic, the company that will operate the resort, to be called Tyson Ranch. The Blast noted that cannabidiol, a marijuana extract that does notprovide the highfamously associated with tetrahydrocannabinol, has been used by some veterans to treat cases ofpost-traumatic stress disorder, and it is touted by advocates as having other therapeutic properties as well. Tyson Ranch will reportedly set aside 20 acres for the cultivation of marijuana by master growers, while the property will also feature facilities to help the growers and those interested in becoming one. In addition, the ranch will offer an edibles factory, an amphitheater and areas for glamping . The groundbreaking ceremony included two of Tysons business partners,Robert Hickman and Jay Strommen,andCalifornia City Mayor Jennifer Wood. She said the ranch would help engineer a rebirth for her town, a planned city that never flourished in the way its1950s developers envisioned. Hickman told The Blast that the undeveloped lands in California City are primed to be cultivated. The city has sought to boost its economy in recent years by attracting marijuana-related businesses. Tyson has spoken in the past about using marijuana extensively during his boxing career, as well as having been addicted at times to cocaine. His October 2000 win by technical knockout over Andrew Golota was subsequently changed to no contest after Tyson tested positive for marijuana. More from The Post: Isaiah Thomas is back. What does it mean for the Cleveland Cavaliers? Is the College Football Playoff championship getting a little too familiar? The mother of all stats doesnt see the Patriots as Super Bowl contenders Carson Palmer follows Bruce Arians into retirement. Is Larry Fitzgerald next? Des Bieler writes for the Early Lead and the D.C. Sports Bog, scouring the Web to bring readers items of interest, both serious and amusing. He also covers fantasy football. He came to The Post in 1995.", "summary": null}
{"url": "https://www.washingtonpost.com/archive/business/1981/01/05/religions-marijuana-services-test-what-the-first-amendment-stands-for/18f9ffaa-4ab4-4c01-941f-b4271199a1f5/", "domain": "washingtonpost.com", "title": "Religion's Marijuana Services Test What the First Amendment Stands For", "authors": ["Lewis R. Katz By Lewis R. Katz"], "publish_date": "01-5-1981", "text": "Americans who worship at the altar of marijuana had better not look to the First Amendment's guarantee of religious freedom to keep them out of jail, suggests one recent case. That message was sent by the Florida Supreme Court to the Ethiopian Zion Coptic Church, a Miami sect that uses marijuana as an integral part of its worship service. The U.S. Supreme Court has shown no inclination to send a different message since it refused even to consider the issue. Florida and U.S. officials have mounted a pincer attack against the Coptics. State authorities obtained an injunction against a church member barring her from using her home as a church, in violation of zoning regulations. It also prhibits the use of marijuana there. vThe Florida Supreme Court upheld the injunction. The other half of the attack is being played out in a federal district court in Miami, where other church members are being prosecuted on charges of violating federal drug prohibitions. The trials were scheduled to get under way this month, although legal maneuvering has caused postponement until at least February. The Ethiopian Zion Coptic Church is not the first religious group in U.S. history to encounter difficulties in its attempts to find religious freedom. Many of the early colonies, though populated by settlers fleeing religious persecution in Europe, were not safe havens for groups who came with rites and rituals different than those already established. In an attempt to end intolerance in the New World, the guarantee of freedom of religion received star billing in the First Amendment of the Bill of Rights -- prohibiting Congress and later individual states as well, from interfering with the free exercise of religion. Nurtured by the protection of the First Amendment, various cults and religions sprang up. Snake handlers, poison drinkers and mystics of all kinds flourished in some of the atypicalsects. The mix of drugs and religion is familiar to the region, dating back to ancient Indian rites. The flower children of the '60s incorporated marijuana and hallucinogens into their forms of worship. The Ethiopian Zion Coptic Church comes closer to the Indian experience than to the religions that sprang up a decade or so ago. While the Constitution clearly allows legal authorities to prosecute persons who claim religious beliefs solely as a cover to engage in illegal activities, the constitutionality is not so apparent where the illegal activity is an integral part of the worship service of a group that meets existing legal standards as a religion. And while marijuana is an important part of the rite of the Coptic Church, its doctrine extends to other matters. Even the Florida Supreme Court found the Ethiopian Zion Coptic Church to be authentic religion as with regard to the First Amendment to the Constitution. The Miami-based Coptic group claims links with the 6,000 year-old Coptic Church, but its more recent origins can be traced to the Rastafarians of Marcus Garvey's movement urging American blacks to look to Africa as a holy land. Rastafarianism called itself after Ethiopian Emperor Haile Selassie's name as a commoner. Selassie's crowning as emperor was seen as the fulfillment of Garvey's prophecy to \"Look to Africa when a black king shall be crowned, for the day of deliverance is near.\" Restafarians established settlements in Jamaica where believers lived together and convened to worship together. One of these missions became known as the Ethiopian Zion Coptic Church, whose doctrine feature is a process called \"reasoning,\" which involves a philosophical and theological dialogue accompanied by the smoking of marijuana. Marijuana is the sacrament of the church, replacing wine as the symbolic spirit of Christ. Deemed the spiritual power which unites men in one spirit, marijuana is smoked by church members three times a day, during morning, afternoon and evening worship services. Ethiopian Zion Coptic Church members contend that through marijuana or \"ganja,\" its Jamaican name, man is able to look at God by looking within himself, the embodiment of God on earth. Attorney Milton M. Ferrell, Jr., who represents the Coptics in their legal battles, contended in a telephone interview that church members adhere to such strict doctrines and dietary laws that others are hardly likely to adopt the Coptic's way of life just to smoke marijuana. Having qualified as a legitimate church, the Coptics cleared their first legal hurdle but there remained one indisputable point: Governmental interference with religious practice is permissable if the state can \"demonstrate a compelling interest\" superceding the constitutional protection. To establish such a compelling interest, a state cannot offer just any reasonable justification. It must be one that is sufficient to overcome the strong policy in favor of not interfering with religious practices. For instance, constitutional protection of the freedom of religion clause takes a back seat when life is at stake or when a substantial health emergency threatens a community. Ordering medical care for an endangered child despite religious objections by the parents is an example of this kind of compelling interest. Other infringements that have passed constitutional muster are the compulsion that an individual be vaccinated despite objections based on religious handling of poisonous snakes. The Florida Supreme Court found the legislature's determination that cannabis is a dangerous drug sufficiently compelling to negate the church members' constitutional rights. This is not the type of strict scrutiny to which government attempts to regulate First Amendment rights are usually subjected, especially in light of the many medical experts that the church had rounded up to contest the finding of \"dangerousness.\" The ill effects of marijuana remain a debatable issue. While states may freely ban its common use, interference with it in a religious context should require more convincing proof. Florida courts undoubtedly were influenced against the church by the claim that the Coptics freely distributed marijuana to \"children and adults, members and nonmembers.\" The Florida Supreme Court was thus able to distinguish the Coptics' claim from an earlier case where the California Supreme Court prohibited the state from interfering with the use of peyote by adult Navajo Indians as part of their religion. Attoney Farrell charged that the finding of casual distribution was based upon only one instance when a nonmember juvenile smoked marijuana at a church service, a youth who had gained entry by lying to guards posted by the Coptics, he said. While most of us are unlikely to take the cause of the Coptics seriously, the guarantee of religious freedom is not reserved for those religions to which the majority of us subscribe. In fact, the real worth of any constitutional protection may be determined by how well it guarantees the rights of people on the fringe. When the criminal trials begin in Miami, at stake will be the freedom of church members as well as the religious liberty of the Coptics. tPerhaps the possibility of prison sentences being meted out will result in the application of the more serious First Amendment test to the Coptics' claim. business Get 2016 Olympics updates by email Our best news and analysis from Rio, delivered to your inbox. post_newsletter333 magnet-olympics2016 false endOfArticle false Please provide a valid email address.", "summary": null}
