{"url": "http://www.foxnews.com/entertainment/2009/04/09/seth-rogen-says-smoking-weed-guy/print", "domain": "foxnews.com", "title": "Seth Rogen Says He Was More of a 'Smoking Weed Behind the 7-11 Guy'", "authors": ["FOXNews"], "publish_date": "04-09-2009", "text": "Seth Rogen may play a mall cop in his new movie, but malls weren't his primary hang-out when he was a kid. \"I was more of a smoking weed behind the 7-Eleven guy,\" Rogen told Tuesday at the premiere of \"Observe and Report.\" \"So yeah, didnt go to the mall much.\" Rogen's very glad he chose acting over a career in mall security. \"[Being a mall cop] is not the greatest job in the world I think,\" he said. \"They get a lot of disrespect.\" Co-star Ana Faris concurred. \"They just dont have enough power,\" she said. \"I was a patrol crossing guard in elementary school, man. I loved it. I loved the power.\" Faris, who plays a makeup counter girl in the movie, the object of Rogen's affection, has fond memories of mall life. \"Ahhhh, Orange Julius,\" she opined. \"We also had Glamour Shots. I could never afford to go get my glamour shots done. But we would always walk past it, my girlfriends and I, just dreaming [about getting] our glamour shots done one day.\" Co-star Ray Liotta's mall memories were not so rosy. \"I was driving my moms car. I was on vacation from college. I took it to a mall. I came out, and it was gone. Someone stole it. Thats my mall story.\"", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2011/03/29/willie-nelson-sing-freedom-texas-pot-case/print", "domain": "foxnews.com", "title": "Willie Nelson Could Sing for His Freedom in Texas Pot Case", "authors": ["NewsCore"], "publish_date": "03-29-2011", "text": "The prosecutor in Willie Nelson's marijuana possession case said the country music legend could get off with just a fine if he agrees to sing one of his songs in court, TMZ reported Monday. Nelson, 77, was busted at a border patrol checkpoint in Sierra Blanca, Texas, en route to Austin on November 25 last year. He was arrested but released when he posted $2,500 bond at Hudspeth County Jail. The prosecutor in the case said he was willing to let Nelson off with a $100 fine if Nelson performed his song \"Blue Eyes Smiling in the Rain\" in the courtroom, TMZ said. The prosecutor reportedly said the song would count as Nelson's community service. If Nelson chooses not to accept the prosecutor's offer, he could face a maximum of 180 days in jail and a $2,000 fine if convicted when he appears in court, at a date yet to be decided.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2012/01/26/brad-pitt-spent-decade-smoking-pot-which-0s-star-was-biggest-screwup/print", "domain": "foxnews.com", "title": "Brad Pitt spent decade smoking marijuana: Which '90s star came out on top?", "authors": ["SodaHead.com"], "publish_date": "01-26-2012", "text": "One the biggest stars in the world, Brad Pitt has been nominated for Oscars and has a gorgeous partner and six kids. But in the '90s, he nearly puffed away all his good fortune. \"I got really sick of myself at the end of the 1990s: I was hiding out from the celebrity thing; I was smoking way too much dope; I was sitting on the couch and just turning into a doughnut; and I really got irritated with myself,\" the 48-year-old actor tells The Hollywood Reporter. \"I got to: 'What's the point? I know better than this.'\" After a life-changing trip to Casablanca, Morocco , \"where I saw poverty to an extreme I had never witnessed before,\" Pitt quit smoking weed. \"I just quit. I stopped grass then -- I mean, pretty much -- and decided to get off the couch,\" he tells the magazine. Today, the father of six is happily committed to his partner of seven years, Angelina Jolie , and -- stop the presses -- he may even marry her. \"It seems to mean more and more to our kids. We made this declaration some time ago that we weren't going to do it till everyone can. But I don't think we'll be able to hold out. It means so much to my kids, and they ask a lot. And it means something to me, too, to make that kind of commitment.\" \"We haven't closed the book on it. There's a really nice balance in the house right now, but if we see the need and get that lightning bolt that says, 'We can help this person; we could do something here,' then absolutely,\" he says. Pitt may be clean and sober now, but his stoner past got us wondering: From Pitt to Courtney Love to Winona Ryder , which '90s star came out on top and who burned out?", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2010/07/23/rocker-bret-michaels-buster-pot-drugs-tour-bus/print", "domain": "foxnews.com", "title": "Rocker Bret Michaels Busted for Pot, Other Drugs on Tour Bus", "authors": ["NewsCore"], "publish_date": "07-23-2010", "text": "Indiana police found marijuana and other unidentified controlled substances on rocker Bret Michaels tour buses, The Fort Wayne News-Sentinel reported Friday. Two tour buses, one of which carried the rock star, were pulled over in DeKalb County, northeast Indiana, before midnight local time Wednesday. Police stopped the caravan because a trailer connected to one of the buses did not have a license plate light. Police then searched the second bus, where Michaels was a passenger, and also found illegal drugs. The veteran rocker was reportedly very cooperative in allowing the searches. Police made no arrests but charges have been forwarded to the DeKalb County Prosecutor's Office. Both buses were allowed to continued. Michaels, former frontman of rock band Poison and the 2010 winner of the Celebrity Apprentice 3, is currently on his Roses & Thorns tour in the U.S. The 47-year-old recently overcame a brain aneurysm and a warning stroke earlier in 2010.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2010/08/18/cheech-marin-slams-arizona-immigration-law-calls-legalization-pot/", "domain": "foxnews.com", "title": "Cheech Marin Slams Arizona Immigration Law, Calls for Legalization of Pot", "authors": ["Hollie McKay"], "publish_date": "08-19-2010", "text": "Mexican-American actor Richard Anthony \"Cheech\" Marin is slamming the Arizona immigration law as little more than an attempt to hold on to white culture. Its ridiculous; its the last gasp of white culture, he told Pop Tarts at the Los Angeles launch last week of Disney Pixar's online \"World of Cars.\" Reactionaries and Congress (are to blame) only because they think that's the way of getting votes. We'll stir up the rabble! If you take the Mexicans out of Arizona, Arizona is going to collapse the next day. But its not only the immigration law with which Marin takes issue. The \"Up in Smoke\" star would also like to see marijuana legalized. According to Marin, President Obama is doing enough to support the fight for marijuana legalization by \"not prosecuting\" those who use medical marijuana, but he'd like to see the president live up to his campaign of \"hope\" and devote some attention to America's economic crisis. \"In (Obama's) administration, I'd like to see marijuana legalized and I'd like to see him keep working to straighten out the economy, because at the end of the day, no matter how highfalutin your philosophy is, if the economy isn't working, then the country isn't happening,\" Marin said. Its no surprise Marin is advocating the legalization of marijuana, considering he achieved international stardom for his pot-promoting antics as one half of the \"Cheech & Chong\" comedy duo. And now that the legalization of marijuana is becoming a very real possibility, the 64-year-old is convinced everyone else shares his passion. \"Vote! Just vote, because if everyone thinks marijuana should be legalized, it'll pass with flying colors,\" Marin said of Proposition 19, which would legalize the drug. Marin believes that the drug has yet to become legal across the country due to lobbying from law enforcement officials who fear that, without it being considered a criminal offense, they will be unemployed. And anyone who opposes the recreational use of his favorite herb? \"Don't do it, don't vote! It's a democratic process, and nobody is forcing marijuana down anybody's throats, and nobody is forcing beer down anybody's throat, he said. They can go and have a beer or martini, so I should be able to smoke a joint if I want one. In a report authored by the National Organization to Reform Marijuana Laws, reliable scientific research has concluded that driving while under the influence of pot impairs vision and slows reaction time. But unlike alcohol detection, law enforcement currently lacks the technology to accurately determine offenders. And while Marin doesnt advocate driving while smoking, he says he should be able to enjoy it at home if he wants. If I want to sit home and smoke a joint and play guitar or watch TV, I should be able to do that, he said.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2010/11/23/hugh-hefner-talks-monogomy-miley-cyrus-marijuana/", "domain": "foxnews.com", "title": "Hugh Hefner Talks Monogamy, Miley Cyrus and Marijuana", "authors": ["Hollie McKay"], "publish_date": "11-23-2010", "text": "In light of the countless celebrity cheating and sex scandals of 2010, Playboys legendary founder Hugh Hefner says it all boils down to his original theory that human beings are not meant to be monogamous. I think that monogamy is something that has been invented along the way to take care of children, he explained. Speaking of children, Disney darling turned racy pop star Miley Cyrus enters adulthood as she celebrates her 18th birthday Tuesday, and we couldnt help but ask if any offers were on the table for her to make her adult status a little more official with an appearance in the mens magazine The simple answer is she is the one that you and all the other readers would like to see, Hef said coyly. That person changes every month and year, it depends on who the hot celebrity of the month is. The 84-year-old is reportedly still vying to spend $123 million to buy back the outstanding shares in his beloved Playboy Enterprises Inc., which was founded to manage the Playboy magazine empire, and even though rival publication Penthouse is willing to dish out even more money, Hef controls 70 percent of the voting thus its likely the enterprise he built in 1983 will remain in his hands More on this... The Handsome and Always Charming Hugh Hefner And he certainly has plans to build the Playboy brand far behind its glossy pages, and bounce the bunnies all over the world. The market for magazines and books and newspapers is changing and everything is becoming electronic so were shifting the focus, Hef added. The magazine remains the heart and soul of the company, but increasingly the end of it will be driven by the casinos and Playboy products around the world. The brand itself, despite all the economic problems, the brand itself is hotter than ever. But our interview with the icon wasnt all about business, pop culture and relationship advice. He also shared his thoughts on California voters striking down bids to legalize marijuana. I dont think theres any question that marijuana should be legalized because to not legalize it, were paying the same price we paid for prohibition, he told Pop Tarts last Wednesday, before receiving the Award of Honor & First Amendment Awardat the PEN Center USA's 20th Annual Literary Awards Festival in Los Angeles. In other words, it is a medical concern and it should be handled that way.", "summary": null}
{"url": "http://www.foxnews.com/auto/2012/11/02/porsche-headlights-being-pilfered-to-grow-pot.html", "domain": "foxnews.com", "title": "Porsche headlights being pilfered to grow pot", "authors": ["Kurt Ernst"], "publish_date": "11-02-2012", "text": "(Porsche) HID headlights have always been a target for thieves, and some brands of automobiles have earned a reputation for being easy to steal from. Such is the case with Porsche , which is why a Miami-Dade Circuit Court judge recently approved a class action lawsuit over Porsches headlight design. Not every HID headlight stolen winds up in another car, however, as thieves in Amsterdam have recently begun harvesting xenon headlamps from Porsche Cayenne and Panamera models for a decidedly different purpose: growing marijuana. The xenon bulbs used in Porsches lighting systems coincidentally deliver a just-right blend of light and heat for budding amateur horticulturists, and they offer the side benefit of being energy-efficient, too. Nothing says grow house to the police quite like a tripling of the electric bill from month to month. As De Telegraafs AutoVisie reports, some 20 Porsche owners have had headlights stolen in the last week alone. Adding insult to injury, prying the headlight assemblies from the cars with a screw driver often results in thousands of dollars worth of additional damage on top of the cost of replacing the headlights. If you have a Porsche Panamera or Cayenne and park it outside, you may want to sleep in your car until this latest trend blows over. As you can see from the surveillance video below, even security cameras fail to act as a deterrent.", "summary": null}
{"url": "http://www.foxnews.com/auto/2017/01/23/pot-pursuit-speeder-tosses-drugs-from-car-during-highway-chase.html", "domain": "foxnews.com", "title": "Pot pursuit: Speeder tosses drugs from car during highway chase", "authors": ["Fox News"], "publish_date": "01-23-2017", "text": "Note to drug dealers: throwing bags of pot out of your car wont make it fast enough to outrun the law. A Maine State Police aerial unit spotted a red BMW speeding down the Maine Turnpike through city of Saco on the morning of January 20 th , then sent a highway patrol car in pursuit, police said in a Facebook post. According to the trooper on the ground, the car initially refused to stop as its occupants began tossing bags of marijuana out of the window. A Maine State Police public information officer could not confirm how fast the car was going at the time. It finally pulled over after about two miles and police discovered 3.7 pounds of marijuana in it. The driver, 23-year-old Brandon Joseph Dagnese, was arrested and charged with unlawful trafficking, failing to stop for a law enforcement officer, and violating bail stepping from previous drug charges. The new charges carry penalties that range from a maximum of three to five years in jail.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2009/04/03/carlos-santana-president-obama-legalize-pot-dude.html?cmpid=prn_foxsports", "domain": "foxnews.com", "title": "Carlos Santana to President Obama: Legalize Pot, Dude!", "authors": ["Fox News"], "publish_date": "01-14-2015", "text": "President Barack Obama brushed off a question about legalizing marijuana in his online town hall last month, but guitar god Carlos Santana says he wishes he would seriously consider it. \"Legalize marijuana and take all that money and invest it in teachers and in education,\" Santana said in an interview this week. \"You will see a transformation in America.\" During his online town hall on March 26, Obama fielded a question about whether legalization of the illicit drug would help pull the nation out of recession. Obama said he didn't think it was good economic policy, and also joked: \"I don't know what this says about the online audience.\" But Santana said making pot legal is \"really way overdue, like the prohibition with the alcohol and stuff like that. \"I really believe that as soon as we legalize and decriminalize marijuana we can actually afford a really good governor who won't keep taking money away from education and from teachers and send him back to Hollywood where he can do 'D' movies and we can get an 'A' governor,\" referring to former movie action hero and California Gov. Arnold Schwarzenegger . Santana made the comments as he was promoting his upcoming rock residency in Las Vegas at the Hard Rock Hotel & Casino. The show debuts May 27 and runs through 2010. \"It's a milestone for me because I always said I would never do certain things,\" Santana said, adding that the list included staying in one place for too long. \"Yet what is very different is this is the year I decided to do all the things that I said I would never do. It's a way of coming into a room that I thought was dark and I would be afraid and I actually bring my light to it.\" Santana, whose hits vary from \"Evil Ways\" to \"Maria Maria,\" said he is also working on two upcoming albums. While the 61-year-old has previously talked about a possible retirement, he's decided to be more careful about predicting the future. \"Every time I tell God my plans he cracks up, he starts laughing. So I just decided to be quiet for a while and not say that I am going to retire and go to Maui and become a minister,\" he said. \"God was cracking up. He thought it was a good joke. So I said, 'OK.' Every time I want to make him laugh I tell him my plans. So we'll see.\"", "summary": null}
{"url": "https://www.foxnews.com/auto/scientific-basis-for-laws-on-marijuana-driving-questioned", "domain": "foxnews.com", "title": "Scientific basis for laws on marijuana, driving questioned", "authors": ["Associated Press"], "publish_date": "05-10-2016", "text": "Six states that allow marijuana use have legal tests to determine driving while impaired by the drug that have no scientific basis, according to a study by the nation's largest automobile club that calls for scrapping those laws. The study commissioned by AAA's safety foundation said it's not possible to set a blood-test threshold for THC, the chemical in marijuana that makes people high, that can reliably determine impairment. Yet the laws in five of the six states automatically presume a driver guilty if that person tests higher than the limit, and not guilty if it's lower. As a result, drivers who are unsafe may be going free while others may be wrongly convicted, the foundation said. The foundation recommends replacing the laws with ones that rely on specially trained police officers to determine if a driver is impaired, backed up by a test for the presence of THC rather than a specific threshold. The officers are supposed to screen for dozens of indicators of drug use, from pupil dilation and tongue color to behavior. The foundation's recommendation to scrap the laws in Colorado, Montana, Nevada, Ohio, Pennsylvania and Washington comes as legislatures in several more states consider adopting similar laws. At least three states, and possibly as many as eleven, will also vote this fall on ballot measures to legalize marijuana for either recreational or medicinal use, or both. Several legislatures are also considering legalization bills. \"There is understandably a strong desire by both lawmakers and the public to create legal limits for marijuana impairment in the same manner we do alcohol,\" said Marshall Doney, AAA's president and CEO. \"In the case of marijuana, this approach is flawed and not supported by scientific research.\" Determining whether someone is impaired by marijuana, as opposed to having merely used the drug at some time, is far more complex than the simple and reliable tests that have been developed for alcohol impairment. There's no science that shows drivers become impaired at a specific level of THC in the blood. A lot depends upon the individual. Drivers with relatively high levels of THC in their systems might not be impaired, especially if they are regular users, while others with relatively low levels may be unsafe behind the wheel. Some drivers may be impaired when they are stopped by police, but by the time their blood is tested they have fallen below the legal threshold because active THC dissipates rapidly. The average time to collect blood from a suspected driver is often more than two hours because taking a blood sample typically requires a warrant and transport to a police station or hospital, the foundation said. In addition, frequent marijuana users can exhibit persistent levels of the drug long after use, while THC levels can decline more rapidly among occasional users. Nine states, including some that have legalized marijuana for medicinal use, have zero-tolerance laws for driving and marijuana that make not only the presence of THC in a driver's blood illegal, but also the presence of its metabolites, which can linger for weeks after use. That makes no sense, said Mark A. R. Kleiman, a New York University professor specializing in issues involving drugs and criminal policy. \"A law against driving with THC in your bloodstream is not a law you can know you are obeying except by never smoking marijuana or never driving,\" he said. He said rather than switching to a new kind of law as AAA recommends, states should consider simply making it a traffic violation. Studies show that using marijuana and driving roughly doubles the risk of a crash, Kleiman said. By comparison, talking on a hands-free cellphone while driving legal in all states quadruples crash risk, he said. A blood alcohol content of .12, which is about the median amount in drunken driving cases, increases crash risk by about 15 times, he said. Driving with \"a noisy child in the back of the car\" is about as dangerous as using marijuana and driving, Kleiman said. The exception is when a driver has both been using marijuana and drinking alcohol because the two substances together greatly heighten impairment, he said. The foundation also released a second study that found the share of drivers in fatal crashes who had recently used marijuana doubled in Washington after the state legalized it for recreational use in December 2012. From 2013 to 2014, the share of drivers who had recently used marijuana rose from 8 percent to 17 percent. While it stopped short of blaming the crashes on that increase, AAA traffic safety director Jake Nelson said traffic fatalities went up 6 percent in Washington during that same period while the fatalities nationally declined.", "summary": null}
{"url": "https://www.foxnews.com/entertainment/2014-emmys-marijuana-takes-center-stage", "domain": "foxnews.com", "title": "2014 Emmys: Marijuana takes center stage", "authors": ["Hollie McKay"], "publish_date": "08-26-2014", "text": "The 66th Annual Primetime Emmys might have lacked in laughs, but it still managed to hit plenty of high notes. Monday nights telecast was peppered in jabs and jokes centered on pot which is legal for medical purposes in the state of California and perhaps signifies how vast the movement is gaining acceptance across the country. Cable is looking at Netflix the way Justin Bieber looks at One Direction, through a cloud of marijuana smoke, host Seth Meyers said in his opening monologue, mocking the pop princes various alleged encounters with marijuana-centric controversies. Haley Delany later praiseD her Louie TV father Louis C.K in a pre-taped video for educating her on how to properly hold a joint, while Jimmy Kimmel took aim at actor Matthew McConaughey for selling his television for a conch shell full of weed. Amy Poehler took the marijuana antics one step further by declaring that McConaughey and his True Detective co-star Woody Harrelson are menu items at most marijuana dispensaries. Singer Adam Levine also gave us a small fist pump in support of the legalization of marijuana in the United States. But it was Sarah Silvermans weed-promoting antics throughout the evening that garnered the most attention. This is my pot, my liquid pot, she enthused on the red carpet, pulling out her vaporizer pen and later insisting that her purse must-haves are a phone and pot and gum. The comedienne went on to win the award for Outstanding Writing in a Variety Special for her HBO Comedy Special Sarah Silverman: We Are Miracles, kicking off her shoes and running fiercely to the stage where she declared that were all just made of molecules and were all hurling through space right now. But the oddities didnt end there. A distracted Silverman attributed her questionable actions to feeling weird having just watched the Robin Williams tribute, and insisted that she wasnt stoned. I dont drink. I like to have a puff as a treat at appropriate times, she continued, also noting that she brought some pot-based goods for later in the evening. However, the nonsensical rhetoric was particularly evident after she was asked what her Jewish mother would think of her accepting such an award sans footwear. Well my Jewish mom wears overalls with two different color socks so I think shed go, think it was cool. But dont tell anyone Im doing this. They just hurt, the shoes just hurt, Silverman rambled. Theyre very nice. Theyre by Geppetto. I remember that because he made Pinocchio and also clearly designed shoes for the Nazi war effort. Dont be mad at me. Even when the cameras werent rolling, Silvermans potentially pot-peppered ways went on. As she left the Nokia Theater and made her way down the street to the Governors Ball, her heels still in her hand, Silverman seemed strung out about missing her purse abruptly stopping in her tracks to try and sort the matter out. The pot-themed awards show wasnt lost on audiences either. Was this the first Emmys since pot was legalized or something? one viewer tweeted, others called it something of a stony night while another quipped: lets give it up for the real winner tonight Im talking of course, about pot. As it stands, 23 states and DC have legislation allowing medical marijuana usage; with the issue of decriminalizing pot use altogether a growing topic of debate ahead of the 2016 Presidential election. But the promotion of pot at the Emmy Awards is likely just the beginning. According to multiple reports, the hand-held Haze Vaporizer by Haze Technologies will be featured in the official Oscars 2015 gift bag. While e-cigarettes have previously been nestled in the goodie bag, this will mark the first time a marijuana-focused vaporizer will be rolled inside.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2013/01/03/miss-universe-olivia-culpo-doesnt-like-pot/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fentertainment+%28Internal+-+Entertainment+-+Mixed%29", "domain": "foxnews.com", "title": "Miss Universe Olivia Culpo against legalization of marijuana", "authors": ["Fox News"], "publish_date": "01-03-2013", "text": "On the second day of her reign Miss Universe Olivia Culpo has weighed in on a controversial topic, coming down squarely against the legalization of marijuana. The newly crowned 20-year-old opened up to Fox News about her thoughts on the drug, saying she is against pot becoming legal. \"I think that for medical purposes it is OK,\" she said.I dont think its good for recreational purposes. There are just too many bad habits that go with the drug.\" Culpo also took the opportunity to comment a report from the New York Daily News that she is looking for a dinner date. She said the report was not true, and she is not interested in finding a boyfriend right now. This job is enough, she said. Culpo told Fox her life has changed drastically since she was crowned last month. Fifteen months ago was my first pageant ever, she told Fox. Now, she plans to spend the next year traveling as a spokesperson for HIV awareness. Culpo is the first Miss USA to win Miss Universe in more than a decade.", "summary": null}
