{"url": "http://www.foxnews.com/entertainment/2013/02/08/exclusivenew-discovery-channel-series-pot-cops-chronicles-marijuana-crackdown/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fentertainment+%28Internal+-+Entertainment+-+Mixed%29", "domain": "foxnews.com", "title": "Exclusive: New Discovery Channel series 'Pot Cops' chronicles marijuana crackdown", "authors": ["Hollie McKay"], "publish_date": "02-08-2013", "text": "When one thinks of California, images of gunfire, booby traps and deadly cartels dont usually come to mind. However, the Discovery Channel is aiming to expose the states dark side in the new series Pot Cops, which follows a drug enforcement unit in Humboldt County, Calif. who work to bring down both cartels and the average Joe growers operating in the area. And thats no easy task. The drug trafficking organizations that generally come from Mexico will sometimes put booby traps coming [for] people that are trying to steal or for law enforcement trying to eradicate their crops. A drug cartel is a serious criminal organization, theres a lot of money to be made and when theres a lot of money to be made, there is a higher potential for violence, SWAT team member, Deputy Greg Musson who stars in the show told FOX411s Pop Tarts column. Obviously there is a level of the unknown One of the guys on the team and on the show has been involved in a shooting during a marijuana crackdown. Pot Cops will give audiences an unprecedented look at what it takes to conquer growers who are running a large weed farm in the Redwoods and shooting at local children on a reservation, as well as a bizarre, slow-speed chase of a stoned grower and investigations into parents who may be putting their own children at risk while hiding a huge grow somewhere in the surrounding hills. But what Musson anticipates viewers will be most surprised to learn more about is the heavily-debated medical marijuana issue, and he claims that in his decade-long career as a law enforcement officer, he can count on one hand the amount of legal growers he has encountered. We are not interested in interfering with people who have a legitimate marijuana license for their own personal use, and contrary to popular belief, it is not legal to grow marijuana for profit. It is illegal even with the license, Musson insisted. It is also illegal to give it away, just as it is to sell it. Even if you have a medical need. Thats the main thing we would like to get out there to people.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2013/02/09/snoop-dogg-smokes-marijuana-on-stage-during-bmi-songwriting-panel/print", "domain": "foxnews.com", "title": "Snoop Dogg smokes marijuana on stage during BMI songwriting panel", "authors": ["Associated Press"], "publish_date": "02-09-2013", "text": "Music fans who turned out to BMI's annual pre-Grammy Awards \"How I Wrote That Song\" discussion got a little more than they expected thanks to Snoop Dogg -- a contact high. The rapper smoked marijuana during Saturday's panel discussion, lighting up a large, Kush-filled blunt on stage at The Roxy. He briefly passed it off to B.o.B before methodically reducing it to ash over a 15-minute period. The panel also included Busta Rhymes and songwriters Luke Laird and Evan Bogart, all of whom abstained -- at least on stage. Fittingly, the conversation eventually turned to Snoop's groundbreaking work on \"The Chronic.\" Laird recalled growing up at the end of a dirt road in a small town of 700 in rural Pennsylvania. Yet Snoop's work with Dr. Dre still infiltrated his world and that of all the other country kids around him. \"Let me just say, the album everyone was listening to was `The Chronic,\"' Laird said, noting how surreal it was to be sitting on stage with Snoop. With acoustic guitar in hand, he played a bit of his Blake Shelton hit \"Hillbilly Bone\" in its original form: a rap song. The Nashville-based songwriter had everyone bobbing their heads to the beat. \"Now I feel like more than ever you see these influences crossing genres,\" Laird said.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2013/05/24/actress-bynes-arrested-in-nyc-on-marijuana-charge/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fmost-popular+%28Internal+-+Most+Popular+Content%29", "domain": "foxnews.com", "title": "Amanda Bynes free after arrest for tossing bong out of apartment window, police say", "authors": ["Hollie McKay"], "publish_date": "05-24-2013", "text": "Amanda Bynes is a free woman again. The troubled actress was released from police custody after she appeared in a New York court on Friday morning, the Manhattan District Attorney's Office confirmed to FOX 411. ADVERTISEMENT ADVERTISEMENT Bynes was released on her own recognizance-- meaning she did not have to post bail-- and she will have to appear in court again on July 9 to address her latest legal woes. Police say the actress was arrested in midtown Manhattan after she heaved a marijuana bong out of a window. The officers went to her apartment on the 36th floor where they said they saw heavy smoke and a bong sitting on the kitchen counter. They said she tossed the bong out the window in front of them, prosecutors said. She then said to police: \"It was just a vase,\" according to Manhattan assistant district attorney Chikaelo Ibeabuchi. \"My client completely denies illegally throwing anything out of her window,\" said Andrew Friedman, her attorney for the arraignment. Police say a building official called police to complain that Bynes was smoking marijuana and rolling a joint in the building's lobby. An NYPD spokesperson told XXX the actress was then taken to Roosevelt Hospital to be evaluated. A source connected to the situation told XXX that while a full preliminary psychiatric evaluation was performed on Bynes, professionals found no reason to keep her on a medical hold. She was acting crazy, but there is no law against being crazy in the United States and they cant hold you for that. She is not suicidal, and not considered to be a danger to herself or society, explained the insider. They really tried to find a way to hold her, but no avail. Amanda isnt a dangerous girl, she seems desperate for attention and really acting out. After the evaluation, Bynes was taken the police station, where she spent the night. She pulled up to court Friday morning in a squad car where she was greeted by a crush of media. She was also charged with attempted tampering with evidence and unlawful possession of marijuana, all misdemeanors. \"I'm asking you I don't want any pictures,\" she said to a photographer. \"I don't want any photos. No press are allowed in here,\" she announced to the public courtroom. Bynes has gotten plenty of attention in recent months for her bizarre behavior. The 27-year-old is almost unrecognizable in recent photos , which show her with bleach blonde hair and shiny cheek piercings. She has been keeping fans up to date on her latest antics via Twitter, and she recently gained many followers after she posted a shockingly vulgar tweet about rapper Drake. Bynes first began acting in commercials at the age of 7 and was thrust into the limelight when she later became one of the stars of Nickelodeons comedy show All That. She then starred in Nickelodeons The Amanda Show from 1999-2002. Since then, her acting career has waned, and her last major role was in 2010s Easy A. Before that she appeared in films like What a Girl Wants and Hairspray. The starlet has said that there is NOTHING wrong with her and that she plans to launch a fashion line.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2010/11/29/willie-nelson-likely-face-jail-pot-bust-expert-says/print", "domain": "foxnews.com", "title": "Willie Nelson Will Likely Go to Jail for Pot Bust, Expert Says", "authors": ["Hollie McKay"], "publish_date": "11-29-2010", "text": "Willie Nelson was arrested in Sierra Blanca, Texas on Friday for possession of six ounces of pot. As a result, the country music legend faces as many as two years behind bars. If the Texas prosecutors do not reduce the charges, and the marijuana's weight is indeed six ounces, then he is dealing with felony and a potential minimum of 180 days in a county jail and a maximum of two years, with a $10,000 fine, explained former California-based prosecutor, Robin Sax. The arrest came after a border patrol officer smelled the substance on Nelsons tour bus at a checkpoint. After the marijuana was discovered, the braided country music legend and two others were arrested. Nelson was was held briefly on a $2,500 bond before being released. Sax said that Nelsons history of arrests is likely to work against him in the eyes of the law, and, unlike if his arrest occurred in California, jail time is probable. Nelson, 77, was arrested with one-and-a-half pounds of marijuana and three ounces of hallucinogenic mushrooms on his tour bus in 2006, and nine years before that, police in Waco, Texas spotted a joint in his cars ash tray, prompting another arrest. Texas is more stringent than California so he could face time.One of the issues that the court and prosecutors will look at is his prior record and given the fact that he has several arrests, even recent ones, for pot related crimes,\" Sax said. \"I would not be surprised if Texas decided to stick it to him.\" Nelson has won multiple Grammys, CMAs, AMAs - you name it, and is best known for songs like \"Crazy\" and \"On the Road Again.\"", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2011/03/14/james-freys-new-book-messiah-smoking-pot-sleeping-hooker/print", "domain": "foxnews.com", "title": "James Frey's New Book Has Messiah Smoking Pot, Sleeping With Hooker", "authors": ["New York Post"], "publish_date": "03-14-2011", "text": "Controversial author James Frey is set to ignite another firestorm with his new book, \"The Final Testament of the Holy Bible,\" in which the second coming of Christ takes place in The Bronx projects -- but the Messiah turns out to be a former alcoholic who impregnates a prostitute. Frey -- who was famously ripped apart on TV by Oprah Winfrey and ostracized by the literary community over his partly fabricated memoir, \"A Million Little Pieces\" -- has sidestepped traditional publishers and teamed up with gallery owner Larry Gagosian, who will publish just 11,000 copies in the U.S. while Frey will self-publish online. His Messiah, Ben Jones, starts off as a lonely alcoholic bachelor living in a filthy apartment. He survives a horrific work accident, but strange things then happen that lead to him being recognized as the Messiah. Ben also smokes pot, has sex with a prostitute and makes out with men. Ben tells followers that the Bible is \"antiquated,\" saying, \"The Bible was written 2,000 years ago. The world is a different place now. Stories that had meaning then are meaningless now . . . those books are dead.\" Of religion, he says, \"Faith is what you use to oppress, to justify, to judge in the name of God . . . a means to rationalize more evil in this world than anything in history. If there were a devil, faith would be his greatest invention.\" The novel will be released for maximum impact in the U.S. on Good Friday . Frey told us the book is \"a theoretical third volume of the Bible -- there was the Old, there was the New, and this is the Final.\" He said, \"I'm sure the religious right will go crazy because the story of Ben . . . is hardly the Messiah they have in mind. But I don't really care. I just did what I always do -- tried to write the best book I could.\"", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2010/09/08/bob-marleys-daughter-pleads-guilty-growing-marijuana-home/print.html", "domain": "foxnews.com", "title": "Bob Marley's Daughter Pleads Guilty to Growing Marijuana in Her Home", "authors": ["Associated Press"], "publish_date": "11-09-2010", "text": "The youngest child of reggae legend Bob Marley has admitted growing marijuana in her Philadelphia-area home. The Daily Local News of West Chester reports 29-year-old Makeda Jahnesta Marley pleaded guilty Tuesday to having nearly a dozen large marijuana plants inside her home west of Philadelphia. Marley was arrested in 2008 after police say they found her removing plants from the basement when officers arrived on a domestic dispute call. At a February hearing, Marley told the court she had exhausted a trust fund she received from her father's estate when she turned 18. Sentencing is scheduled for October.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2011/06/07/willie-nelson-fined-500-in-marijuana-case.html", "domain": "foxnews.com", "title": "Willie Nelson Fined $500 in Marijuana Case", "authors": ["TMZ"], "publish_date": "06-07-2011", "text": "Willie Nelson can breath easy again in Texas. TMZ has learned the singer struck a plea deal in his marijuana case and will not have to do any hard time. Sources close to Nelson tell TMZ that the singer agreed to plead no contest to misdemeanor possession of drug paraphernalia stemming from an incident last year, when cops say they found weed on the singer's tour bus at a border checkpoint. Nelson was originally charged with marijuana possession, but the singer worked out a deal with prosecutors in which they agreed to reduce the charge in exchange for a no contest plea. As part of the deal, Nelson has also agreed to pay a $500 fine. And if he can stay out of trouble for 30 days, the judge will dismiss the case entirely. Nelson's lawyer, Joe Turner, tells TMZ, \"Willie is glad to have it all behind him. Everyone was very fair.\"", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2010/06/04/gossip-girl-star-chace-crawford-busted-marijuana-pot-possession.html", "domain": "foxnews.com", "title": "'Gossip Girl' Star Chace Crawford Busted for Marijuana Possession", "authors": ["TMZ"], "publish_date": "06-04-2010", "text": "Chace Crawford from \" Gossip Girl \" was arrested in Plano, Texas for possession of marijuana ... cops confirm to TMZ. We're told Crawford has bonded out of jail. Crawford was arrested just after midnight this morning for possession of marijuana under 2 ounces. The charge is a misdemeanor. Crawford was busted in the parking lot of Ringo's Pub. Sources say Crawford was in a car with a friend when he was busted and cops found one unlit joint.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2011/11/28/miley-cyrus-jokes-about-smoking-too-much-weed-at-1th-birthday-party.html?intcmp=related", "domain": "foxnews.com", "title": "Miley Cyrus Jokes About Smoking 'Too Much Weed' at 19th Birthday Party", "authors": ["New York Post"], "publish_date": "11-28-2011", "text": "Its apparently a high-flying party in the USA whenever Miley Cyrus is around! Cyrus stunned well-wishers at her 19th-birthday party, happily telling them shes a pot-loving stoner. You know youre a stoner when your friends make you a Bob Marley cake, said the Hannah Montana star during her the bash last week at Hollywood s Roosevelt Hotel. You know you smoke way too much f--king weed! she exclaims on footage from the birthday bash obtained and first aired yesterday by the iPad newspaper The Daily. But her rep insisted \"It's all been taken out of context.\" In an interview with Us Weekly, her rep said \"The cake was a joke and Miley's response was intended to be sarcastic.\" Cyrus, who turned 19 Wednesday, caught heat last year when video emerged of her using a bong to inhale what she claimed was salvia, the controversial but legal hallucinogenic herb. The singers pal and party host, Kelly Osbourne , was standing next to the birthday gal when she made her unexpected pot proclamation. Osbourne laughed and chirped: I thought salvia was your problem!", "summary": null}
{"url": "https://www.foxnews.com/entertainment/baby-bash-arrested-for-possession-of-marijuana", "domain": "foxnews.com", "title": "Baby Bash Arrested for Possession of Marijuana", "authors": ["Alexandra J. Gratereaux"], "publish_date": "09-21-2011", "text": "According to reports, Mexican- American rapper Baby Bash was busted in TX for pot possession along with fellow rapper Paul Wall. TMZ reports that the Suga Suga singer (whose real name is Ronald Ray Bryant) was released from El Paso County Jail on Sunday after posting a $300 bond. Wall made it a point on his Twitter account that he and Bryant were held in the same tank they held Willie Nelson / Johnny Cash.", "summary": null}
{"url": "https://www.foxnews.com/entertainment/cnn-revels-in-pot-smoke-during-new-years-eve-report-from-denver", "domain": "foxnews.com", "title": "CNN revels in pot smoke during New Year's Eve report from Denver", "authors": ["Fox News"], "publish_date": "01-01-2018", "text": "CNN put the J in journalism Sunday night, with a marijuana-themed New Years Eve show many viewers found downright doobie-ous. During the beleaguered cable news networks year-end show from Times Square, reporter Randi Kaye did several, um, hits from Denver, where marijuana is legal. At various points, she held a joint, lit a bong, marveled over a special gas mask used by stoners and wondered where she was. This is for you, Andy! Kaye said at one point, addressing CNN host Andy Cohen and holding a lit marijuana cigarette out to the camera. Cohen, the Bravo star and executive producer of the Real Housewives franchise, was hosting with CNN stalwart Anderson Cooper. Kathy Griffin was previously Coopers New Year's Eve partner, but the network dumped her after she made fun of President Trump by holding his mock severed head in a photo shoot. Im trying to remember where we are. Where am I? CNN reporter Randi Kaye Cohen enthusiastically praised Kayes report, while a smiling Cooper reminded viewers that Kayes high-jinx was all above board, even if a bit unseemly. I just want to point out that this is all legal in Colorado, Cooper said, smiling. Kaye, who announced she was witnessing New Years Eve, Denver-style! did not appear to partake herself, and would not be breaking the law if she had. But she did seem disoriented at one point. Were at a dispensary called the Medicine Man! Kaye, who sported dangling marijuana leaf earrings, said. Im trying to remember where we are. Where am I? Kayes pot-themed reportage was done from a puff, pass and paint party, whatever that is. Viewers seemed split on social media: Some were appalled by the open embrace of marijuana, while others were dismayed by the networks decision to replace Griffin with Cohen.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2013/11/11/miley-cyrus-lights-up-marijuana-joint-on-stage-at-amsterdam-awards-show/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+foxnews%2Fentertainment+%28Internal+-+Entertainment+-+Mixed%29", "domain": "foxnews.com", "title": "Miley Cyrus lights up marijuana joint on stage at Amsterdam awards show", "authors": ["Associated Press"], "publish_date": "11-11-2013", "text": "She couldn't resist. Singer Miley Cyrus smoked a joint on stage and twerked with a dwarf during the MTV EMAs on Sunday. The 20-year old pop star also took home the Best Video award for her hit song \"Wrecking Ball\" during a show with a strong lineup of other performers including Eminem and Katy Perry. Cyrus opened the space-themed show singing the song \"We Can't Stop,\" while wearing a silver spandex suit and gyrating her buttocks in the move known as twerking in the general direction of her smaller female dance partner. To the delight of the crowd in Amsterdam's Ziggo Dome, Cyrus finished the number by sticking out her tongue, the same expression she flashed repeatedly during her eyebrow-raising appearance at MTV's Video Music Awards in New York in August. After winning the top award at the end of the show, she celebrated by demonstratively lighting up a large spliff and quickly taking a puff. Marijuana is not legal in the Netherlands, but smokers can't be prosecuted for possessing small amounts and it is sold openly in cafes known euphemistically as \"coffee shops.\" However, that didn't stop MTV from editing the incident out of the telecast that aired in America later Sunday evening. Cyrus, who long ago shed her image of innocence as the child star of \"Hannah Montana,\" has made no secret of her appreciation of Amsterdam's attractions, arriving the Friday before the show and hanging out at the Greenhouse coffee shop downtown with several other stars. She also wore marijuana leaf emblems in her earphones during a live rendition of \"Wrecking Ball\" against the backdrop of a giant video screen of herself crying. The EMAs traditionally focus on global, rather than U.S. pop music acts, though there's a lot of overlap: winners included Bruno Mars, who grabbed Best Song for \"Locked Out of Heaven,\" and Eminem both in the Best Hip Hop and Global Icon category. The \"intergalactic\"-themed show is scheduled to be rebroadcast in the U.S. later Sunday. Another notable winner was Katy Perry for Best Female Artist. Perry, apparently caught by surprise at her win, spit out a sip of champagne and took the stage to thank her fans. During Perry's performance earlier, she hung suspended by wires as green lasers reflected off her mirrored outfit during a rendition of \"Unconditional.\" Eminem, who has just released his first album in several years, appeared to have lost none of his rapping skill as he performed \"Rap God,\" spitting out words at a blistering pace. He was handed his Global Icon honor by \"Anchorman\" character \"Ron Burgundy\" (actor Will Ferrell), who informed him that Dutch DJ Afrojack had been insulting him behind his back. \"Who?\" Eminem deadpanned.", "summary": null}
