{"url": "https://www.huffpost.com/entry/9-ways-to-use-hemp-oil-in_b_10145990", "domain": "huffpost.com", "title": "9 Ways to Use Hemp Oil In Body Care (And Why You'd Want To)", "authors": ["Lisa Bronner"], "publish_date": "05-26-2016", "text": "There are a lot of superlative claims about hemp oil: most unsaturated oil, best essential fatty acids (EFA) ratio and combination, highest amino acid variety, only plant source of vitamin D. Can one oil be all that? In short, yes. Before we go further, let me address that unspoken question, \"Will hemp oil make me high?\" No, it won't. Hemp oil is pressed from the seed of the hemp plant, and this seed does not contain THC, or tetrahydrocannabinol, which is the psychoactive component of marijuana. However, because of this concern, many hemp oil suppliers provide transparent certifications to assure buyers of the lack of THC content in their products. Test Pledge is one such resource, wherein \"producers and processors of hemp oil and hemp nut must commission THC tests on each and every lot of hemp nut and oil, performed by a properly accredited laboratory according to the official Health Canada protocol.\" In their assessment of hemp cosmetics on workplace drug testing, Petra Pless, DEnv, and Gero Leson, D Env, state, \"In case of the highly unlikely full-body application of pure hemp oil with a 10 ppm THC content on partially compromised skin THC uptake could conceivably be raised to 11 g/day. Even this higher rate is only a fraction of the 450 g/day of oral THC intake, found not to result in a positive screening test for marijuana .\" Don't judge hemp because it may have a kooky cousin. That's hardly fair. Who doesn't have an offbeat family member or two? Why Hemp Hemp oil contains unsurpassed essential fatty acids (EFAs). As we are increasingly learning, there are good fats and there are bad fats. What makes a good fat good has much to do with these EFAs, specifically omega-3 and omega-6, which are present in hemp oil in the perfect ratio of 1:3. Plus, hemp oil contains the anti-inflammatory gamma linoleic acid (GLA) as well as omega-9. Its fatty acid profile is better than fish oil's, better than flaxseed oil's--it is the best. Among many benefits, these EFAs provide for more elastic skin and shiny, stronger hair. Hemp oil contains a power-packed punch of additional nutrients , including calcium, potassium, magnesium, copper, vitamin A, vitamin B1 (thiamin), vitamin B3 (niacin), vitamin B5, vitamin B9 (folate), and vitamin D (of which it is the only plant source), along with a useful dose of the antioxidant vitamin E (tocopherols) as well as all 10 amino acids for protein building. Add to that list chlorophyll (that's why it's green), phytosterols, phospholipids, magnesium, sulfur, potassium, phosphorus, and a bit of iron and zinc. Hemp oil is extremely non-comodogenic. In other words, it doesn't clog pores. And because its lipids mirror the lipids that our skin produces naturally, it works in sync with our body to soothe and cleanse. Healthy skin produces linoleic acid. If, for whatever reason, the skin can't produce linoleic acid, it alternatively produces oleic acid, a thick and sticky pore blocker. Hemp oil contains the good linoleic acid. Hemp oil is also a natural humectant, which means it draws moisture into the skin. Instead of sitting on top of the skin the way less-effective oils do, it's able to penetrate the skin, moisturizing between cells and strengthening the cell matrix. It can get to hair roots, as well, strengthening the scalp and reducing dry flaking or dandruff. It evens out skin tone and reduces blotchiness. How to Use It Hemp oil is inexpensive--especially when you think of all the products it replaces: acne treatments, makeup to cover problem areas, moisturizers, and makeup removers, for instance. Here are just a few ways you can use this effective oil in your daily skin and hair care routines. Alleviate dry skin. Rub the oil directly onto dry, cracked skin. For a deep conditioning treatment for hands and feet, massage in the oil then wear socks or gloves overnight to let it work its magic. Strengthen nails and heal cuticles. Massage a small amount of hemp oil directly into nails and cuticles--great for both fingernails and toenails. Remove makeup. Oil follows the \"like dissolves like\" rule, which means that hemp oil will dissolve the oils and waxes in makeup, especially in stubborn eye makeup. Gently rub a small amount of oil into the makeup and wipe with a cotton ball or a soft tissue. Mask overnight . Massage hemp oil into cleansed facial skin before bedtime. Steam facial skin. Massage a tablespoon of oil into the skin on your dry, clean face, massaging for several minutes. Then lay a hot (not scalding) damp washcloth over your face and let it sit until it cools. Wipe with the washcloth. Repeat with another hot washcloth until all the oil is wiped off. Washing your face afterwards is optional. Condition hair. Before shampooing, massage a tablespoon or so of hemp oil into your scalp and let it sit for about 10 minutes. Afterwards, shampoo as normal. You might find you don't need conditioner. Reduce acne. This may sound crazy, but this oil actually reduces acne. Massage hemp oil into problem areas and work it in gently for several minutes. The oil will actually draw out sebum plugs that cause whiteheads, blackheads, and even cysts. Do this daily during breakouts. Relieve eczema . A 2005 study found that 2 tablespoons of dietary hemp seed oil consumed daily may help relieve the effects of atopic dermatitis, or eczema. Support overall health. Eat it. You can eat it straight and enjoy its nutty flavor or you can put it in salad dressings, as a butter replacement on toast, rice, potatoes, vegetables...it's delicious! Keep in mind that pure hemp seed oil cannot be used for high-heat cooking. It has a low smoke point and will totally break down even at a moderate heat, at which point all nutritional benefits are lost. Just remember, pure hemp seed oil goes rancid easily. It needs to be kept in the fridge. However, you can look for it as a shelf-stable ingredient in other personal care products.", "summary": null}
{"url": "https://www.huffpost.com/entry/can-medical-marijuana-help-arthritis_n_873189", "domain": "huffpost.com", "title": "Medical Marijuana For Rheumatoid Arthritis?", "authors": ["Health.com"], "publish_date": "06-08-2011", "text": "Steve is a horticulturist of sorts. He raises orchids, Japanese maples, and other plants at his southern Rhode Island home. Tending the plants helps ease his rheumatoid arthritis (RA) pain, he says. But the garden offers more than Zen; he grows one plant -- marijuana -- specifically to relieve RA pain and discomfort. \"If my pain is at a 10, it will take it down to a 6 or 6.5,\" he says. \"Im an old-man weight lifter. After I smoke I am able to work my shoulders and arms to keep my joints healthy. It gives me the desire and ability to get through a workout.\" Steve has had permission to grow marijuana for medicinal purposes since 2006. He smokes it and cooks it in butter (for baking) and makes THC-containing solutions called tinctures (which can be added to foods and drinks) for himself and five other patients with various medical conditions. His home state is 1 of 16, along with the District of Columbia, where marijuana is permitted for medicinal use. Cannabis may be useful for people with RA and other chronic pain conditions because it can alleviate pain, reduce inflammation, and promote sleep. But unlike other pain-causing conditions, such as osteoarthritis, RA is associated with a higher risk of lung problems and heart attacks. (RA is an autoimmune condition that attacks the joints and causes multiple health problems.) Its not clear if smoking marijuana is a relatively safe pain reliever for people with RA, or if it could increase the risk of RA-associated conditions. And if cannabis is safe, its still debatable whether its safer to take it as a pill or mouth spray rather than smoking it. Smoking marijuana raises the heart rate and one study found that heart-attack risk rises fivefold in the hour after lighting up, according to the National Institute on Drug Abuse. Medical marijuana remains controversial -- and thus under-studied -- in part because it is the most commonly abused illicit drug in the U.S. How marijuana works There are hundreds of chemicals in marijuana, but the best known is delta-9-tetrahydrocannabinol, or THC. THC is what produces the high that comes with smoking or eating products made from marijuana. But THC also binds with receptors in the brain that produce an analgesic affect. It may also reduce anxiety experienced by some people dealing with chronic pain. Marijuana is typically smoked, which produces the most rapid delivery into the bloodstream, says Kathryn Cunningham, Ph.D., director of the Center for Addiction Research at the University of Texas Medical Branch, in Galveston. It can also be taken through vaporization (heated into a mist and inhaled), and in edible products, such as baked goods and tinctures, which take longer to have an effect because they have to be broken down in the stomach, Cunningham says. There are also drugs such as Marinol (dronabinol) and Cesamet (nabilone), which are synthetic versions of THC in pill form that are available by prescription for AIDS patients and cancer patients undergoing chemotherapy, and a newer product called Sativex, a mouth spray with THC and cannabidiol. Sativex is not yet available in the United States, but is used in Canada and Europe for pain relief in people with cancer and multiple sclerosis. Marijuana is illegal on the federal level, but medicinal marijuana is permitted in some states, including Alaska, Arizona, California, Colorado, Delaware, Hawaii, Maine, Michigan, Montana, Nevada, New Jersey, New Mexico, Oregon, Rhode Island, Vermont, and Washington. Each state has its own guidelines including conditions it can be used for and possession limits (which range from 1 ounce to 24 ounces). Marijuana can be purchased through dispensaries, but most states also allow people to grow the product. Research is limited Medicinal marijuana isnt regulated by the Food and Drug Administration, and there arent large-scale studies of its safety and efficacy for chronic pain conditions. (It doesnt help that there are few manufacturers to fund research.) But there have been some small-scale studies looking at its use. A 2006 study in Rheumatology looked at 58 RA patients over a five-week period. They were split into two groups -- one taking Sativex and the other a placebo. The group on Sativex had improvements in \"morning pain on movement\" and sleep quality compared to placebo users. (The study was funded by GW Pharmaceuticals, which makes Sativex.) \"This is a good example of how to answer the question with scientifically sound experiments,\" Cunningham says, adding that larger studies are needed. \"We dont know how the drug affects the disease process, but it does seem to have a positive analgesic effect on RA.\" Doctors at the University of Toronto and Dalhousie University in Halifax reviewed 18 clinical trials that included 766 people between 2003 and 2010. The trials studied the use of cannabis -- either smoked or in THC-based prescription products -- as a medical therapy for non-cancer-related pain, most often neuropathic pain (chronic pain that is usually due to nerve damage). Fifteen of the trials found that it worked better than a placebo for pain relief and four trials found that it improved patients sleep. A majority of the studies found that side effects like sedation, dry mouth, dizziness, and disturbed concentration were mild enough that people did not drop out of the studies. However, the analysis included only one study of RA patients -- the same 2006 Sativex study -- so it could not determine if the long-term use of smoked marijuana was associated with a higher risk of heart or lung complications. Potential health risks Smoking marijuana can increase a persons heart rate for up to three hours, according to the National Institute on Drug Abuse. Marijuana also contains carcinogens (possibly 50 percent to 70 percent more than cigarettes), making smoking potentially harmful to RA patients, who may already suffer from lung problems. The Institute on Drug Abuse, however, reported that no studies have linked marijuana use to lung or upper respiratory cancers. Safety of unregulated products is also always a concern. John Oram, Ph.D., cofounder of CW Analytical, a California-based scientific lab that tests medical marijuana products for safety, quality, and potency, says that more than 90 percent of what is on the market is safe. \"But about 10 percent or less is dangerous, and we dont know how unsafe it is and what problems it may cause,\" he says. Oram adds that labs like CW Analytical empower patients and doctors to make informed decisions about their alternative medicine options. Hazards of these products can include things like bacteria and mold, which would be illegal to sell in regulated food items. Some products may also be prepared in kitchens that arent licensed, may not adhere to refrigeration schedules, or may be made with allergens like peanuts, but not labeled as such. Oram says products should be tested within seven to eight weeks of purchase because that is the shelf life of cannabis. The dispensaries should have records of the date a product was tested for mold, yeast, bacteria, and pesticides, as well as its potency (or amount of THC). Not all doctors prescribe medicinal marijuana, even in states where it is permitted. Ogechi \"Helen\" Mbakwe, M.D., from Central Washington Internal Medicine and Endocrine Center, in Yakima, doesnt. Dr. Mbakwe is uncomfortable with the lack of control and regulation of medicinal marijuana. She says other medications, like methotrexate, treat the autoimmune disease at the root of the problem, and in turn can control pain and inflammation in combination with pain medications like nonsteroidal anti-inflammatory drugs . (Methotrexate and other drugs are known as disease-modifying antirheumatic drugs, or DMARDs, because they can actually slow down or prevent RAs damaging effect on the body.) On the other hand, while marijuana may help with pain symptoms, it does nothing for the disease progression or organ damage, Dr. Mbakwe says. \"If we mask these [symptoms] by giving them marijuana and giving them euphoria, the disease progression will keep getting worse and things like organ damage and severe problems will still occur,\" she notes. Steve, who has RA and lost one of his kidneys in 2004 after being diagnosed with cancer, feels he doesnt have a lot of choices to manage his pain. Many RA medications can be harmful to the kidneys, and that is one reason he says he opts for marijuana to treat his symptoms. Patients with kidney problems can still take DMARDs as long as their dose is adjusted and they are monitored closely, Dr. Mbakwe says. \"DMARDs are not simply pain medications and are not interchangeable with pain medications. So the question of exchanging an RA medication with marijuana should not arise.\" Another problem that Dr. Mbakwe encounters is that, even though she doesnt recommend marijuana to her RA patients, she has many who use it for pain, and she says these patients often have a tendency to abuse narcotics. \"Most patients looking for this have other chronic pain issues and are likely on other controlled substances,\" Dr. Mbakwe says. \"It can be difficult to see who has a tendency toward abuse potential.\" Gregory A. Smith, M.D., medical director of the Los Angelesbased Comprehensive Pain Relief Group, is a pain management and addiction specialist. He says marijuana is not a drug, like methamphetamine, that you take once and are physically dependent upon. \"Marijuana does not have that kind of chemical reaction in the brain,\" he says. \"It is safer than a lot of the prescription narcotics that I detox people from.\" About 28 million people try marijuana each year, and only between 8 percent and 10 percent of users exhibit addictive behavior like drug seeking, Cunningham says. \"What we need to know is if it is addicting in pain patients and is it more so than opiate medications,\" which are commonly used to treat chronic pain, she says. In the meantime, some patients will continue to use marijuana even though large studies havent tested its safety and efficacy. Steve, who has been using marijuana for 30 years (long before it was medically legal), smokes a bowl and a half every day and more at night. He says this helps him sleep and relieves pain, and he hasnt experienced any major side effects over the years, but admits that it can precipitate what he calls \"couch lock.\" \"It makes you lazy,\" he says.", "summary": null}
{"url": "https://www.huffpost.com/entry/cannabis-is-no-ordinary-commodity_b_59aea0e5e4b0bef3378cdb29", "domain": "huffpost.com", "title": "Cannabis Is No Ordinary Commodity", "authors": ["Lloyd I. Sederer"], "publish_date": "09-05-2017", "text": "Pot is different from growing, distributing and selling potatoes, beef, salmon or cars, common commodities with of course complex forces at work. But cannabis takes complexity to a whole new level, comparable to tobacco and alcohol - which have been among the principal killers of Americans. Yet the US is ablaze with cannabis: It is our #1 illicit drug and medical marijuana (MJ) is legalized in 29 states and recreational marijuana legal in 8 states (DC permits both). 63% of Americans live in states with medical or recreational MJ or both. The flame is everywhere and picking up intensity. Over 22 million Americans (12 and older) reported using MJ in the past month . While some die-hards may imagine prohibiting the use of (especially) recreational marijuana and using law enforcement to make that happen that seems an extremely unlikely, not to mention a futile, path for this country. Informed and candid cops know that arrest and incarceration cannot solve problems of drug use and dependence. So we face questions like: Should cannabis be fully decriminalized? Should medical and recreational MJ be legalized in all states? Should production and sales be limited? Should the market be allowed its sway? If you as a state feel the heat and it is not if but when , what design logic would be a useful guide? Will it be individual freedom (for adults), free or regulated markets, or the health of the collective, as shaped by public health goals? Who will benefit therapeutically and financially? Who will suffer? What are the least worst options, given the well-known public health principle that increased access results in greater use? These questions are for your consideration as a citizen (and tax payer), consumer, parent, co-worker, business owner or state or federal official. We need to shine some light on a poorly lit set of data (mostly from when MJ was 1/60th as potent as it is today) and experience (which is not at all uniform or robust from the states having gone ahead) to make decisions now. The cannabis fire will rapidly outpace what science and practice may reveal in the years to come. To examine what we know and what we can do in a clear and sensible way a 3-day, National Cannabis Summit was held in Denver, CO, in late August, convened by three organizations. It was the brainchild of Neal Shifman, CEO of Advocates for Human Potential, a human services research, consulting and training organization. He joined forces with The National Council for Behavioral Health, constituted of 2900 member mental health and addictions treatment organizations, and the Addiction Technology Transfer Center Network, which promotes adoption and implementation of what works for people with Substance Use Disorders. Advocates for Human Potential 2017 National Cannabis Summit The conference smartly assembled a diverse group of government and private stakeholders. In practical ways, it crisply reported and discussed state implementation efforts to date, therapeutic effects and health risks of cannabis, legal and clinical knowledge, and the neuroscience of cannabinoids (the term for the class of diverse chemical compounds that act on our brain and body nerve receptors). Here are my take-away messages. Start small, as a state or county. Build slowly. There is no going back from full recreational legalization, especially when for-profit companies are financing its implementation. Imagine when Anheiser-Busch and RJ Reynolds Tobacco Company start promoting and distributing cannabis. Remember This Buds For You, The Marlboro Man and Joe Camel? Hence, also ban advertising. Separate out the growers from the distributors and those two from the retail sellers. Do not permit what is called vertical integration, where one entity controls the supply chain, which can foster monopoly. Pursue a harm reduction strategy, as Canada is doing nationally under its progressive Prime Minister, Justin Trudeau. Identify and work to prevent or delay use by pregnant mothers or teenagers, where brains are under development. Add other highly vulnerable populations to that strategy, including those with known predispositions to or with family histories of a substance use or mental health disorder. Dont smoke cannabis. Vape or eat it: Smoking is really bad for the lungs. Decriminalize cannabis. Limit access. Make the minimal age 21, set limits of quantities for legal possession and number of home grown plants (which can become a black/grey market cottage industry), set limits on dosages because potency counts (e.g., 10 mg for edibles), require minimum prices so MJ does not become cheap (as it has in Washington State), and contain production quotas and retail outlets. Enforce the laws about Driving Under The Influence (DUI) and underage sales. Dont permit public consumption. Require childproof packaging. Ensure that cannabidiol (CBD) - the second most common cannabinoid in MJ after THC, and without psychoactive properties - is present in MJ products in significant amounts (we still dont know what that is but it is not near zero) because it appears protective against psychosis. Direct state (or federal, if that ever happens) cannabis taxes to fund health insurance, as well as prevention (especially for youth) and public information campaigns. Allocate a percentage of taxes to fund de-identified (i.e., privacy protected) state registries and use them to evaluate the impact of legalization on health and public safety - both for its therapeutic value and its harm to the brain and body (including diseases and traffic accidents). Get the FDA to declare cannabis a Schedule 2 drug, not its current hugely deterring Schedule 1 status, so our country can actually study this drug. Expect over 40% of current MJ users to ingest 20 or more days/month. Recognize that the predominance of regular users appears to stop on their own or not use abusively, without services (unassisted recovery see Dr. John Kelly, ). Ensure that those who need assistance, because cannabis is addictive, can access and continue in treatments known to work. Sustain or increase federal funding to study the effects and therapeutic potential of cannabinoids, including plant-based THC and CBD as well as the brains own cannabinoid system (driven by endocannabinoids). As citizens and policy makers we need to lean in to the dilemma of what to do about cannabis. Silence only lets a vocal minority rule. Like climate change, it is everyones issue, deniers notwithstanding. As a friend of mine recently wrote, A fool can throw a stone into the water that ten wise men cannot recover. (From Jay Neugeboren, March 2017). In other words, there is no single or simple solution to the cannabis Rubic cube. We will have to act now, and sensibly, and let science catch up. To paraphrase what Churchill said of we Americans, we do the right thing after we have exhausted everything else. Whats ahead is surely difficult but it is not impossible.", "summary": null}
{"url": "https://www.huffpost.com/entry/chili-pepper-marijuana-gut_n_58ff5dfee4b0288f5dc8159d", "domain": "huffpost.com", "title": "Study Shows Gut-Calming Effects Of Chili Peppers And Marijuana", "authors": ["Steve Hoffer"], "publish_date": "04-26-2017", "text": "A common link between chili peppers and marijuana could have implications for how we treat diabetes and colitis, as well as other conditions in the digestive tract, according to a new study from the University of Connecticut. The study was published in the April 24 issue of the journal Proceedings of the National Academy of Sciences . Researchers say chemicals found in the peppers and marijuana interact with the same receptor in our stomachs. Scientists first focused on the chemical capsaicin, which is responsible for the hot sensation of eating a chili pepper. They fed capsaicin to mice, and found the mice fed with the spice had less inflammation in their guts. Heres a rundown of what happened next: When they looked carefully at what was happening at a molecular level, the researchers saw that the capsaicin was binding to a receptor called TRPV1, which is found on specialized cells throughout the gastrointestinal tract. When capsaicin binds to it, TRPV1 causes cells to make anandamide. Anandamide is a compound chemically akin to the cannabinoids in marijuana. It was the anandamide that caused the immune system to calm down. Knowing that the brain also has anandamide receptors, researchers began to imagine ways the immune system and the brain might talk to each other through the common language of the anandamide, explained Pramod Srivastava, professor of immunology and medicine at UConn School of Medicine. Researchers found that a greater presence of anandamide led to a greater presence of macrophages, immune cells that curb inflammation. The researchers actually managed to cure mice with Type 1 diabetes by feeding them chili peppers. When they skipped to feeding the mice anandamide directly, they observed a similar gut-calming result. Researchers want to head to Colorado, where pot is legal, so they can further study the effects of ingesting marijuana on anandamide in the body. Im hoping to work with the public health authority in Colorado to see if there has been an effect on the severity of colitis among regular users of edible weed, Srivastava said in a press release. The findings could have implications for various conditions found in the stomach, pancreas, intestines and colon.", "summary": null}
{"url": "https://www.huffpost.com/entry/drinkable-marijuana-legal_n_5760660", "domain": "huffpost.com", "title": "You Can Now Sip On A Marijuana-Infused Drink In Washington", "authors": ["Emily Thomas"], "publish_date": "09-03-2014", "text": "This isnt your average herb-infused drink. Nearly two months after recreational marijuana sales started in Washington , drinkable forms of the drug have hit store shelves. Produced by Washington-based company Mirth Provisions, an aptly titled beverage line called Legal is currently available at eight of the states 22 recreational marijuana stores , according to Fortune. The drinks come in five different flavors, including sparkling pomegranate and cold brew with milk and sugar. Though all Legal beverages are infused with 22 milligrams of THC -- \"enough to know that you're high, but not so much as to overwhelm,\" Mirth Provisions founder Adam Stites told XXX -- each flavor touts a slightly different high. The high produced by the cold brew with milk and sugar , for example, is described on the companys website as an uplifting, euphoric head high and a gentle body buzz. Were particularly fond of the description for the sparkling lemon ginger flavor: Couch, meet butt. This delicious fusion of tangy lemon and spicy ginger is so ridiculously relaxing that you may find yourself becoming one with your furniture. Whether youre melting into a beach blanket or parked on the sofa, prepare for many glorious hours of doing absolutely nothing. Stites says \"drinkables\" dont carry as much of a taboo as other forms of marijuana. \" Its much more approachable , as opposed to Hey, mom and dad, do you want a joint?' Stites told Portland, Oregon, news outlet KGW-TV. Mirth Provisions had previously announced that the beverages would hit store shelves in July , but the company faced some minor setbacks that pushed back the product's release date. Stites says his company has learned a lot from observing Colorado's struggle with implementing recreational marijuana sales. \"Washington is learning from some of the challenges Colorado has seen, we're slower, more deliberate, more regulated (we had to get city approvals, Liquor Control Board approvals, and approvals from the Washington State Department of Agriculture), and in the end, I believe we'll have a strong sustainable legalized marijuana system,\" he told XXX. He says green beverages are an amazing, untapped new market, and he's happy to be able to \"create a product that allows others to enjoy their new freedoms.\" It's an opportunity to make an amazing, unique, unusual, and delicious product while also making history, Stites said. I think my grand-kids will be amazed to know that people used to go to jail for having a plant.", "summary": null}
{"url": "https://www.huffpost.com/entry/hemp-seeds-thc_n_59b154a0e4b0b5e53104312e?section=us_taste", "domain": "huffpost.com", "title": "Here's Why Edible Hemp Will Never Get You High", "authors": ["Julie R. Thomson"], "publish_date": "09-11-2017", "text": "Hemp seeds have long been a staple in health-food stores, being prized for decades for their nutritional benefits theyre a good source of omega-3 fatty acids, a complete protein source, and a rich source of essential minerals, including magnesium, phosphorus, iron and zinc. In the past few years, hemp seeds have gained popularity and have started moving into mainstream markets. These days, you can even find them at Trader Joes. People sprinkle them on their salads, blend them into their smoothies, bake them into granolas and even turn them into hemp milk. But theres something many people just cant get over: hemps link to marijuana . As we sprinkle the seeds on top of our salads, we cant help but wonder: whats the deal with hemp seeds and THC? What are hemp seeds, actually? Hemp seeds are cultivated from the hemp plant, which is grown predominantly for its seeds and fibers. Heres where the confusion comes from: The hemp plant looks a bit like the marijuana plant and it actually come from the same plant species , Cannabis Sativa L, but there are major differences between the two. For one, the marijuana plant is stalkier, while the hemp plant is taller and thinner. But more importantly, the hemp plant contains low levels ( less than 0.3 percent ) of tetrahydrocannabinol (THC), the psychoactive component of Cannabis Sativa. Marijuana can contain anywhere from 5 to 30 percent. The seeds of the hemp plant are housed in small, brown hulls that are removed before we get our hands on them. The white seeds we buy at the store are the inner seeds, sometimes called the heart, and theyre soft enough to eat and cook. Will hemp seeds get you high? The short answer is no . As mentioned above, hemp seeds are not cultivated from the marijuana plant, but from the hemp plant, which contains minute amounts of THC. According to Jolene Formene, staff attorney at Drug Policy Alliance , Hemp seeds are non-psychoactive, meaning that consumers cannot get high by eating them. In other words, its impossible to get high from them. They also wont cause you to fail a drug test. We know that other foods like poppy seeds, which contain trace amounts of opiates , can make you fail a drug test. Certain places actually ask that you dont eat poppy seed bagels or muffins before testing. But hemp seeds wont cause the same confusion. A study found that eating hemp seeds had little effect on a persons THC levels and never enough to exceed the levels looked for in federal drug testing programs. So, now that you know you can pass a drug test and eat hemp seeds, here are a few recipes you should try.", "summary": null}
{"url": "https://www.huffpost.com/entry/420-hemp-wear_n_1440042", "domain": "huffpost.com", "title": "420 Day: Hemp Wear Pieces You Should Be Wearing Today (PHOTOS)", "authors": ["Sara Gates"], "publish_date": "04-20-2012", "text": "April 20 is upon us again, and the 420 day fashions have not changed. We're talking about the hemp wear pieces, which we know you have stashed somewhere in the back of your closet. If you haven't made -- or bought -- hemp jewelry on spring break, then you haven't truly lived. Aside from hemp accessories you wore in your teen years, hemp wear has gone mainstream in the realm of sustainable clothing. Eco-friendly lines, including Heather Heron , FEED , Edun and mainstay Stella McCartney , fashion almost any style of outfit or accessory to suit your boho, green-loving needs. But let's be honest: most still associate hemp and its fashion offspring with stoner culture. So in looking back at this 420 \"holiday\", we present you with ten hemp wear pieces from yesteryear.", "summary": null}
{"url": "https://www.huffpost.com/entry/asian-american-sundae-school-cannabis-lifestyle-brand_n_5ada1b98e4b029ebe023d891", "domain": "huffpost.com", "title": "Dope Cannabis Lifestyle Brand Is Unapologetically Asian-American", "authors": ["Kimberly Yam"], "publish_date": "04-20-2018", "text": "Sundae School, a cannabis lifestyle brand catering to Asian-Americans, produces its own smoking apparel and accessories inspired by the streets of Seoul, South Korea. The company places a heavy emphasis on fashion, but co-founder Dae Lim says theres a greater mission behind the brand which is fittingly celebrating its first anniversary on Friday, 4/20, with a pop-up shop in Brooklyn . In a cannabis industry heavily dominated by white businesses , Lim says he hopes to promote more Asian-American visibility. He told XXX its particularly important to him because Asian-Americans are so often erased from cannabis culture and mainstream media as a whole. If you look at the stoner experiences that are commonly depicted, its really singular typically a white guy out in Colorado or California surfing and smoking weed, said Lim, who started the business with his sister Cindy. But theres so many more layers to that. ...There are a lot of Asian-Americans and Asians in general adopting that lifestyle. Model minority myth-smashing messages and clever designs are baked into the clothing, with phrases like GPA 4.20 and Honor Roller printed on shirts and hoodies. Other pieces pull in some unapologetically traditional Asian elements. One collection is titled When Tigers Used To Smoke, a Korean phrase equivalent to the Western Once upon a time. Several pieces feature a tiger, a common motif in traditional Korean art. Another suit is a remix on the traditional Korean hanbok, featuring pockets designed to stash spliffs. People aren't arresting us for no reason in the streets, but that doesn't mean our issues aren't real ... yellow invisibility is real in America.\" - Sundae School co-founder Dae Lim. Influenced by the growing counterculture both among young Koreans and Asian-Americans, Lim says that the designs attempt to reflect that unabashed self-expression among young, yellow youths. Lim told XXX that he aims to combat the erasure of Asian narratives through his companys practices, too. Sundae School is primarily Asian, he said, and when collaborating on design, it aims to elevate Asian work. Even the models cast in the companys fashion collections showcase diverse Asian backgrounds, with Nigerian-Korean model Han Hyun-Min featured in the Tigers collection . Supporting people from the Asian community is important for Lim, especially since the products are made for an Asian-American crowd. Because of the model minority myth, Asian-Americans arent necessarily dealing with being profiled on a plane, or people arent arresting us for no reason in the streets, but that doesnt mean our issues arent real, Lim said. Because muted yellow voices and yellow invisibility is real in America. Asian-American cannabis culture has been bubbling up for some time. However, the herb is still frowned upon by many in the Asian community, in part as a painful consequence of the Opium Wars, Splinter News pointed out , which left a lasting impression across Asia. So starting the business was no easy task for Lim. Lim noted that his parents first discovered his cannabis use years ago when he came to the U.S. for high school. He says his mother discovered his stash while cleaning his room and she broke down crying. Marijuana in Korean is literally Devils plant or Devils Lettuce, he said. So she said, What have we raised you as? Ive given up my career to educate you and take you to America and this is what you do to me? Later on, after he quit his job at consulting company McKinsey & Company to open a business, Lim said his mother was ecstatic. But she didnt find out about the cannabis angle to his work until she read a magazine article about Sundae School. Thats when all hell broke loose, he said. But at the end of the year, when she saw our business and how meaningful it was for us, she was more accepting. Lim says he understands the hesitation, since many Asian immigrants have strived to make it in America, keep their heads down and avoid trouble. They didnt have the privilege of learning about or enjoying the herb, he said. But now, Lim feels theres hope in reversing the stigma toward marijuana in the Asian-American community. It comes down to more education and awareness regarding the herb, and a little persistence.", "summary": null}
{"url": "https://www.huffpost.com/entry/cannabis-skincare-products_n_5ad89740e4b0e4d0715de13d", "domain": "huffpost.com", "title": "Is Cannabis The Skincare Industry's Next 'It' Ingredient?", "authors": ["Julia Brucculieri"], "publish_date": "04-20-2018", "text": "Cannabis is having a skincare moment. Beauty and wellness products containing cannabidiol (CBD), and possibly tetrahydrocannabinol (THC), are becoming increasingly popular . CBD, along with THC, are the two most common cannabinoids found in cannabis (a.k.a. marijuana), but they have different effects. CBD is touted as having therapeutic and stress-relieving benefits , while THC is responsible for the high associated with marijuana use. Additionally, CBD is legal in many states , while THC is not. You can find cannabis products for a relaxing bath, for soothing sore muscles and for healing chapped lips. Theyve even a found fan in Olivia Wilde, who raved about a topical CBD lotion by Lord Jones in a 2017 New York Times profile . And celebrity stylist Karla Welch has said she tells her clients (like Wilde, Katy Perry and Sarah Paulson) to use it on their feet for red carpet events. Dr. Samer Jaber of Washington Square Dermatology told XXX that while the enthusiasm for cannabinoids in skincare is definitely growing, the science behind cannabis and cannabinoids for skin health is still sparse. A lot of the research focuses on the cannabinoids usefulness in relieving itchiness associated with dry skin and eczema . Cannabinoids also have some anti-inflammatory effects, as well as potential anti-tumor effects , Jaber said, though he added that much more research remains to be done. Unfortunately, most of the studies on the cannabinoids have been done in the laboratory only and there are very few studies on people, Jaber said. So additional well-controlled, clinical studies need to be done to see how effective these ingredients actually are in real life. Another issue with cannabinoids in skincare products is that its difficult to know exactly what youre getting, Jaber said. Since it is not regulated its difficult to know what you are actually putting on your body, he said. Dr. Angela Lamb , director of the Westside Mount Sinai Dermatology Faculty Practice in New York, echoed Jaber, telling XXX, We just do not have any strong research to support beneficial effects on the skin. My aim is to be research-focused in health care. Anyone can make claims, but I want to see what studies have shown, and as it relates to cannabis, there is just not a lot of support yet. It may come in several years, but until then, I think a lot of it is hype, she added. I do not think it is harmful, I am just not sure it helps. As a result of the varying state laws regarding marijuana, much of these products are mainly available in states where marijuana is legal (like California and Colorado) and they often arent available online.", "summary": null}
{"url": "https://www.huffpost.com/entry/doctors-medical-marijuana_n_5064782?ir=Politics&ncid=fcbklnkushpmg00000013", "domain": "huffpost.com", "title": "More Than Half Of Doctors Support National Legalization Of Marijuana, Survey Shows", "authors": [], "publish_date": "04-02-2014", "text": "More than half of doctors think that medical marijuana should be legalized nationally, and two out of three doctors say patients should be given the medical option to use medical marijuana, according to a new survey. The survey was conducted by Medscape between Feb. 25 and March 3, and is based on answers from 1,544 physicians from 12 different specialty areas. Doctors in certain specialties seemed to better acknowledge the benefits of medical marijuana than others. Eighty-two percent of oncologists and hematologists, for instance, said patients can experience real benefits from medical marijuana; the same percentage of doctors in these two specialities also said they think patients should have medical marijuana as an option. In states where medical marijuana is not legal, about half of doctors surveyed said it should be made legal; the results were about the same in states still considering legalizing medical marijuana. However, more than half of doctors -- 53 percent -- did not support the legalization of recreational marijuana use. In a companion consumer survey conducted by WebMD , taken by 2,960 random visitors to the WebMD website between Feb. 23 and Feb. 26, the percentages in support of the legalization of medical marijuana were similar. Half supported its nationwide legalization, and for people living in states where it's not legalized, half said it should be made legal. Fifty-one percent of people from the WebMD survey said they do not support the legalization of recreational marijuana use. Just last year, results of a poll published in the New England Journal of Medicine showed that three out of four doctors would prescribe medical marijuana to a patient experiencing painful symptoms from advanced breast cancer.", "summary": null}
{"url": "https://www.huffpost.com/entry/it-is-okay-to-expect-the-unexpected-with-medical-marijuana_b_58839b71e4b08f5134b62125", "domain": "huffpost.com", "title": "It Is Okay To Expect The Unexpected With Medical Marijuana", "authors": ["Danielle Demick"], "publish_date": "01-21-2017", "text": "Medical marijuana usage is a hot topic today, but many of the politics behind regulation center around biased statistics. With various studies and exaggerated opinions, it is hard to determine what is true and what is utter bologna. I might not hold all the answers and have always been indifferent on the topic, but I do have some insight when it comes to positive experiences. One of my cousins had just graduated from an academy and, aside from myself and my weakening grandpa, all my family went out of state for the ceremony. My grandma asked if I could check on my grandpa while she was away. Reluctantly, I agreed to check on my grandpa to ease her worry. My grandpa, though I loved him, became a difficult person to be around. His old age and constant pain turned him into a grump, and he felt the need to tell others about his never-ending pain. It was not exactly a visit I was looking forward too. His agitated state became overbearing. People slowly distanced themselves from him, annoyed with his constant negativity. I, like most of my family members, took part in the distancing. Pretending everything was fine was easier, and remembering him as an active gardener was better than looking at the shell of himself he had become. But something had changed and I suddenly found myself face to face with a familiar stranger. Armed with a few subs for lunch and my two dogs, I slipped into the house and found my grandpa watching reruns of Walker Texas Ranger. Happy I was there, he struggled out of his brown recliner to hug me. When he noticed my puppies wagging their excited little poodle tails, he smiled. It had been a long time since that smile made an appearance, and the gesture warmed my heart. We made our way to the dining room table so I could put on his pain patch and we could eat. With only the sound of chewing breaking the silence, I began feeling awkward and desperate for a safe conversation topic. Searching my surroundings as if they held all the answers, I began looking for a flare of inspiration. My eyes landed on a tiny glass vial that contained only about a thimble worth of a crushed plant. I suddenly remembered my grandma telling me he had recently been prescribed medical marijuana. Taking the vial as a conversation saver and blessing in disguise, I asked him if the medical marijuana had been helping at all. Not surprisingly, he told me no, but a smirk curled his lips as he added, it gives me one hell of a high, though! He looked up at me with a glimmer in his eyes that had been missing for several years. The hollows of his face were less prominent, his eyes considerably less sunken, and an un-pained smile spread across his aged face. Believing the lively man sitting across from me was my grandpa was hard, but denying the positive effects of him smiling was impossible. The conversation sparked, and my grandpa proceeded to share with me the how-tos behind smoking. I continued to ask questions about the treatment, despite knowing very little about marijuana. This allowed my now enthused grandpa to keep the conversation going. Wrapped up in the moment, he asked if I wanted to try it with him. He continued by offering to show me how to smoke it from his pipe. Maybe he didnt realize what he was proposing, or he was just proud that he knew something I didnt. The reason didnt matter because it was the most excited I had seen him in years. I kindly declined his offer but let him describe each step in depth. I was a rookie that had never smoked, and I found it far too ironic that it was my grandpa of all people to offer me my first puff of marijuana. I knew he wanted me to try it with him, he probably thought it would be a bonding moment between us, but I preferred to remember corn picking and tractor riding as our thing. While he was telling me about his pipe, and the struggle of learning to use it through this foreign thing called YouTube, I reflected on how much he had changed. Though he still was in some pain, he was easier to be around. He discovered a piece of himself that was almost lost. We ended up enjoying our meal, and I was happy I listened to my grandma. Watching him feed the dogs lunchmeat made me smile at the magic I had witnessed. His new found zest for life could have come from the puppy-love therapy I offered, but I believed most of his recovery was related to the plant carcass he had been smoking. It wasnt a drug meant to get him high, and according to him it didnt help much in the pain department, but it unexpectedly gave my grandpa some of his lost spark. He had some life in him again, and I suspected it was a result from the munchies. His appetite returned, and he began moving around more with his returned strength. If I hadnt witnessed the magic first hand, I never would have believed the miracle that came from the marijuana.", "summary": null}
{"url": "https://www.huffpost.com/entry/marijuana-addiction-lady-gaga_n_5b9da79de4b03a1dcc8ae55d", "domain": "huffpost.com", "title": "Lady Gaga Says She's Addicted To Marijuana: Is It Possible?", "authors": [], "publish_date": "11-11-2013", "text": "Lady Gaga has revealed details of her marijuana addiction , explaining that at one point, she was smoking 15 to 20 marijuana cigarettes a day, according to news reports. \"I have been addicted to it and it's ultimately related to anxiety coping and it's a form of self-medication,\" Gaga said on the Z100 Morning Show, as reported by People magazine. Gaga broke her hip earlier this year, causing her to cancel part of her Born This Way tour . \"I was living on a totally other psychedelic plane, numbing myself completely, and looking back I do see now that some of it had to do with my hip pain ,\" she told Z100, as reported by People. \"I didn't know where the pain was coming from so I was just in a lot of pain and very depressed all the time and not really sure why.\" While research has shown that the percentage of people who try marijuana and become addicted to it is small, it is possible to get hooked on the drug. According to the National Institute on Drug Abuse, about 9 percent of marijuana users become dependent on the drug , with that percentage going up for people who begin using the drug in adolescence. Comparatively, Scientific American pointed out that in a 1994 study showing that 9 percent of people who've tried marijuana become dependent on it , the numbers are higher for other substances: alcohol is 15 percent, heroin is 23 percent and nicotine is 32 percent. Marijuana withdrawal (officially called cannabis withdrawal in the recently released fifth edition of the Diagnostic and Statistical Manual of Mental Disorders) is also sometimes seen in people who stop using marijuana , and is characterized by anxiety, problems sleeping, irritability and aggression, the NIDA reported. And while it's impossible to die from a marijuana overdose like you would from other illicit, dangerous drugs, dependence on marijuana can cause disruptions to people's lives, TIME reported. However, TIME pointed out that addiction to marijuana does not look exactly the same as addiction to other illicit drugs , such as heroin. TIME explains: In this view, the paradigm for addiction is heroin: the shaking, puking heroin junkie who cant quit because the withdrawal sickness is impossible to bear. Because marijuana cessation is not linked with such severe symptoms, the drug isnt seen as physically addictive. And considering that most people view physical addiction as uncontrollable, but psychological addiction as manageable with proper willpower, marijuana tends not to be regarded as addictive in general.", "summary": null}
