{"url": "http://www.breitbart.com/big-government/2012/11/03/democrat-co-gov-opposes-marijuana-legalization/", "domain": "breitbart.com", "title": "Will Gary Johnson, Marijuana Tip Scales of Colorado Race?", "authors": ["Tony Lee"], "publish_date": "11-03-2012", "text": "Colorado Gov. John Hickenlooper, a Democrat, is opposing Amendment 64, an issue on Colorados November ballot that would legalize, regulate, and tax the sale of marijuana. Hickenlooper said the Amendment would send the wrong message to children that using drugs is OK. Colorado is known for many things marijuana should not be one of them, Hickenlooper explained. Amendment 64 has the potential to increase the number of children using drugs and would detract from efforts to make Colorado the healthiest state in the nation. It sends the wrong message to kids that drugs are OK. The Obama campaign is worried members of his liberal base who support legalization will vote for Libertarian candidate Gary Johnson (pictured), who supports legalization, while the Romney campaign is worried that libertarian-leaning voters who support the Amendment will also vote for Johnson. In a close race, the side who can best keep its voters from casting votes for Johnson will have the upper hand on Election Day. Hickenlooper and former Republican Gov. Bill Owens are opposed to the initiative while some conservatives like Tom Tancredo have come out for the Amendment. Tancredo, according to the Washington Times , has said at rallies that voting against the Amendment would be siding not just with the nanny-staters, but with the cartels. Groups in favor of Amendment 64 have stressed the economic benefits of marijuana legalization, saying the tax revenue after 2017 could top $100 million and support public services such as education. They have argued Mexican drug cartels currently get the money that could instead funnel into Colorados economy. The Denver Post editorialized that while Amendment 64 would limit marijuana sales to one ounce, it would be next to impossible to prevent out-of-state visitors from buying several ounces at various outlets and returning home, which could make Colorado a national magnet for marijuana users, growers and distributors. The Post has run a series of articles about how the pro-marijuana initiative could open a Pandoras Box of ills if it passess and make Colorado the destination for pot-dealers and smokers. A Public Policy Polling poll found 53% of Colorado voters support the initiative, while 43% were opposed. A Survey USA poll found 48% were in favor while 43% were not.", "summary": null}
{"url": "http://www.breitbart.com/big-government/2012/11/07/gay-marriage--marijuana-backed-in-historic-votes/", "domain": "breitbart.com", "title": "Gay Marriage, Marijuana Backed in Historic Votes", "authors": ["David Crary"], "publish_date": "11-07-2012", "text": "Altering the course of U.S social policy, Maine and Maryland became the first states to approve same-sex marriage by popular vote, while Washington state and Colorado set up a showdown with federal authorities by legalizing recreational use of marijuana. The outcomes for those ballot measures Tuesday were a milestone for persistent but often thwarted advocacy groups and activists who for decades have pressed the causes of gay rights and drug decriminalization. Colorado Gov. John Hickenlooper, a Democrat who opposed legalization, was less enthused. Federal law still says marijuana is an illegal drug, so dont break out the Cheetos or gold fish too quickly, he said. The results in Maine and Maryland broke a 32-state streak, dating to 1998, in which gay marriage had been rebuffed by every state that voted on it. They will become the seventh and eighth states to allow same-sex couples to marry. In another gay-rights victory, Minnesota voters defeated a proposed constitutional amendment that would banned same-sex marriage in the state. Similar measures were approved in 30 other states, most recently in North Carolina in May. Washington state also voted on a measure to legalize same-sex marriage, though results were not expected until Wednesday at the soonest. The outcomes of the marriage votes could influence the U.S. Supreme Court, which will soon consider whether to take up cases challenging the law that denies federal recognition to same-sex marriages. The gay-rights victories come on the heels of numerous national polls that, for the first time, show a majority of Americans supporting same-sex marriage. Maines referendum marked the first time that gay-rights supporters put same-sex marriage to a popular vote. They collected enough signatures to schedule the vote, hoping to reverse a 2009 referendum that quashed a gay-marriage law enacted by the Legislature. In Maryland and Washington, gay-marriage laws were approved by lawmakers and signed by the governors this year, but opponents gathered enough signatures to challenge the laws. Maryland Gov. Martin OMalley, who campaigned vigorously for the marriage measure, spoke to a jubilant crowd in Baltimore. Christopher Wold, 31, danced with his partner of four years after the result became clear. He said they would like to marry now that its legal in Maryland. The president of the most active advocacy group opposing same-sex marriage, Brian Brown of the National Organization for Marriage, insisted Tuesdays results did not mark a watershed moment. Heading into the election, gay marriage was legal in six states and the District of Columbia in each case the result of legislation or court orders, not by a vote of the people. The marijuana measures in Colorado and Washington will likely pose a headache for the U.S. Justice Department and the Drug Enforcement Administration, which consider pot an illegal drug. The DOJ has declined to say how it would respond if the measures were approved. Colorados Amendment 64 will allow adults over 21 to possess up to an ounce of marijuana, though using the drug publicly would be banned. The amendment would allow people to grow up to six marijuana plants in a private, secure area. Washingtons measure establishes a system of state-licensed marijuana growers, processors and stores, where adults can buy up to an ounce. It also establishes a standard blood test limit for driving under the influence. The Washington measure was notable for its sponsors and supporters, who ranged from public health experts and wealthy high-tech executives to two former top Justice Departments officials in Seattle, U.S. Attorneys John McKay and Kate Pflaumer. Estimates show pot taxes could bring in hundreds of millions of dollars a year, but the sales wont start until state officials make rules to govern the legal weed industry. The Washington measure was opposed by Derek Franklin, president of the Washington Association for Substance Abuse and Violence Prevention. In Oregon, a marijuana-legalization measure was defeated. In Massachusetts, voters approved a measure to allow marijuana use for medical reasons, joining 17 other states. Arkansas voters rejected a similar measure. In all, 176 measures were on the ballots Tuesday in 38 states, according to the Initiative and Referendum Institute at the University of Southern California. Other notable results: Maryland voters approved a measure allowing illegal immigrants to pay in-state college tuition, provided they attended a state high school for three years and can show they filed state income tax returns during that time. About a dozen other states have similar laws, but Marylands is the first to be approved by voters. In Oklahoma, voters approved a Republican-backed measure that wipes out all affirmative action programs in state government hiring, education and contracting practices. Similar steps have been taken previously in Arizona, California, Michigan, Nebraska and Washington. In Michigan, labor unions suffered a big loss. Voters rejected a first-of-its-kind ballot initiative that would have put collective bargaining rights in the state constitution.", "summary": null}
{"url": "http://www.breitbart.com/big-government/2012/11/30/poll-americans-marijuana-legalization/", "domain": "breitbart.com", "title": "Poll: Americans Increasingly Support Pot Legalization", "authors": ["Breitbart News"], "publish_date": "11-30-2012", "text": "A new CBS poll shows that Americans are nearly convinced about the propriety of marijuana use. According to the poll, 47% of Americans believe that marijuana should be legalized; 51% believe that it shouldnt be legalized. Last month, both Colorado and Washington legalized marijuana use for adults. A slight majority of both Democrats and independents support marijuana use; over 66% of Republicans think it shouldnt be. The younger you are, the more you like marijuana. According to the poll, 54% of Americans aged 18-29 support legalization, with just 41% opposed. A huge majority of Americans support medical marijuana use. According to Rasmussen polls, Americans are significantly in favor marijuana legalization with government regulatory oversight; 56% of American support such measures. America is shifting more libertarian on marijuana, without question. Senator Rand Paul (R-KY) has been one of the Republican Partys most ardent advocates on the issue of marijuana legalization; thanks to that position and his fathers support base, he will be a formidable candidate in 2016.", "summary": null}
{"url": "http://www.breitbart.com/big-government/2012/11/07/colorado-is-first-state-to-legalize-recreational-pot/", "domain": "breitbart.com", "title": "Colorado Becomes First State to Legalize Recreational Pot", "authors": ["Breitbart News"], "publish_date": "11-07-2012", "text": "Colorado on Tuesday became the first state to legalize the possession and sale of marijuana for recreational use, in defiance of federal law. A similar measure in Washington state also appeared headed for voter approval. A third measure to remove criminal penalties for personal possession and cultivation of recreational cannabis was defeated in Oregon, where significantly less money and campaign organization was devoted to the cause. Supporters of a Colorado constitutional amendment legalizing marijuana declared victory and opponents conceded defeat after returns showed the measure garnering nearly 53 percent of the vote versus 47 percent against.", "summary": null}
{"url": "http://www.breitbart.com/big-government/2012/11/27/california-college-launches-pot-institute/", "domain": "breitbart.com", "title": "California College Launches Pot Institute", "authors": ["William Bigelow"], "publish_date": "11-27-2012", "text": "Humboldt State University, the Harvard of Humboldt County, in marijuana-championing far north California, once rated #8 on a list of top counterculture (read: pot smoking) colleges in the United states, has formed an entire institute devoted to marijuana. Yes, parents, you dont have to worry about your children smoking pot on campus and getting caught. Now they can use their stoner moments for academic achievement! The Humboldt Institute for Interdisciplinary Marijuana Research at Humboldt State University will sponsor scholarly lectures and coordinate research with various faculty members from the departments of economics, geography, politics, psychology and sociology. One professor is studying recent campaigns to legalize marijuana; another is actually researching how pot affects the environment. Studying pot through the lenses of different disciplines can be exciting, according to Josh Meisel, who is leading the enterprise with economist Erick Eschker. He noted that, after Californian considered a failed ballot proposition in 2010 that would have treated marijuana like alcohol, With these public discussions, there were a lot more questions than there were answers. Question: With marijuana and getting high now a subject for an entire academic institute, will any of the buildings need elevators? Answer: No. Question: Will California taxpayers stand for their money being used for subsidizing this nonsense? Answer: Yes. Question: How much dumber can Californians be? Answer: Is there a limit?", "summary": null}
{"url": "http://www.breitbart.com/big-government/2012/12/06/smokers-celebrate-as-wash-legalizes-marijuana/", "domain": "breitbart.com", "title": "Smokers celebrate as Wash. legalizes marijuana", "authors": ["Gene Johnson"], "publish_date": "12-06-2012", "text": "The crowds of happy people lighting joints under Seattles Space Needle early Thursday morning with nary a police officer in sight bespoke the new reality: Marijuana is legal under Washington state law. Hundreds gathered at Seattle Center for a New Years Eve-style countdown to 12 a.m., when the legalization measure passed by voters last month took effect. When the clock struck, they cheered and sparked up in unison. A few dozen people gathered on a sidewalk outside the north Seattle headquarters of the annual Hempfest celebration and did the same, offering joints to reporters and blowing smoke into television news cameras. Washington and Colorado became the first states to vote to decriminalize and regulate the possession of an ounce or less of marijuana by adults over 21. Both measures call for setting up state licensing schemes for pot growers, processors and retail stores. Colorados law is set to take effect by Jan. 5. Technically, Washingtons new marijuana law still forbids smoking pot in public, which remains punishable by a fine, like drinking in public. But pot fans wanted a party, and Seattle police werent about to write them any tickets. In another sweeping change for Washington, Gov. Chris Gregoire on Wednesday signed into law a measure that legalizes same-sex marriage. The state joins several others that allow gay and lesbian couples to wed. The mood was festive in Seattle as dozens of gay and lesbian couples got in line to pick up marriage licenses at the King County auditors office early Thursday. King County and Thurston County announced they would open their auditors offices shortly after midnight Wednesday to accommodate those who wanted to be among the first to get their licenses. Kelly Middleton and her partner Amanda Dollente got in line at 4 p.m. Wednesday. Hours later, as the line grew, volunteers distributed roses and a group of men and women serenaded the waiting line to the tune of Going to the Chapel. Because the state has a three-day waiting period, the earliest that weddings can take place is Sunday. In dealing with marijuana, the Seattle Police Department told its 1,300 officers on Wednesday, just before legalization took hold, that until further notice they shall not issue citations for public marijuana use. Officers will be advising people not to smoke in public, police spokesman Jonah Spangenthal-Lee wrote on the SPD Blotter. The police department believes that, under state law, you may responsibly get baked, order some pizzas and enjoy a `Lord of the Rings marathon in the privacy of your own home, if you want to. He offered a catchy new directive referring to the film The Big Lebowski, popular with many marijuana fans: The Dude abides, and says `take it inside!' Washingtons new law decriminalizes possession of up to an ounce for those over 21, but for now selling marijuana remains illegal. I-502 gives the state a year to come up with a system of state-licensed growers, processors and retail stores, with the marijuana taxed 25 percent at each stage. Analysts have estimated that a legal pot market could bring Washington hundreds of millions of dollars a year in new tax revenue for schools, health care and basic government functions. But marijuana remains illegal under federal law. That means federal agents can still arrest people for it, and its banned from federal properties, including military bases and national parks. The Justice Department has not said whether it will sue to try to block the regulatory schemes in Washington and Colorado from taking effect. The legal question is whether the establishment of a regulated marijuana market would frustrate the purpose of the federal pot prohibition, and many constitutional law scholars say it very likely would. That leaves the political question of whether the administration wants to try to block the regulatory system, even though it would remain legal to possess up to an ounce of marijuana. Alison Holcomb is the drug policy director of the American Civil Liberties Union of Washington and served as the campaign manager for New Approach Washington, which led the legalization drive. She said the voters clearly showed theyre done with marijuana prohibition.", "summary": null}
{"url": "http://www.breitbart.com/big-hollywood/2012/07/05/oliver-stone-weed-worse-slavery/", "domain": "breitbart.com", "title": "Oliver Stone: Illegal Weed Laws 'Worse than Slavery'", "authors": ["Christian Toto"], "publish_date": "06-05-2012", "text": "Director Oliver Stone is on a press tour, and that means hes spending some time inserting his foot into his mouth. Stone, whose new film Savages opens Friday, is currently extolling the wonders of weed for willing press outlets. The topic keeps coming up because Savages deals with a fictional drug war saga starring Benicio del Toro, Salma Hayek, Taylor Kitsch and Aaron Johnson. But Stone also has a serious message to share. Illegal marijuana laws have a detrimental effect on society. Just how detrimental? Take it away, Oliver. Still, the film offers a fictional portrait of violence among a Mexican drug cartel and California pot growers that makes legalizing marijuana seem like a sane option. That would be my personal solution, but as a politician, I would fight for decriminalization first, because that is the immediate by-product of this mess that we got ourselves into. Its very hard to pull out of a $40 billion-a-year industry, which is the prison industry. Its probably more than $40 billion. But they will fight you tooth and nail to keep these prisons as big as they are, Stone said. Its worse than slavery, per capita. In the black community, it is a form of slavery, this drug war, because it imprisons a huge portion of people, destroys their lives, coarsens our culture. And why? Marijuana is much less harmful than tobacco and prescription drugs in many cases and certainly alcohol. This puritanical strain got started with Nixon. It was a political issue for him, and its gotten worse. Its like the Pentagon. You cant stop it. But to those who say Stone is a consistently anti-American voice, think again. Stone thinks U.S.-based pot growers are the best in the world. Theres good weed everywhere in the world, but my God, these Americans are brilliant, said Stone, 65, who sees only benefits from legalizing marijuana.", "summary": null}
{"url": "http://www.breitbart.com/big-hollywood/2012/10/19/montel-williams-medical-marijuana-racist/", "domain": "breitbart.com", "title": "Montel Williams Calls Medical Marijuana Opponents Racist", "authors": ["Breitbart News"], "publish_date": "10-19-2012", "text": "Talk show host Montel Williams is a vigorous supporter of medical marijuana. Williams uses the drug to combat symptoms from Multiple Sclerosis. And he isnt taking kindly to a new ad running in Arkansas that speaks out against bringing legal medical marijuana shops to the state. The former talker says the ad in question is racist to the core. Offensive is really an understatement. Its the most egregiously racist, false statement youve ever seen in your life, Williams reportedlytold the Little Rock crowd in regards to a TV ad that aired opposing the measure. Theyve people sitting in a picture holding guns, talking about medical marijuana, and of course they happen to be of different colors to make sure youre as irritated and angry as you can be.", "summary": null}
{"url": "http://www.breitbart.com/big-government/2012/06/21/tx-dems-legalize-pot/", "domain": "breitbart.com", "title": "TX Dems Move to Legalize Pot", "authors": ["William Bigelow"], "publish_date": "06-21-2012", "text": "What other license to violate societal norms can the Democratic Party endorse? Now its drugs. Texas Democrats have joined with other supporters of legalizing marijuana in urging the federal government to decriminalize the drug. In the partys platform, the Democrats are asking the White House, the Department of Justice, and Congress to back such a move. In the platform, the Democrats claim that 85 percent of the arrests made related to marijuana are only for possession, not distribution, and the government outlawing the drug only gives control to the drug cartels and street gangs. They say marijuana should be treated like alcohol and tobacco: Decriminalization of marijuana does not mean we endorse marijuana use, but it is only a call for wiser law enforcement and public health policy. Recent polls show over 50 percent of Americans believe marijuana should be decriminalized. Gilberto Hinojosa, the Texas Democratic Party chairman, said, you shouldnt put a criminal stigma on these young folks for the rest of their lives. It is becoming apparent that the Democratic Party wants to control Americans lives in every way but one: what to do with their bodies in any way that counters traditional morality. Whether its abortion on demand or legalizing drugs, the Democratic Party now represents a libertine hedonistic lifestyle which brooks no opposition and eschews personal responsibility. And this move by the Texas Democrats is more of the same.", "summary": null}
{"url": "http://www.breitbart.com/big-government/2012/12/11/gallup-two-in-three-americans-favor-federalism-for-marijuana-laws/", "domain": "breitbart.com", "title": "Gallup: Two in Three Americans Favor Federalism for Marijuana Laws", "authors": ["Tony Lee"], "publish_date": "12-11-2012", "text": "A new Gallup poll found that 64% of Americans support federalism when it comes to marijuana laws, saying the federal government should not enforce federal laws against marijuana in states such as Colorado and Washington that recently voted to legalize marijuana use. Even 40% of Americans who are personally against the legalization of marijuana were in favor of federalism. The Federal Controlled Substances Act prohibits marijuana use, and state laws such as those in Washington and Colorado are in conflict with it. According to the poll, 60% of Americans aged 18 to 29 support legalizing marijuana while about as many of those 65 and older are opposed. The bulk of middle-aged Americans those aged 30 to 64 are split on the issue. Among Republicans, 66% believe marijuana should be legalized while 33% support legalization. Democrats favor legalization, with 61% in support and 38% opposed to legalization. Independents are split, with 50% supporting legalization and 47% in opposition. Fifty percent of Americans believe marijuana should not be legal while 48% believe it should be.", "summary": null}
{"url": "https://www.breitbart.com/asia/2018/12/03/philippines-duterte-jokes-smoked-marijuana-southeast-asian-summit-stay-awake/", "domain": "breitbart.com", "title": "Philippines’ Duterte ‘Jokes’: I Smoked Marijuana at Southeast Asian Summit ‘to Stay Awake’", "authors": ["Frances Martel"], "publish_date": "12-03-2018", "text": "President Rodrigo Duterte of the Philippines, who has adopted as his signature policy a violent nationwide crackdown on drug use, claimed in remarks on Monday that he uses marijuana to stay awake. Duterte later told reporters he was of course joking, trying to keep a rambling speech about how much he disliked the experience of attending this years Association of Southeast Asian Nations (ASEAN) summit from getting too boring. Duterte was speaking at an event celebrating the Philippine Organizing Committee that put together the countrys delegation to ASEAN. The Philippine president typically deviates from the main themes of events he attends in his remarks, instead taking time to discuss matters of interest to him, such as his distaste for the Catholic Church. Last week, he threatened to decapitate a Philippine bishop for allegedly buying drugs, a claim Duterte did not back with evidence. At the ASEAN event in Manila Monday, Duterte took the time to detail his many complaints about the conference, calling it a killing activity, implying that the world leaders who attend spend most of their time there slowly dying inside. Me, not so much, he added, because I take marijuana to stay awake. It doesnt work, with others. Duterte used Sultan of BruneiHassanal Bolkiah as an example of one of the world leaders who fell asleep during the event. Just between us, but Bolkiah slept during the events, Duterte said during the public speech at the presidential palace Monday. He has a talent to make it appear that he was not sleeping, so it is as if he is contemplating his oil. Duterte also complained about the awful food at the event, claiming he had to bring his own canned meats and eat them in his hotel room to avoid consuming catered ASEAN food for heads of state. The food sucked. Jesus, Mary,and Joseph, its true, Duterte protested. I have to bring Karne Norte and dried fish. He went on to complain that the heads of the ASEAN think were boy scouts and overbook each world leaders schedules. I cant take it, he added. The ASEAN conference occurred last month in Papua New Guinea. At the time, Duterte skipped several significant meetings at ASEAN and went on to skip four meetings scheduled at the Asia-Pacific Economic Cooperation (APEC) conference in Singapore, which occurred immediately after the ASEAN summit. He also skipped the ASEAN gala, which he hosted in 2017 when the Philippines organized it. Dutertes presidential spokesman, Salvador Panelo, told reporters that Duterte skipped the meetings for power naps necessary due to the punishing schedule he faced. Dutertes remarks about marijuana have triggered the most outrage, as police have killed thousands of Philippine nationals in shootouts since Duterte took office in 2016, vowing to kill the nations drug criminals and eradicate illicit drug use entirely. Marijuana use is illegal in the Philippines. An estimated 5,000 people have died since Duterte took office in incidents related to law enforcement against drug crime. The first police convictions for wrongful killing of drug suspects occurred on Friday; Duterte has vowed to pardon officers who kill Philippine citizens suspected of using or trafficking in drugs. Asked to clarify his remarks Monday, Duterte said, Of course I was joking. I want to shake a tree in the middle of a [speech]. He added that his speech would be boring if he did not make jokes and that this was part of his style. Its too late to change, he concluded, adding, If you believe it, you are stupid. In an interview in 2016,Duterte issued support for legalizing medical marijuana, insisting that cannabis is really an ingredientof modern medicine now. There are medicines right now being developed or already in the market that contains marijuana as a component but used for medical purposes. Yet he rejected the idea of smoking cannabis recreationally, warning that those who fight the law by using it in the manner will die. Rappler added that Duterte has previously admitted , without claiming to be joking, to the use of fentanyl , an extremely addictive and dangerous opioid believed to have played a role in nearly half the opioid overdose deaths in the United States in 2017. Duterte claimed to use fentanyl in a patch form to relieve chronic back pain.", "summary": null}
{"url": "https://www.breitbart.com/border/2014/03/09/son-sets-mom-apartment-on-fire-for-refusing-to-buy-him-marijuana/", "domain": "breitbart.com", "title": "Houston: Son Sets Mom's Apartment on Fire for Refusing to Buy Marijuana", "authors": ["Kristin Tate"], "publish_date": "03-09-2014", "text": "18-year-old John Carter allegedly set his mothers clothes on fire in their apartment, during a heated dispute in which she refused to give him money to buy marijuana. The incident occurred at 11 a.m. in their northwest Houston apartment complex located in the 15500 block of Ella Boulevard. Firefighters were called to the scene after fire spread throughout the entire apartment. Thankfully, however, there was only minimal damage to the building. Carter, who is currently in the Harris County jail, was charged with arson. His bail is set at $30,000.", "summary": null}
