{"url": "https://www.washingtonpost.com/blogs/in-the-loop/post/is-obama-endorsement-from-pot-group-smoke-and-mirrors/2012/08/29/b1e4bc46-f218-11e1-a612-3cfc842a6d89_blog.html", "domain": "washingtonpost.com", "title": "Obama endorsement from pot group sounds like smoke and mirrors", "authors": ["Emily Heil"], "publish_date": "08-29-2012", "text": "President Obama got an endorsement from a medical marijuana group. Even more surprised? Mainstream marijuana activists, many of whom have never heard of the organization or its founder, Tom Leto. The major lobbying and advocacy groups have so far held off on endorsing a presidential candidate they say Obama hasnt lived up to a vow to back off raids. Our whole community was asking who is this clown? says Aaron Houston, executive director of the Students for Sensible Drug Policy . And conspiracy theories, unsurprisingly, bloomed. The U.S. Medical Marijuana Chamber of Commerces press release endorsing Obama claimed it has 10,000 members in chapters across the country, and its Web site lists a box-office address on a swank stretch of Pennsylvania Ave. The group does not appear to be incorporated, nor is it listed in nonprofit records or in Dun & Bradstreet. A lone press clip from a 2010 event in New Jersey is the only mention to be found. We reached Leto, who said the fact that no one had heard of him meant he has more work to do. As for the lack of a paper trail, he says its in the works. Ive got attorneys working on all that, he says. Its a process, you know? We will be...I dont know how to say it, but lock, stock, and barrel in about two weeks. Leto says hes not naming his members to protect them. People arent ready to be out there, he explains. but Im out there and Im in it to win it. Leto, a California-based promoter of hydroponic equipment, explained the genesis of the company, a story that only adds a bit of mystery: he was working with the New York PR firm Todd Shapiro Associates to help market his hydroponics business when the concept snowballed into a nationwide organization advocating federal legalization of medical marijuana. Shapiro referred our questions to his office, but the person we spoke to there said she wasnt authorized to speak on the record. Still, pot advocates are wary. Paranoid, even. But then again...", "summary": null}
{"url": "https://www.washingtonpost.com/blogs/in-the-loop/post/romneys-opportunity-on-pot-policy/2012/03/19/gIQAR3tFNS_blog.html", "domain": "washingtonpost.com", "title": "Romney’s opportunity on pot policy", "authors": ["Emily Heil"], "publish_date": "03-19-2012", "text": "Efforts to legalize marijuana for recreational use are gaining momentum in Washington state and Colorado. We dont expect the teetotaling former Massachusetts governor, who has said he supports the federal ban, to take the leafy bait but there are a few reasons it might not be such a wacky idea, once the GOP field has shaken out and hes the last man standing. First, Pauls supporters could be quite valuable to the eventual GOP nominee. While theyve been dismissed as the partys fringe element, theyre young and enthusiastic two characteristics the GOP badly needs in a general election. (After all, Romneys managed to tick off Hispanics , so hes in need of any constituency he can get his hands on.) And then theres Colorado. With medical marijuana shops on nearly every corner and a libertarian-leaning electorate not to mention its status as a swing state the Centennial State could tempt Romney to take a seemingly radical turn on drugs. Pot legalizers note that he could couch his support in terms of a 10th amendment argument essentially saying it should simply be up to states to decide for themselves. That would allow him to maintain his own opposition to legalization while also giving a shout-out to social conservatives, who love a good nod to states rights. Theres evidence that the idea of pot-legalization is going mainstream even among Republicans. After all, Pat Robertson endorsed the idea, and approval among voters in recent polls is surprisingly ... well, high.", "summary": null}
{"url": "https://www.washingtonpost.com/blogs/in-the-loop/wp/2014/04/29/gop-congressman-pushes-for-medical-marijuana/", "domain": "washingtonpost.com", "title": "GOP congressman pushes for medical marijuana", "authors": ["Colby Itkowitz"], "publish_date": "04-29-2014", "text": "A conservative Republican is leading an effort to legalize medical marijuana. Rep. Morgan Griffith (R-Va.) told the Loop Tuesday he surprised some colleagues when he told them he was the author of a new marijuana bill, but he hopes having a Republican at the helm will make people take another look at it. Its not a new position for Griffith, who staked this position as Majority Leader in the Virginia legislature, and even drafted legislation in 2010 that swiftly died in the House of Delegates. Now as a member of Congress, Griffith has taken this libertarian view to a larger stage, introducing LUMMA, the Legitimate Use of Medicinal Marijuana Act. Griffiths bill would ensure states could make their own decisions about medical marijuana usage without the federal government stepping in. His bill would also reclassify marijuana under the Justice Departments controlled substances lists, so the drug wouldnt be linked with harder drugs, such as heroin. I am saying if we can use [opioids], why the fear of using [marijuana] for legit medicinal purpose? Griffith said. Public support for medical marijuana use is overwhelming. A CNN/ORC poll in January found 88 percent of American adults supports legalizing the drug for medical reasons. Griffith still thinks legalizing marijuana fully, so just anyone can go down to Billy Bobs marijuana shop, is irresponsible, he said. But there has also been a sea change in public opinion on legalizing marijuana for recreational use, as Colorado and Washington state did. A Pew Research Center study in February found 54 percent support making the drug legal, compared with 2010 when 41 percent supported marijuana legalization.", "summary": null}
{"url": "https://www.washingtonpost.com/blogs/mike-debonis/post/four-medical-marijuana-dispensaries-approved/2012/06/12/gJQAXHyhXV_blog.html?hpid=z5", "domain": "washingtonpost.com", "title": "Four medical marijuana dispensaries approved", "authors": ["Mike DeBonis"], "publish_date": "06-12-2012", "text": "Marijuana retailers are likely still months from opening. Of the four facilities Herbal Alternatives at 1147 20th St. NW; Metropolitan Wellness Center at 409 Eighth St. SE; Takoma Wellness Center at 6925 Blair Rd. NW; and Center City Care at 1334 N. Capitol St. NW three secured votes of approval from local advisory neighborhood commissions. (DCist had a fine rundown of the particular votes.) Only the Center City location didnt get its ANCs nod, but city health director Mohammad N. Akhter chose to keep it eligible to sell medical marijuana anyway. In a statement, Akhter said the continued progress, however slow, shows the Districts commitment to provide patients who are suffering from very specific conditions that require unique solutions to help alleviate their pain. It still could be months before marijuana is for sale. For one, the six cultivation centers previously approved for registration havent started growing operations. Without their marijuana supply, dispensaries have nothing to sell. According to a spokesman for the Department of Consumer and Regulatory Affairs, which oversees permitting, none of the six have applied for certificates of occupancy at their chosen facilities a final approval necessary to commence business. Those certificates require the personal approval of the citys zoning administrator, said the spokesman, Helder Gil.", "summary": null}
{"url": "https://www.washingtonpost.com/archive/business/1981/02/15/marijuana-a-pot-of-gold-in-latest-crop/b5fe4fd2-3262-428b-a964-15f09b7d37d4/", "domain": "washingtonpost.com", "title": "Marijuana: A Pot of Gold In Latest Crop", "authors": ["Jerry Knight"], "publish_date": "02-15-1981", "text": "When California's Mendicino County publishes it annual farm production census this spring, agricultural Commissioner Ted Erickson will dutifully report that wine grapes are the county's No. 1 crop. That's not true, and Eriksen knows it. But the Mendicino Board of Supervisors and California state officials have ordered him not to report on the county's most lucrative farm crop -- marijuana. Marijuana growing is a $100-million-a-year business in Mendicino, Eriksen estimates, so big it makes the county's $20 million worth of grapes look like small potatoes. After years of ignoring illegal marijuana farming, Eriksen finally included the crop in his annual report last year. He might as well have lit a joint in the courthouse. There was such a flap that Eriksen had to tear the marijuana page out of every issue of his annual report and promise never to report on pot again. \"A lot of people feel that if you don't mention it, it'll go away,\" says Eriksen. \"The fact is that this is an illegal crop, but it has tremendous impact on the economy of Mendocino County.\" Mendocino is one of 17 northern California counties in which Marijuana farming has reached such a scale that federal agents have been sent in to try and stop it. Until recently the marijuana business was dominated by imports, primarily from Columbia. But while U.S. steel and automakers are pleading for protection from imports and the nation's producers of shoes and television sets are strugglingto survive against foreign competition, the domestic pot industry is proving it can beat the imports. American Marijuana growers harvested a record crop last year, well over 1,000 metric tons of the illegal herb, federal authorities and private marijuana specialists estimate. Federal Drug Enforcement Administration statistics released a few days ago show U.S. marijuana production growing at a rate of better than 20 percent a year, while marijuana imports are up only about 13 percent. The agency estimates Americans smoked marijuana worth between $15.5 billion and $21.9 billion in 1979.Perhaps $2 billion to $3 billion worth was grown in the United States. By comparison, U.S. tobacco production was worth $17 billion that year. Once considered a youthful indulgence, marijuana has gained increasing acceptance among adults, the DEA said. Use of the drug by youths 12 to 17 is \"leveling off\" the agency reported, but \"there was an unexpected persistence in marijuana use between 1977 and 1979 among older adults (over 26) who used Marijuana in their youth.\" The rapid growth of marijuana cultivation has for the first time forced the DEA to switch some of its law enforcement effort from trying to stop smuggling and to concentrating on catching domestic producers. Commercial marijuana growing began in the United States only about five years ago, and already homegrown pot accounts for an estimated 7 percent to 10 percent of the 14,000 to 15,000 tons smoked each year. Measured in dollars, the domestic pot growers have captured an even bigger share of the market, because their product sells for two to 10 times as much as imported marijuana. As if they had taken a percentage lesson from Madison Avenue, U.S. marijuana farmers are cashing in by concentrating on the luxury market -- producing what even the DEA admits if the best marijuana available and charging premium prices for it. Domestic growers have used designer genitics to produce pot many times more potent than garden-variety grass. They've even given it what amounts to a brand name -- \"sinsemilla.\" The word is an amalgam of the two Spanish words meaning \"seedless\" but has come to imply champagne-quality homegrown marijuana. U.S. growers are getting $100 to to $200 an ounce for their sinsemilla, while Columbian grass sells for $40 or less. And because the channels of distribution are much shorter for American marijuana -- much of it is sold directly by the growers -- the domestic producers are making far greater profit. On an investment of $3,000 or less, a grower can easily produce a marijuana crop worth $100,000, says David Schickedanz, coordinator of the first federal effort to try to eradicate the infant industry before it gets any bigger. Between June and October of last year, local, state and federal agents participating in the DEA's \"Operation Sinsemilla\" raided 740 pot plots, arrested 527 persons and seized 129,329 marijuana plants weighing more than a total of 220,000 pounds. Counting another ton of processed pot that was seized, the operation netted an estimated $131.5 million worth of marijuana. All the seizures and arrests were made in 17 norther California counties (including Mendocino) where serious marijuana growing apparently got its start and is the most prevalent. California and Hawaii are the leading marijuana growing states, reports the DEA. \"We're not saying it's just Claifornia and Hawaii,\" stressed Schickedanz. \"You'll find it in every state that has a growing season long enough for vegetables. Anybody who can grow a tomato can grow marijuana. When the DEA began cracking down in northern California, growers moved over the border into Oregon. Arkansas is rapidly building a reputation as California's rival, say officials of the national Organization for Reform of Marijuana Laws (NORML). They contend marijuana is grown in every state and the District of Columbia, where much of it is cultivated indoors. Campaigning for the right to grow grass for personal consumption is the latest move for the group, which until now has stressed efforts to ease or erase criminal penalties for possession of small amounts. Only Alaska now permits people to grow their own grass, said George Farnham, the young lawyer who serves as a political director of NORMAL. In most states, growing marijuana is a far more serious crime than getting caught with an ounce or less. Many state laws treat cultivation of even a single marijuana plant with the same severity as selling drugs, imposing mandatory prison sentences. Farnhan says U.S. grass growers \"benefit the U.S. economy by keeping the money in the country instead of giving it to Columbia. It helps our balance of payments.\" Buying marijuana from a \"hippie farmer in Arkansas\" is better than getting it from a multinational smuggling ring, he argues. Government efforts to halt foreign marijuana production and smuggling, especially the spraying of the poison paraquat on marijuana fields, lead pot smokers to start growing their own, the NORML lawyer suggested. Fear of paraquat and the Mexican government's success in curtailing marijuana cultivation have cut imports of the Mexican variety sharply, the DEA says. From 2,200 tons in 1978, Mexico's supply to the U.S. fell to at most 1,500 tons in 1979. Imports of Jamaican \"ganga\" doubled, however, as troubles in the economy of that island nation lead more Jamaicans to turn to growing and smuggling. Colombia remains the main supplier, exporting an estimated 10,100 tons of marijuana to the United States in 1979. Smuggling has grown to such an organized level that twice in 1979 U.S. drug agents intercepted shipments of 50 tons of marijuana -- an entire shipload. Marijuana weed, also known as the hemp plant, was cultivated for rope in midwestern states during World War II and still grows wild in much of the country. But marijuana smokers learned long ago that wild weeds don't have the desired impact. The plants are very low in cannabis resin and in tetrahydrocannabinol (Thc), the ingredient that makes users \"high.\" \"People used to look down their noses at homegrown,\" Farnham says, \"but now when you're talking homegrown, you're talking about the best marijuana in the world.\" American marijuana is considered more desirable, he explained, because growers have learned how to increase the THC content and grow a crop many times more potent than the imported variety. The most potent California marijuana contains as much as 6 percent pure THC, agreed DEA agent Schickedanz, while ordinary grass has as little as 0.05 percent of the psychoactive chemical. To make their stuff stronger, pot farmers plant a different variety. The marijuana grown in Mexico, Colombia and Jamaica and the wild weed in the United States is a plant called cannabis satavia. Another variety grows in Asia, cannabis indicia, containing much more resin. Americans in Vietnam developed a taste for the Eastern variety and brought the seeds home with them. But the secret of sinsemilla is in the growing. The cultivators emasculate their marijuana patches, culling out the male plants as soon as their sex can be determined. Struggling futiley to reproduce without males, the frustrated females pour all their energy into producing THC, because the sticky chemical helps trap pollen. The result is a monster marijuana plant -- 10 to 20 feet tall, vivid green, bushy as a Christmas tree and literally dripping with THC. DEA officials estimate that each sinsemilla plant will yield an average of a pound of pot, and some will produce two or even three pounds. Both DEA and NORML representatives agree that $1,000 a pound is the going price for sinsemilla in that quantity.The smoker who buys an ounce will probably pay $100 to $200 for it, pushing the value of a pound to $2,000 or $3,000. Government drug officials in the past have been accused of inflating the value of drugs to exaggerate their danger. But DEA estimates of sinsemilla output are based on the one-pound-to-the-plant, $1,000-a-pound rule, and NORML officials say the government numbers are, if anything, on the low side. But the pro- and antimarijuana forces disagree on other aspects of marijuana growing. The people who want to legalize pot describe a cottage industry right out of \"The Greening of America\" with friendly folks who, as Farnham puts it, \"grow a little grass for themselves and their friends.\" DEA talks of marijuana millionaires, pot plantations and staggering profits. A single sensimilla plant will yield 1,500 hand-rolled joints of marijuana too potent for most smokers to consume by themselves. \"One plant is enough to keep somebody stoned out of their mind for a year,\" said Schickedanz. Each plant requires a plot about three feet in diameter, so a moderate-sized garden will produce 100 plants yielding $100,000 worth of sinsemilla, the DEA agent noted. The biggest grower busted by the DEA in its California raids had 7,200 plants, worth at least $7 million. With a crop that valuable, the growers don't just throw their seeds in the ground and wait for the harvest, Schickendanz said. About this time of year they start the seeds in individual planting pots, just like tomatoes or cabbages. In the spring, the seedlings are transplanted outside. (Urban growers often produce pot in a closet, using fancy lighting systems that produce the wavelengths the plants prefer.) Deer, rabbits and other garden pests love the leafy marijuana plants, so most of the serious growers fence their plots with chicken wire or woven wire fencing. To keep out burrowing creatures, they extend the wire underground, and to keep out poachers, more than a few plots have burglar alarms. Schickedanz said one of the California growers his group caught last year had installed two above-ground swimming pools to hold water and liquid fertilizer for his marijuana garden. \"He'd hooked up a couple of pumps. All he had to do was step out of his cabin and hit a switch, the first pump would run until the plants got their water, then shut off automatically. Then a second pump would give them the fertilizer.\" The DEA agent estimates \"Operation Sinsemilla\" wiped out 20 percent to 40 percent of the marijuana crop in northern California last year. But, he admitted reluctantly, \"I personally don't think we'll ever stop it.\"", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/news/wonk/wp/2017/12/01/medical-marijuana-took-a-bite-out-of-alcohol-sales-recreational-pot-could-take-an-even-bigger-one/?fbclid=IwAR2R-NtsfJ9sz3Gp0v8FYKAZpt2KN8kdCsg1dZVeojHwkHx6jJgVYVRcnzQ&noredirect=on", "domain": "washingtonpost.com", "title": "Medical marijuana took a bite out of alcohol sales.", "authors": ["Christopher Ingraham"], "publish_date": "12-1-2017", "text": "at 1:41 PM An assortment of marijuana strains are seen Nov. 11,during the High Times Harvest Cup in San Bernardino, Calif. (Richard Vogel/AP) Alcoholic beverage sales fell by 15 percent following the introduction of medical marijuana laws in a number of states, according to a new working paper by researchers at the University of Connecticut and Georgia State University. The study adds to a growing body of evidence showing that marijuana availability can reduce alcohol consumption. Because experts generally agree that, on balance, alcohol use is more harmful to individuals and society than marijuana use , thiswould represent a significant public health benefit of marijuana legalization. For the study, researchers examined alcohol sales data included in Nielsen's Retail Scanner database , which includes product-level sales data from 90 retail chains across the United States.The researchers say this represents an improvement over other ways of measuring alcohol consumption survey respondents, for instance, are known to severely lowball their alcohol consumption when asked about it by interviewers. The researchers compared alcohol sales between states that implemented medical marijuana laws and those that didn't, before and after the change in marijuana laws. They also corrected for a number of economic and demographic variables known to affect alcohol use, such as age, race and income. We find that marijuana and alcohol are strong substitutes for each other, the study concludes. Counties located in[medical marijuana] states reduced monthly alcohol sales by 15 percent after the introduction of medical marijuana laws. If these findings are correct, it's likely that they understate the effect of full marijuana legalization on alcohol use. Under medical marijuana laws, only a small handful of people are legally able to access the drug patientswishing to use it must typically obtain a recommendation from a doctor, and in most states only certain conditions are eligible for treatment with marijuana. Full recreational legalization, as is the case now in Colorado and seven other states, means that any individual can purchase pot on demand. While not all of the existing research agrees that marijuana availability decreases alcohol use, a solid body ofevidence points to that conclusion. An analysis last year of 39 reports on the subject found that 16 supported the idea that people substitute marijuanause for alcohol, while 10 studies suggested that marijuana availability actually increased alcohol use. Twelve additional studies supported neither conclusion. Unlike alcohol, marijuana has no known fatal dose people don't die of marijuana poisoning. Relative to marijuana, alcohol is more addictive , far more likely to cause vehicle accidents , and much more closely linked to violent and aggressive behavior . In the United States, excessive alcohol use kills nearly 90,000 people each year, according to theCenters for Disease Control and Prevention.", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/news/wonk/wp/2018/06/27/oklahoma-voters-just-approved-one-of-the-most-progressive-medical-marijuana-bills-in-the-country/?ref=patrick.net&tid=ss_tw&utm_term=.ff3a3f8660fe&__twitter_impression=true", "domain": "washingtonpost.com", "title": "Oklahoma voters just approved one of the most progressive medical marijuana bills in the country", "authors": ["Christopher Ingraham"], "publish_date": "06-27-2018", "text": "at 12:07 AM Theleaves of a marijuana plant inside Ultra Healths cultivation greenhouse in Bernalillo, N.M. (Susan Montoya Bryan/AP) Oklahoma voters approved a medical marijuana bill on Tuesday, making the state the 30th in the nation to permit the use of marijuana with a doctors recommendation. The measure is notable for reflecting one of the most permissive medical cannabis policies in the country. While most states specify a narrow list of medical conditions for which doctors can recommend the plant, in Oklahoma doctors will be able to recommend it for any condition. Last year the National Academies of Sciences, Engineering and Medicine reviewed the evidence on medical marijuana and concluded that itis effective at reducing chronic pain in adults, as well as nausea and vomiting in cancer patients. Oklahoma patients with a medical marijuana license will be able to possess up to eight ounces of marijuana in their residences, carry up to three ounces, and grow up to 12 marijuana plants. The limits for possession and cultivation are stricter in many other states , and some states,such as New York, mandate that the drug cannot be smoked . Additionally, Oklahomas measure reduces penalties for the possession of up to 1.5 ounces of marijuana for any individual with a medical condition, regardless of whether they have a medical marijuana license. With 98 percent of precincts reporting as of 10p.m. Central time, the medical marijuana measure was leading with the support of 57 percent of voters, with 43 percent opposed. That level of support is striking for a primary election in a deep red state that voted for President Trump by a greater than a 2-to-1 margin in 2016. Members of the states Republican establishment had lined up in opposition to the measure. U.S. Sen. James Lankford recorded a TV ad urging voters to reject the measure, arguing that our families wont be better if more parents and grandparents smoke more marijuana. Gov. Mary Fallin said the measure basically allows recreational marijuana in the state of Oklahoma. Tuesdaysresults suggest that Oklahoma Republicans largely shrugged off those concerns. About 53 percent of voters cast ballots in the GOPgubernatorial primary this evening, suggesting the medical marijuana measure won over a majority-Republican electorate. Fallin said in a statement that she will be discussing with legislative leaders and state agencies our options going forward on how best to proceed with adding a medical and proper regulatory framework to make sure marijuana use is truly for valid medical illnesses.", "summary": null}
{"url": "https://www.washingtonpost.com/archive/local/1977/02/23/md-delegate-backs-study-on-easing-marijuana-law/8b714e1c-a57f-44f0-8821-c186c7606ced/", "domain": "washingtonpost.com", "title": "Md. Delegate Backs Study On Easing Marijuana Law", "authors": ["Donald P. Baker"], "publish_date": "02-23-1977", "text": "A legislator who said he has \"never smoked a cigarette or a weed and I'm somewhat of a teetotaler\" today urged his colleagues to authorize a study of whether Maryland should become the first state to fully legalize marijuana. Del. Charles A. Docter (D-Montgomery) said that \"keeping laws on the books that are not prosecuted, or are prosecuted unevenly, decreases the respect for law and order.\" Docter said \"kids disrespect\" marijuana laws much the way their grandparents ignored the prohibition of alcohol. \"A hypocrisy has set in,\" said Docter, citing reports that marijuana \"may not be as bad as alcohol.\" He said its popularity is increasing and more and more young people through their 30s are becoming \"regular instead of occasional users.\" He noted that President Ford's son has admitted smoking it and one of President Carter's sons was \"busted out of the Navy for using it.\" Docter's resolution calls for a nine-member task force to study the \"legalization, control and distribution\" of marijuana. It met with criticism within the House Judiciary Committee today, although all of the cityzen witnesses favored it. Docter said he is \"not necessarily\" in favor of legalizing the use of marijuana but he believes the task force should study that possiblity. \"We should move, but carefully\" in that direction, Docter said. A second measure, sponsored by Sen. Clarence M. Mitchell III (D-Baltimore), would decriminalize the use of marijuana by permitting persons cited for possession of one ounce or less to post collateral of no more than $100. Similar to parking tickets, additional offenses would be treated the same way. Eight states have decriminalized possession of small amounts of marijuana, but Docter said reducing the penalty is a \"copout\" that doesn't solve the problem of forcing users to deal with criminal pushers. It also does not permit states to set minimum standards of quality and a minimum age for users, both of which Docter favors. Del. Steven V. Sklar (D-Baltimore) said he opposes legalization or decriminalization, noting that the pressure for change is coming from people who have abused the law, \"These kids have been violating the law from the beginning. Where is the respect?\" Sklar asked. State's Attorney Andrew Sonner of Montgomery County testified that existing laws are enforced unevenly. \"Many police officers confiscate the stuff but release the person,\" said Sonner, who has instructed his staff not to prosecute persons arrested for possessing small amounts of marijuana for their own use. Before adopting that policy, Sonner said the \"universal result\" of defendants who appeared in Montgomery County courts was that they were placed on probation and their criminal records later expunged.", "summary": null}
{"url": "https://www.washingtonpost.com/archive/local/1977/04/13/dc-policeman-wife-charged-with-possession-of-marijuana/fc31b70d-75e4-421b-8d04-5e487e7fb4d1/", "domain": "washingtonpost.com", "title": "D.C. Policeman, Wife Charged With Possession of Marijuana", "authors": ["Alfred E. Lewis"], "publish_date": "04-13-1977", "text": "A D.C. policeman and his wife were arrested yesterday after an early-morning raid in which police found more than a pound of marijuana in their Northwest Washington, police reported. Police said Officer Donald L. Hood, 28, and his wife, Sharon Laverne Hood, 28, are charged with possession of marijuana, a violation of the Uniform Narcotics Act. The charge is a misdemeanor and carries a maximum one-year jail sentence. The Hoods had been charged originally with possession of a controlled substance with intent to distribute, a felony with a potential five-year penalty, but that charge was reduced in U.S. District Court yesterday. The arrests came after a three-week investigation by the Metropolitan Police Department's internal affairs division and the narcotics squad, police said. Acting on information from an informant, police said, they obtained a search warrant from a U.S. magistrate. The Hoods' home at 5313 14th St. NW was searched at 1:45 a.m. yesterday, police said. Police said they seized marijuana, a quantity of money and narcotics paraphernalia. Hood, a seven-year veteran of the police force, turned in his resignation immediately after his arrest, police said. He had been a uniformed officer attached to the first district substantion. Mr. and Mrs. Hood were released on their own recognizance and face a jury trial June 20 in D.C. Superior Court. The case was sent to Superior Court from U.S. District Court when the more serious charge against the officer and his wife were dropped in favor of the misdemeanor charge.", "summary": null}
{"url": "https://www.washingtonpost.com/archive/business/1982/12/18/in-third-week-the-pot-begins-to-bulge-nicely/2a6aa901-f53e-4200-9d9d-e4e24f38dcc2/", "domain": "washingtonpost.com", "title": "In Third Week, The Pot Begins To Bulge Nicely", "authors": [], "publish_date": "12-18-1982", "text": "With a week to go until Christmas, we have picked up the pace nicely. Our annual fund-raising campaign on behalf of Children's Hospital is homing in on $100,000, a cheery sum indeed. But around the paper-strewn slum they call my office, we think of that 100 thou as the first of its kind. We are hoping for three more just like it, which would make the 1982-83 campaign the largest ever by a considerable margin. However, we aren't going to be fruitful and multiply our \"take\" without help from you readers -- lots of you, as many of you as possible. We hope that you'll take a moment and send a check or money order today. As I have said, even $5 will help. And you probably won't miss it. After all, five bucks is about what a movie or a half-hour in a video games arcade costs these days. When you think of it that way, it doesn't sound like an awful lot. Here are the totals as they stand this morning: Grand total to date: $62,568.12. Total given this week: $26,186.60. Individual donors to date: 1,280. Group donors to date: 111. For those of you keeping score, the grand total after three weeks of the 1981-82 campaign stood at $29,019.28, far less than what we have raised in the same period this year. But this is no time for overconfidence, or resting on laurels. While the Christmas spirit is upon you, why not share a little of it with a sick child at Children's? You will make his holiday a little brighter in the process, and you will help make possible the care and the research that will get him well, and get him home, a little faster.", "summary": null}
{"url": "https://www.washingtonpost.com/amphtml/world/europe/in-italy-the-army-provides-medical-marijuana-and-thats-a-problem/2017/11/29/339e027e-d454-11e7-9ad9-ca0619edfa05_story.html", "domain": "washingtonpost.com", "title": "In Italy, the army provides medical marijuana. And that’s a problem.", "authors": ["Anna Momigliano"], "publish_date": "12-1-2017", "text": "at 1:00 AM A military officer and a horticultural expert tend cannabis plants under cultivation by the Italian army at the Stabilimento Chimico Farmaceutico Militare (Military Chemical Pharmaceutical Plant) in Florence in May. (Laura Lezza/Getty Images) MILAN In Italy, as in most of western Europe, medical cannabis is legal. What sets the country apart is that cultivation of the plant is a de facto army monopoly. The only place cannabis can be legally grown here is at a heavily guarded military facility in Florence where, this year, two greenhouses produced a yield of about 220 pounds. \"We do everything in-house,\" said the facility's director, Col. Antonio Medica. \"We grow the plants, harvest them, dry and grind the leaves, sanitize the final product with gamma rays, then ship it to pharmacies and hospitals.\" Now the army's involvement in the therapeutic marijuana business is set to expand. Under a new budget law moving through Parliament, the cannabis program at the Military Chemical Pharmaceutical Plant is to receive an additional $2 billion in public funding. If the bill is approved as anticipated, military officials say, they expect production to triple within a year. The bill will also make medical cannabis free for all patients, with the cost covered by the government. Until now, local governments have covered the cost in just 11 of Italy's 21 provinces. Not everyone is happy with the army's role, however. Some say they believe that even with the new funding, the quantity and the quality of Italian-grown cannabis will fall short. Related: [The millennial who could be Italys next leader] To understand how the army ended up growing pot, one has to understand the country's health policy and the way its implementation has, at times, been delegated to the military. Italy legalized cannabis for medical use in 2007, with many caveats. To grow the plant legally requires special authorization from the Health Ministry's narcotics office, which means dealing with the country's infamous bureaucracy. As a result, no private entrepreneur managed to set up a business, and the drug had to be imported from abroad, making it prohibitively expensive. Ten new greenhouses for cannabis cultivation, pictured above in May, are to be added to the two currently used at the armys Florence facility. The plant hopes to triple its production of medical cannabis to meet the demand of Italian patients and to end the need to import from abroad. (Laura Lezza/Getty Images) Since access to medical care here is considered a constitutional right, in 2014 the government assigned the task of growing medical-grade cannabis to the military. The army was already responsible for the production of \"orphan drugs,\" medications that cure rare diseases and are not produced in the market economy. \"Producing medicines is a standard part of what the Defense Industries Agency does, because health is a matter of national security,\" Medica said. Problems with the decision soon became apparent, according to critics. One difficulty is that the army makes only one strain of cannabis, called FM2, which is low in THC, one of marijuana's main active substances, when compared to imported strains. Andrea Trisciuglio, a 39-year-old multiple sclerosis patient from Foggia in southern Italy, said he has been using medical marijuana for the past 10 years to mitigate his symptoms but has found the local supply ineffective. \"The FM2 just doesn't work for patients like me,\" he said. \"I have to use Bedrocan\" a variety of cannabis with about 22 percent THC, compared to FM2's 8 percent. Trisciuglio said that his local hospital imports Bedrocan from the Netherlands but that he sometimes he has to wait as long as a month for it. The trouble with importing cannabis from the Netherlands is that it \"is expensive, which also makes it slow,\" said Carlo Valente, a lawyer in the southern city of Lecce who is representing Trisciuglio and other patients. Dutch medicines, he said, reach Italy through intermediary agencies, which raises their price. \"This is making doctors, who already struggle with the social taboo associated with cannabis, even more reluctant to prescribe it and hospital pharmacies less cooperative,\" he said. According to an investigation by the magazine Internazionale, imported cannabis can cost up to $84 a gram. By contrast, the army-produced cannabis costs $7 a gram, Medica said. \"We are a nonprofit.\" The medical-grade cannabis produced by the Italian army is the strain known as FM2, which some patients say is not as effective as imported varieties. (Laura Lezza/Getty Images) But to critics of the system, affordability does not cancel out the homegrown product's other shortcomings. In addition to quality issues, they say, the army lacks the capability to produce all the therapeutic cannabis that Italy needs. National consumption of the drug is between 880 and 1,000 pounds a year, according to military estimates. This means that even if the military succeeds in tripling its annual production to the anticipated 660 pounds, it will not meet the country's need, and imports from the Netherlands will still be necessary. To Trisciuglio, the army monopoly is not in patients' best interest. \"The army alone is just not enough,\" he said. \"We need to make it easier for others to grow medical cannabis.\" In 2012, Trisciuglio and other patients petitioned the local government for authorization to grow their own marijuana, under supervision, but never received a green light. Medica, however, is confident that the army can meet and keep up with the demand, perhaps even to the point of sending its own cannabis abroad. \"We are working around the clock to increase the production and are experimenting with a new variant, for patients who are not satisfied with FM2,\" he said. \"In the near future, we hope to export to San Marino and the Vatican.\"", "summary": null}
{"url": "https://www.washingtonpost.com/archive/business/1981/11/15/marijuana-lobbyists-claim-growers-harvest-record-crop/329c1497-5ec4-4c6c-97d7-9532b1d40a96/", "domain": "washingtonpost.com", "title": "Marijuana Lobbyists Claim Growers Harvest Record Crop", "authors": ["Jerry Knight"], "publish_date": "11-15-1981", "text": "Domestic marijuana growers are harvesting a record $8.2 billion crop of homegrown pot this year, the National Association for the Reform of Marijuana Laws has estimated. The 1981 marijuana crop is twice as big as last year's, making the illegal herb the nation's fourth most valuable farm product, after corn, soybeans and wheat, the pro-pot lobbying group claimed. A spokesman for the Drug Enforcement Administration called the $8 billion figure \"far-fetched\" but said federal authorities recognize domestic marijuana production is increasing. DEA estimated the 1979 U.S. pot crop was worth $1 billion to $1.5 billion and supplied about 10 percent of the marijuana smoked in America that year. \"We have no numbers for the 198l crop yet,\" said DEA press officer David Hoover. \"But based on the tonnage and the total market, I don't see how the domestic marijuana market could be $8.2 billion.\" George Farnham, political director for NORML, said the organization's estimates are based on law enforcement statistics, newspaper accounts and figures supplied by growers. Like law enforcement authorities, NORML values marijuana based on the price it would bring if sold in small quantities, Farnham said. Depending on quality, homegrown pot sells for $10 to $150 an ounce, he added. Much of the marijuana grown in the United States is smoked by the grower or friends rather than sold, so sales of domestic marijuana are smaller than the $8 billion crop value indicated, he conceded. NORML estimates between 1 million and 2 million Americans grew pot for personal use this year, but only one-tenth that many grew it commercially. Though several states have removed criminal penalties for possession of small quantities of marijuana, growing pot is illegal in every state except Alaska, which permits cultivation for personal consumption. The total number of marijuana arrests last year was about the same as the year before--342,000--but arrests for cultivation and sale jumped more than 25 percent, from 49,700 to 63,300, according to the National Commission on Marijuana and Drug Abuse. Marijuana cultivation has spread all over the country from Hawaii and California, and 29 states produced crops worth more than $100 million this year, Farnham claimed. With a crop valued at more than $1.5 billion, California is the leading marijuana producer, NORML says, followed by Hawaii at $750 million and Oregon at $400 million. NORML estimates Virginia grew $200 million worth of marijuana this year and Maryland produced another $100 million worth. Virginia Beach police arrested 180 people one day last August for growing pot around apartment complexes, NORML noted, and Scott County authorities found a field with an estimated 15,000 marijuana plants. Farnham said the growth of domestic pot production has been encouraged by the Reagan administration's decision to cut the budget of DEA and curtail federal aid to local law enforcement authorities. The administration recommended cutting the DEA budget 12 percent, from $228.5 million to $201 million for fiscal 1982. The House and Senate versions of the DEA budget call for appropriations of about $231 million. NORML officials say the government's decision to spray the herbicide paraquat on Mexican marijuana fields led to widespread cultivation of marijuana in the United States. Rather than risk paraquat poisoning, potsmokers decided to grow their own, Farnham explained. Homegrown marijuana was once regarded as inferior to that grown in Mexico, Colombia or Jamaica, but that's no longer the case. Native American marijuana is a plant variety called cannabis sativa, the same hemp plant cultivated since colonial times for the fibers used to make rope. Now growers are cultivating cannabis indica, a Far Eastern variety that is richer in the intoxicating chemical tetrahydrocannabinol (THC). While cannabis sativa is a skinny plant that can grow 15 feet tall, the more potent indica strain grows like a bushy Christmas tree and can yield as much as two pounds of dried and ready-to-smoke marijuana. To make the smoke more potent, Farnham explained, growers have learned to weed out the male marijuana plants and cultivate a sterile, seedless female plant known as sinsemilla, the Spanish word for seedless. Unable to reproduce, the frustrated female plants pour all their energy into producing THC resin. It is this high-powered homegrown pot that sells for up to $150 an ounce, inflating the value of the domestic crop, NORML officials say. The organization says wild animals and poachers are greater threats to marijuana patches than are law enforcement authorities. To avoid being caught with the crop in their yard, growers have taken to planting their patches on public land. The U.S. Department of Agriculture reported earlier this year it has found marijuana being cultivated in most of the national forests.", "summary": null}
