{"url": "http://www.foxnews.com/health/2008/06/12/marijuana-poses-health-risks/", "domain": "foxnews.com", "title": "Marijuana Poses More Health Risks", "authors": ["Jessica Ryen Doyle"], "publish_date": "06-12-2008", "text": "Marijuana potency increased last year to the highest level in more than 30 years, posing greater health risks to people who may view the drug as harmless, according to a report released Thursday by the White House. The latest analysis from the University of Mississippi's Potency Monitoring Project tracked the average amount of THC, the psychoactive ingredient in marijuana, in samples seized by law enforcement agencies from 1975 through 2007. It found that the average amount of THC reached 9.6 percent in 2007, compared with 8.75 percent the previous year. The 9.6 percent level represents more than a doubling of marijuana potency since 1983, when it averaged just under 4 percent.", "summary": null}
{"url": "http://www.foxnews.com/health/2014/03/19/ptsd-added-to-medical-marijuana-worthy-conditions-in-michigan/", "domain": "foxnews.com", "title": "PTSD added to medical marijuana-worthy conditions in Michigan", "authors": ["Associated Press"], "publish_date": "03-19-2014", "text": "A state official has reluctantly added post-traumatic stress disorder to the list of conditions that qualify for medical marijuana in Michigan. Steve Arwood, who heads the agency that oversees the program, said hes following the recommendation of an advisory panel, especially the affirmative vote of Michigans chief medical executive, Dr. Matthew Davis. I do remain very concerned with the scope of this approval and the process in general. First, the condition of PTSD is a mental health issue. Granting this approval steps Michigan away from the use of marijuana for disease of the body or chronic pain symptoms of a physical nature, Arwood said in an order dated last Friday. PTSD is considered a mental health condition linked to a terrifying event. Since Michigan voters approved it in 2008, marijuana typically has been used to relieve the side effects of cancer, glaucoma, HIV, hepatitis C and a few other conditions. PTSD is the first condition to be added to the original list, although seven other states allow doctors to recommend marijuana to treat the disorder. Michigan users of medical marijuana need a doctors diagnosis and a card from the state. More than 100,000 people have cards, including 86 who are under age 18, according to the Department of Licensing and Regulatory Affairs. I remain concerned that there may be insufficient evidence on the effect of marijuana on minors, said Arwood, department director.", "summary": null}
{"url": "http://www.foxnews.com/health/2015/01/13/half-teen-young-adult-car-crash-deaths-involve-pot-or-alcohol.html", "domain": "foxnews.com", "title": "Half of teen, young adult car crash deaths involve pot or alcohol", "authors": ["LiveScience"], "publish_date": "01-13-2015", "text": "Half of the teen and young adult drivers who die in car crashes are under the influence of either pot, alcohol, or both, suggests a new study done in states where toxicology screening for accident victims is routine. What's more, the increasing legalization and availability of marijuana does not seem likely to push alcohol use aside, the researchers said. The crash victims in the study who were over age 21 (and of legal drinking age) were more likely than younger victims to have used both marijuana and alcohol prior to their crash. \"Given the rapid changes currently underway in marijuana availability and permissibility in the U.S., understanding the effects of drug control policies on substance use behavior and adverse health outcomes, such as fatal motor vehicle crashes , has never been more important,\" study researcher Katherine Keyes, of Columbia University's Mailman School of Public Health, said in a statement. Under the Influence Car crashes are the leading cause of death of 18- to 25-year-olds in the U.S., and driving under the influence is a major cause of accidents. Not every state conducts routine toxicology tests on car crash victims right after the accident, but those that do have come up with alarming results. For example, a 2012 study in the journal Addiction found that 57.3 percent of the drivers in this age group who died were on some kind of mind-altering substance, usually alcohol. [ The History of 8 Hallucinogens ] For Keyes and her colleagues pulled data on 16- to 25-year-olds from the Fatality Analysis Reporting System (FARS), a federal database of fatal crashes. They focused on California, Connecticut, Hawaii, Illinois, New Hampshire, New Jersey, Rhode Island, Washington and West Virginia, because each of these states tests at least 85 percent of its fatal car crash victims for drugs and alcohol within an hour of the accident. The researchers found that half (50.3 percent) of the young drivers who died were drunk or high at the time of their fatal crashes, the researchers found. In total, 36.8 percent tested positive for alcohol alone, while 5.9 percent tested positive for marijuana alone and 7.6 percent had been using both. Mixing alcohol and marijuana Next, the researchers wanted to know whether at-risk youth were using pot and alcohol as substitutes for one another; if so, the results might suggest specific policy changes. For example, they wrote in the open-access journal Injury Epidemiology , a large coalition of university presidents recently recommended lowering the legal drinking age to 18 in the hopes that access to alcohol would make other illegal drugs less appealing to 18- to 21-year-olds. That policy would only work, though, if young people tend to drop one drug in favor of another, rather than just double up. Looking at the 16- to 25-year-old age range enabled the researchers to see how drug use changed in accident fatalities at the 21-year mark the turning point when alcohol becomes legal. They found that at age 21, the likelihood of finding alcohol alone in the crash victims' systems went up 14 percent. At the same time, the likelihood of finding pot alone went down 24 percent. But there was a catch: In victims over age 21, the chances of finding both alcohol and marijuana in the victims was 22 percent higher than in those under age 21. Ultimately, the researchers concluded, the availability of alcohol has little effect on young people's use of marijuana. It's possible that young people who tend to use only one substance do switch from marijuana to alcohol at age 21, they wrote. But for others, who tend use more than one substance, the legality of alcohol seemed to actually increase the use of marijuana, as well. \"Taken together, we found no significant substitution effect between alcohol and marijuana ,\" study researcher Guohua Li, director of Columbia University's Center for Injury Epidemiology and Prevention, said in a statement. \"Rather, increased availability seems to increase the prevalence of concurrent use of alcohol and marijuana.\"", "summary": null}
{"url": "http://www.foxnews.com/health/2016/03/16/13-year-old-who-moved-for-access-to-medical-marijuana-dies.html", "domain": "foxnews.com", "title": "13-year-old who moved for access to medical marijuana dies", "authors": ["Associated Press"], "publish_date": "03-16-2016", "text": "A 13-year-old medical marijuana advocate who moved from Connecticut to Maine so she could access cannabis to treat a rare form of epilepsy has died. Two medical marijuana advocacy groups say Cyndimae Meehan died Sunday in her family's Augusta home. She had a severe form of epilepsy known as Dravet syndrome. Her mother moved her to Maine to access medical marijuana after failed attempts to treat the girl's frequent seizures using federally approved drugs. Connecticut doesn't allow pediatric medical marijuana use. A family friend and medical marijuana advocate says Cyndimae regained her strength and stopped using a wheelchair once she began taking cannabis oil. The family became medical marijuana advocates, often testifying on state medical marijuana bills. The family is planning a funeral in Connecticut.", "summary": null}
{"url": "http://www.foxnews.com/health/2016/03/30/whoopi-goldberg-launches-line-medical-marijuana-products-for-women.html", "domain": "foxnews.com", "title": "Whoopi Goldberg launches line of medical marijuana products for women", "authors": ["Fox News"], "publish_date": "03-30-2016", "text": "Whoopi Goldberg has joined the ranks of celebrities like Snoop Dogg and Bob Marley by launching a new line of medical mairjuana productsin this case, to help ease period cramps. The line, which will be sold under the name the Whoopi & Maya brand will be sold in California to individuals with a medical marijuana card, USA TODAY reported . Goldberg told the newspaper that three friends and family members of hers and edibles maker Maya Elizabeth had offered financial backing for the company, and that Goldberg will serve as chairwoman of it. I dont want this to be a joke to people, Goldberg told USA TODAY. Its not a joke to women.\" Pricing hasnt yet been established for the products, which will include a balm, a tincture, sipping chocolate and a bath soak. All of the products are infused with marijuana, USA TODAY reported. Goldberg, an outspoken proponent of medical marijuana , told The Daily Beast that she and Elizabeth are targeting a specific group the over \"50 percent of women\" who cope with painful cramps each month. That group includes herself. More on this... New York opens its first medical marijuana clinics 13-year-old who moved for access to medical marijuana dies Should pets be given medical marijuana treats? \"When I asked whether there was medicinal cannabis out there to give relief to women with cramps, I was told that would be a niche product, Goldberg told The Daily Beast . Were here for that niche, which is made up of half the population. Studies suggest medical marijuana may help relieve pain , glaucoma, movement disorders and nausea. Some research also has linked cannabinoid (CBD), a component of marijuana, to reduced epilepsy.", "summary": null}
{"url": "http://www.foxnews.com/politics/2015/05/04/black-farmers-say-floridas-medical-marijuana-law-shuts-them-out.html", "domain": "foxnews.com", "title": "Black farmers say Florida’s medical marijuana law shuts them out", "authors": ["Kyle Rothenberg"], "publish_date": "05-04-2015", "text": "Black farmers in Florida say they are being shut out from the state's emerging medical marijuana trade, and are pushing for changes in the law that would let them break into the limited, legal pot market. Though Sunshine State voters last fall rejected a broad medical marijuana ballot proposal, a more narrow measure ( Senate Bill 1030 ) was signed by Gov. Rick Scott nearly a year ago. The \"Compassionate Medical Cannabis Act of 2014\" allows some nurseries to grow \"low-THC\" pot and distribute to \"qualified patients\" suffering from cancer, seizures and muscle spasms. But for black growers in the state, \"It's a bad thing,\" said Florida Black Farmers and Agriculturalists Association President Howard Gunn Jr. Gunn is referencing one line in the law that is creating controversy. It states farmers must have a license to cultivate \"more than 400,000 plants\" and must have operated \"as a registered nursery in [Florida] for at least 30 continuous years.\" According to Gunn, hardly any black farmers meet that criteria. \"There weren't that many black farmers 30 years ago in the nursery business,\" he said. \"We say they weren't there because of the discriminatory practices set by the USDA.\" Gunn is talking about a case called \"Pigford v. Glickman,\" which started in the 1980s -- it led to one of the largest civil rights settlements in history, worth $1.3 billion. The USDA agreed to compensate thousands of black farmers who allegedly suffered racial discrimination from the USDA's farm loan program. Gunn points to that history in explaining why few, if any, black farmers would meet the criteria today to legally grow medical marijuana. \"Because of that, we weren't able to produce as much or be as profitable as [other] farmers,\" he said. \"If we found one [black] farmer growing that many plants, it would be surprising.\" There's an effort afoot in the legislature to address these concerns, but it got off to a rocky start. After an outcry from black farmers opposing the \"unobtainable\" requirement to grow pot, Sen. Oscar Braynon, a black Democrat from Miami, proposed an amendment to a separate bill to get rid of the 30-year, 400,000-plant requirement. The underlying bill -- which would end legal challenges associated with the 2014 version -- was authored by Senate Regulated Industries Chairman Rob Bradley, a Republican who played a major role in passing the 2014 law. Bradley reportedly asked Braynon to withdraw the amendment -- promising he would work on changing the \"discriminatory\" language in the bill. But that plan did not work out. The session ended prematurely, and neither the bill nor the amendment won approval. \"Unfortunately, the bill did not make it across the finish line,\" Bradley told XXX, He said they will work to address the issue when lawmakers return. \"I think [black farmers] have a legitimate issue and it's something that we will certainly continue to try and address when we're back in session next year,\" he said. Meanwhile, the sponsor of the original 2014 bill, state Rep. Matt Caldwell, said he was not aware of the potential effects the requirements would have on black farmers. \"I thought the ones who've been here the longest should be the first in line,\" he told The News Service of Florida . Florida isn't the only state working on changing marijuana laws. Georgia's governor recently signed a bill that will legalize low-THC cannabis oil for certain patients with illnesses. Around the same time, the state of Washington -- where smoking pot is legal -- created a law that implements a voluntary registry of patients and cracks down on illegal pot gardens.", "summary": null}
{"url": "http://www.foxnews.com/auto/2017/06/23/insurance-study-ties-legal-pot-to-boost-in-car-crash-claims.html", "domain": "foxnews.com", "title": "Insurance study ties legal pot to boost in car crash claims", "authors": ["Associated Press"], "publish_date": "06-23-2017", "text": "A recent insurance study links increased car crash claims to legalized recreational marijuana. The Highway Loss Data Institute, a leading insurance research group, said in study results released Thursday that collision claims in Colorado, Washington, and Oregon went up 2.7 percent in the years since legal recreational marijuana sales began when compared with surrounding states. Legal recreational pot sales in Colorado began in January 2014, followed six months later in Washington, and in October 2015 in Oregon. \"We believe that the data is saying that crash risk has increased in these states and those crash risks are associated with the legalization of marijuana,\" said Matt Moore, senior vice president with the institute, which analyzes insurance data to observe emerging auto-safety trends. Mason Tvert, a marijuana legalization advocate and communications director with the Marijuana Policy Project, questioned the study's comparison of claims in rural states such as Idaho, Wyoming, and Montana with Colorado, Oregon and Washington that have dense population centers and how that affected the study's findings. \"The study raises more questions than it provides answers, and it's an area that would surely receive more study, and deservedly so,\" Tvert said. Researchers accounted for factors such as the number of vehicles on the road in the study and control states, age and gender of drivers, weather and even whether the driver making a claim was employed. Neighboring states with similar fluctuations in claims were used for comparison. Insurance industry groups have been keeping a close watch on claims when auto accidents across the country began to go up in 2013 after more than a decade of steady decline. Insurance companies found several possible factors at play in the spike that included distracted driving through texting or cellphone use, road construction, and an improved economy that has led to leisurely drives and more miles driven, as well as marijuana legalization. \"It would appear, probably not to anyone's surprise, that the use of marijuana contributes to crashes,\" said Kenton Brine, president of the industry group Northwest Insurance Council that represents companies in Washington, Oregon and Idaho. He added: \"It would be difficult to say that marijuana is a definitive factor, lacking a citation, in a significant number of crashes to say that what we're seeing here is a trend.\" The Highway Loss Data Institute said its study examined claims from January 2012 to October 2016. \"The problem here is that it's a pretty new experience,\" said Carole Walker of the Rocky Mountain Insurance Information Association, an industry group that covers Colorado, Wyoming, Utah and New Mexico. \"This is the first study that has been able to isolate legal pot as one of the factors.\" Eight states and Washington, D.C., have legalized recreational marijuana for adults. Insurance Institute for Highway Safety spokesman Russ Rader adds that alcohol impairment remains one of the biggest concerns on the road. \"While we have proven countermeasures, proven strategies for reducing alcohol impaired driving, there are a lot of unanswered questions about marijuana and driving,\" Rader said. A study released last year by AAA's safety foundation found legal THC limits established by states with legal marijuana have no scientific basis and can result in innocent drivers being convicted, and guilty drivers being released. Moore of the Highway Loss Data Institute said they hope the study's findings will be considered by lawmakers and regulators in states where marijuana legalization is under consideration or recently enacted.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2017/10/22/corey-feldman-details-his-recent-arrest-for-marijuana-possession-on-social-media.html", "domain": "foxnews.com", "title": "Corey Feldman details his recent arrest for marijuana possession on social media", "authors": ["Fox News"], "publish_date": "10-22-2017", "text": "Corey Feldman is trying to set the record straight about his recent run-in with the law in Louisiana. The star took to Twitter after multiple outlets reported that he was arrested for possession of illegal marijuana. The former child-star, 46, was on his way to a gig with his band when their bus was pulled over for speeding. According to The News Star , the officer searched the vehicle after detecting the smell of marijuana. Feldman and the rest of the people traveling with him were arrested and charged with misdemeanor possession of marijuana, driving under a suspension and speeding. Because the charges werent felonies, he was able to pay the $640 fine rather than posting bond. On Sunday, the star took to Twitter, where he explained his side of the story in a series of all-caps tweets. HI #EVERYBODY & HAPPY 22ND! 4 THE RECORD, I WAS NOT ARRESTED OR PUT IN JAIL. I RECEIVED A MISDEMEANOR IN LOUISIANA, DUE 2 A MEMBER OF MY CREW HAVING MEDICAL MARIJUANA, WITH A LEGAL CA PRESCRIPTION, I HAD NOTHING ON ME, BUT WAS CHARGED BECAUSE ITS MY BUS. aLSO 5 OTHERS WERE CHARGED DUE 2 HAVING LEGAL MEDICINES WITHOUT THEIR PARTICULAR BOTTLES. NO ILLEGAL OR STREET DRUGS WERE FOUND ON THE BUS AT ALL! WHICH IS Y NOBODY SPENT THE NIGHT IN JAIL. HOWEVER WE WERE PROMISED THAT THESE CHARGES COULD ALL B DROPPED WITH PROOF OF PROPER SCRIPTS! IT WAS A BIT OF A GOOD OL SHAKEDOWN! AFTER WE PAID THEM IN CASH, THEY ASKED 4 PICS & AUTOGRAPHS, & THEN CALLED THE LOCAL PAPER 2 DO INTERVIEWS! I DO FIND THE TIMING OF ALL THIS IRONIC. Feldman went on to say that his band is continuing its tour, stopping to raise money for Houston next. As Us Weekly notes, his statement about the timing of the situation being ironic likely has to do with the fact that he recently spoke out against disgraced Hollywood mogul Harvey Weinstein, propelling him back into national attention. The star has claimed for years that he and his former costar, Corey Haim, were the victims of pedophiles in Hollywood.", "summary": null}
{"url": "http://www.foxnews.com/auto/2018/02/13/fatal-car-crashes-higher-on-420-marijuana-holiday.html", "domain": "foxnews.com", "title": "Fatal car crashes higher on 4/20 marijuana 'holiday'", "authors": ["Fox News"], "publish_date": "02-13-2018", "text": "A review of 25 years worth of car crash data has found a link between the so-called \"high holiday\" celebrated by marijuana users on April 20 (4/20) and a rise in fatal car accidents. The significance of the date is debated, but has been linked to the story of a group of students in San Rafael, Calif., who used to meet after school at 4:20 pm to smoke pot. The study conducted at the University of British Columbia looked at U.S. government statistics from 1992 - the year after an article in High Times magazine popularized the informal event - through 2016. Researchers compared fatalities on that date to those one week before and after it and found there to be a 12 percent increase on average, which represents 142 deaths. The study's authors hypothesized a connection based on previous research that suggests driving after marijuana use is \"surprisingly common\" and can increase crash risk. Other studies have found a similarly elevated risk linked with alcohol and driving on Super Bowl Sunday and New Year's Eve. Most accidents had no police data on drug testing so there's no way to confirm that marijuana was involved, but researchers think the drug was responsible for some crashes. The study was published Monday in JAMA Internal Medicine. \"It's a really relevant question to be thinking about now since legalization seems to be progressing across the United States and in Canada,\" Staples said. Marijuana is legal for medical use in most U.S. states and in Canada; recreational use has been legalized in nine states plus Washington, D.C. and is expected to become legal in Canada in July. According to the National Institute on Drug Abuse, marijuana can impair driving ability. However, the U.S. agency also notes that directly linking marijuana with car crashes can be difficult because it's often used while drinking alcohol. An earlier survey of college freshmen found that driving after marijuana use and riding with someone using pot was common, especially among young men, and more common than alcohol-linked driving. And a 2014 study in six states found that marijuana was increasingly detected in drivers killed in car crashes during a 10-year period. It's a recognized risk in Colorado, where voters approved legalizing it in 2012. Last year the state's transportation department partnered with Lyft and a pot industry group to offer discounted rides for pot users partaking in 4/20 festivities. The program runs through April this year. Data show that 15 percent of DUI arrests in Colorado last year involved marijuana, and a 2016 survey found about half of users in the state think driving under the influence of pot is safe. Dr. Andrew Monte, an emergency medicine physician and toxicology expert at the University of Colorado, said his hospital typically sees a slight increase in marijuana-using patients on April 20, but that vomiting and intoxication are more common reasons than car crash injuries. Still, he said the study offers an important message. \"We think about cannabis as being ubiquitous in our society,\" he said. \"However we need to realize that people should not be using this and driving.\"", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2018/01/02/outrage-grows-over-cnns-pot-infused-new-years-segment.html", "domain": "foxnews.com", "title": "Outrage grows over CNN's pot-infused New Year's segment", "authors": ["Brian Flood"], "publish_date": "01-02-2018", "text": "Outrage continues to mount two days after CNN put the J in journalism with a marijuana-themed New Years Eve segment that some are already using as an excuse to smoke the Hippie Lettuce in states where its not currently legal. During the liberal cable news networks year-end broadcast from Times Square, reporter Randi Kaye did several, um, hits from Denver, where marijuana is legal. At various points, she held a joint, lit a bong, marveled over a special gas mask used by stoners and wondered where she was. Kaye didnt partake herself while on the air, but the bit was enough to appall some viewers and confuse people who might be locked up for doing the same thing. CNN is trying to trademark the debauchery as its brand for New Year's Eve coverage. I mean that quite seriously, Media Research Center President Brent Bozellsaid on Tuesday, while explaining that the network no longer has comic Kathy Griffin using obscenities to attract viewers. (Griffinwas famously fired after she posed with a fake decapitated head made to look like that of President Donald Trump.) So this year they're doing pot and getting stoned, Bozellsaid. For much of the morning on Tuesday, The Drudge Report led its site with a story headlined: CNNs stoner new year! Bong lessons on news network.\" Meanwhile, TheBlaze spent a segment of Glenn Becks radio program breaking down the pot-themed report. CNN showed America how to do bong hits. Isnt that great? It was very helpful, especially if your kids are watching, host Pat Gray said. And on New Year's Day, XXX host Laura Ingraham tweeted: Well see how this all works out for our country. More potheads, increase in cases of schizophrenia, psychosis, more impaired driving ... as #BigWeed makes billions. The story took another turn on Tuesday when WSB-TV reporter Tyisha Fernandes tweeted that 70 people were arrested when less than an ounce of marijuana was found at a house party. Since nobody claimed it, the police arrested everyone. Many people took to Twitter to point out what they described as hypocrisy between Fernandes report and what CNN had advocated on New Years Eve. But yet CNN just did their whole New Years Eve coverage on a Weed Party Bus, one user wrote , while another added , They smoking weed on CNN tho. Fernandes news also sparked an onslaught of people bringing race into the situation, implying that only white people are allowed to smoke pot.", "summary": null}
{"url": "https://www.foxnews.com/health/california-doctor-license-revoked-prescribing-pot-cookies-to-treat-boys-temper-tantrums", "domain": "foxnews.com", "title": "Doctor who prescribed pot cookies to 4-year-old for 'temper tantrums' gets license revoked over diagnosis", "authors": ["Madeline Farber"], "publish_date": "01-30-2019", "text": "The Medical Board of California has revoked the license of a doctor in Los Angeles who told a father to give marijuana cookies to his son as a way to treat the boys temper tantrums. The doctor, William S. Eidelman a natural medicine physician, according to his website made the recommendation in September 2012, according to the board. However, the board made the decision to revoke the doctors license in December. Eidelman made the recommendation after the father, who has not been identified, brought his then 4-year-old son to see the doctor because his son had episodes of uncontrollable behavior and temper tantrums which was causing the boy trouble at school, according to the state medical board's decision . After Eidelman met with the pair for roughly 20 or 30 minutes, he diagnosed the boy with a probable combination of Attention Deficit Hyperactivity Disorder ( ADHD ) and Bipolar Disorder before recommending the father give his son small quantities of cannabis in cookies, the board wrote. Its important to note the board did not revoke his license because he recommended giving marijuana to a small child.In fact,\"it has not been established, by clear and convincing evidence, that the recommendation of medical marijuana to [the boy], with his father's consent, violated the standard of care,\" the board's decision states. Rather, the medical board said the doctor committed gross negligence\" becauseEidelman during the appointment with the 4-year-old and his father did not observe the boy having a temper tantrum or uncontrollable behavior. He also did not contact the boys school for more information on his alleged behavior, nor did he obtain any medical records for the boy or refer him to a psychiatrist for a proper diagnosis, among other reported missteps. Eidelman also relied on family history to make his diagnosis, which the board in its decision saidis not itself a symptom of either condition. The board began to investigate Eidelman after the boys school became aware that the child was being given cannabis. The boys father reportedly asked a nurse at the school to give his son another marijuana-laced cookie during lunchtime because his son was misbehaving that day. The San Bernardino County Sheriff's Office and child protective services were subsequently notified, which sparked an investigation. This later led the medical boards review. On his website, Eidelman who was previously placed on probation in 2004 after giving marijuana prescriptions to undercover police officerswithout a proper reason, according to documents said he is appealing the boards decision. He also asked his patients to write letters to the California Medical Board on his behalf. While the boards revocation of his license was effective as of Jan. 4, Eidelman is continuing to practice at this time because a San Francisco County Superior Court judge issued a stay of the revocation pending his appeal, he wrote. Documents filed in The Superior Court of California Tuesday show the temporary stay was granted. From the beginning of my career, Ive been looking for things that really worked and werent toxic. And cannabis really works, Eidelman told The Los Angeles Times of his decision to recommend marijuana as a treatment, adding he has written more than 10,000 letters recommending cannabis to patients over the last 20 years. In a statement to XXX on Wednesday, Eidelman said he is \"confident he will prevail\" in the hearing, which is scheduled for March 12. The whole prosecution was wrong from the first step of the investigation to the abuses of discretion by the Administrative Law Judge, Eidelman said. \"I am confident I will prevail in the hearing.\"", "summary": null}
{"url": "https://www.foxnews.com/health/can-you-use-medical-marijuana-if-youre-a-diabetic", "domain": "foxnews.com", "title": "Can you use medical marijuana if you’re a diabetic?", "authors": ["Dr. Manny Alvarez"], "publish_date": "01-22-2019", "text": "Last year, the FDA recognized a new drug for epilepsy made from marijuanas own CBD, otherwise known as cannabidiol . That means the marijuana plant may have a confirmed medical use after all. So what about medical marijuana and diabetes? Can diabetics use the drug to help their condition or safely use it for pleasure? As more states legalize medical marijuana, people with all kinds of diseases are wondering this same question. However, diabetics are left reading between the lines of existing studies to make a conclusion. The short answer: experts dont know for sure. People with diabetes can discuss how to safely use medical marijuana with their doctors. However, the research is slim and sometimes opposing on whether the drug actually helps diabetes. One large study published in The American Journal of Medicine points to positive benefits for diabetes. The study was conducted on over 4,600 participants using the National Health and Nutrition Examination Survey(NHANES) survey. Of those participating, about 580 used marijuana regularly and over 1,900 had used it in the past. Interestingly, researchers found that using marijuana was associated with a lower fasting insulin level and a smaller waist size. A review published in the Natural Medicine Journal also highlighted positive outcomes. The review cited the NHANES study as well as several mice models that suggest cannabis protected mice from getting diabetes or reduced its severity. The review also pointed out a study in Israel that revealed a low dose of THC, well below its psychoactive capabilities, could protect the body against organ damage. But there are studies showing negative effects too. One such study published by the American Diabetes Association showed that marijuana users tended to consume about 20 percent more food, eat a lesser quality diet involving simple carbs, have higher blood pressure and have a higher percentage of visceral fat. All of these markers could exacerbate diabetes risk. To balance these findings, though, the same study did find that marijuana users had lower overall fat content and a lower BMI. Other possible (largely unproven) benefits of medical marijuana that many cannabis advocates commonly highlight: Reducing anxiety, Reducing pain and inflammation, Slowing cancer growth, Muscle relaxant, which could be helpful for multiple sclerosis, Controlling side effects of chemotherapy, such as nausea and vomiting. Officially, the National Institute on Drug Abuse states that not enough large-scale studies have been conducted to provide definitive answers about medical marijuana. One thing is certain, though: In light of the new wave of cannabis interest, this is a field of study researchers cannot overlook. The difficult task is to conduct such research under available laws, which prohibit the use and study of marijuana by the federal government. Researchers will need to take care to go the proper pathways so that more research can become available and recognized.", "summary": null}
