{"url": "http://www.foxnews.com/entertainment/2009/04/08/cops-pot-farm-bedroom-harry-potter-star/", "domain": "foxnews.com", "title": "Cops Find Pot Farm in Bedroom of 'Harry Potter' Star", "authors": ["The Sun"], "publish_date": "04-08-2009", "text": "A teenage star of the Harry Potter films has been arrested after cops found a cannabis farm worth more than $2,900 in his bedroom. print email share recommend A teenage star of the Harry Potter films has been arrested after cops found a cannabis farm worth more than $2,900 in his bedroom. Drug squad officers swooped on 19-year-old Jamie Waylett famed as bullying Hogwarts School pupil Vincent Crabbe in the wizard movies after a tip-off. Police first stopped him in an Audi car and discovered eight bags of pot inside the vehicle. Waylett and a pal in the vehicle, also 19, were held at the scene on suspicion of possession. Cops then raided the home the actor shares with his mom Theresa, two brothers and a sister and seized ten mature cannabis plants valued at about $2,900. The plants were growing under powerful hydroponic lights beside the actors DJ decks and a PlayStation. Waylett was further arrested on suspicion of production of a Class B drug.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2009/07/08/harry-potter-star-face-years-growing-marijuana-farm/", "domain": "foxnews.com", "title": "'Harry Potter' Star Could Face 14 Years for Growing Marijuana Farm", "authors": ["Fox News"], "publish_date": "07-08-2009", "text": "Harry Potter star Jamie Waylett has been charged with growing ten cannabis plants. The 19-year-old actor will have to appear in court later this month for the charges stemming from an April arrest. Waylett, who plays Potter bully Vincent Crabbe, was busted when cops pulled over his vehicle in London and allegedly found eight bags of marijuana. He was taken to a nearby police station before a team of officers raided his mothers home in Camden, the Daily Telegraph reports. A Metropolitan police spokeswoman said the actor would appear in court late this month and is charged with producing a Class B drug, nearly ten plants of cannabis. The plants valued at more than $3,000 were allegedly found among DJ equipment and a Playstation, the Telegraph said. Waylett may face up to 14 years for cannabis production, while the maximum charge for cannabis possession is five years.", "summary": null}
{"url": "http://www.foxnews.com/politics/2009/02/07/obama-change-medical-marijuana-policy/", "domain": "foxnews.com", "title": "Obama May Change Medical Marijuana Policy", "authors": ["Devlin Barrett"], "publish_date": "02-07-2009", "text": "The White House won't say it explicitly. Neither will the Drug Enforcement Administration. Yet there is a whiff in the air that U.S. policy is about to change when it comes to medical marijuana. The message is clear, said UCLA professor Mark Kleiman, a former Justice Department official and an expert on crime and drug policy. \"It is no longer federal policy to beat up on hippies,\" said Kleiman. Tell that to the DEA. In California this past week, agents raided four dispensaries in Los Angeles and seized 500 pounds (225 kilograms) of pot. \"It's a little bit surprising, because I think current DEA management didn't get the message,\" said Kleiman. \"The message is, this is no longer drug warrior time. We are not on a cultural crusade against pot-smoking.\" California law permits the sale of marijuana for medical purposes, though it is still against federal law. Thirteen states have laws permitting medicinal use of marijuana. California is unique among them for the presence of dispensaries, businesses that sell marijuana and even advertise their services. Legal under California law, such dispensaries are still illegal under federal law. \"Anyone possessing, distributing or cultivating marijuana for any reason is in violation of federal law,\" Sarah Pullen, a DEA spokeswoman in Los Angeles, said Thursday. That may be the law, but it contradicts the medical marijuana position of the new president. \"The president believes that federal resources should not be used to circumvent state laws, and as he continues to appoint senior leadership to fill out the ranks of the federal government, he expects them to review their policies with that in mind,\" said White House spokesman Nick Shapiro, repeating past statements. So on Friday, DEA officials in Washington declined to comment at all on the subject. As a presidential candidate, Obama repeatedly promised a change in federal drug policy in situations where state laws allow use of medical marijuana. \"I think the basic concept of using medical marijuana for the same purposes and with the same controls as other drugs prescribed by doctors, I think that's entirely appropriate,\" Obama told the Mail Tribune of Medford, Oregon, in March. A year earlier at a campaign stop in New Hampshire, Obama said: \"I would not have the Justice Department prosecuting and raiding medical marijuana users.\" At age 47, Obama is part of a generation that had plenty of exposure to pot. In his memoir, \"Dreams from My Father,\" he described time spent as a youth struggling with questions about his race and identity, and turning to drugs -- including marijuana and cocaine -- to \"push questions of who I was out of my mind.\" The new president is unlikely to make any official change in policy before he has a new DEA chief and drug czar in place. Yet experts believe it is already clear the Obama administration will change the strategy, if not the law, on medical marijuana. Philip Heymann, a former deputy attorney general in the Clinton administration who is now a Harvard professor, said it's time for the agency to put more effort into fighting drugs more dangerous than marijuana. \"I do expect him to appoint an administrator who takes marijuana less seriously than is traditional for the DEA, as I think most Americans do,\" said Heymann. Heymann said he expects the Obama administration will eventually instruct the DEA to emphatically scale back raids on dispensaries, and conduct such raids only in instances where investigators believe a business is abusing the dispensary system as a cover for other criminal behavior. So last week's raids in California may be the last of their kind. \"The DEA's not likely to want to confront a new president,\" said Heymann. \"It may simply be that they're behaving as they have traditionally, and they haven't anticipated the change Obama and his spokesman are signaling.\"", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2011/12/29/blair-witch-star-heather-donahue-chronicles-second-career-growing-pot-in-new/", "domain": "foxnews.com", "title": "'Blair Witch' Star Heather Donahue Chronicles Second Career - Growing Pot - in New Book", "authors": ["Jo Piazza"], "publish_date": "12-29-2011", "text": "Seven years after the low budget horror film The Blair Witch Project became a global phenomenon, the movies star, Heather Donahue, decided she had enough of acting and the Hollywood hamster wheel. Her near-decade spent in a Blair Witch haze led her through a myriad of sci-fi and horror film casting that left her disillusioned with the way the movie industry works. I was doing a movie called The Morgue and laying on the asphalt with rubber tubing across my face and I had the epiphany I did not want to be an actress anymore, Donahue told XXX. I wasnt getting to do projects I was proud of. So she took all her head shots and sexy Hollywood clothes into the desert and burned them in a bonfire. Then she began a second career growing pot. Donahues life as a pot grower in Northern California is chronicled in her new book \"GrowGirl: How My Life After 'The Blair Witch Project' Went to Pot,\" which hits shelves Jan. 5. It tells her tale of moving to a small town, living on a commune and growing medicinal marijuana. And as the end of her relationship with Hollywood did, her relationship with marijuana began with mixed emotions. I dated a stoner for 10 years and I had a pretty ambivalent relationship to pot because of that. But then I realized that it wasnt the plant that wasnt working, it was him, said Donahue, who had previously only used marijuana to relieve menstrual cramps. Once I got into it I became so impressed with growing these plants. Theyre amazingly strong plants. Her family from suburban Pennsylvania took longer to fall in love with the idea of their daughter growing marijuana. They were not very excited about it at first, Donahue said. I think for the safety reasons more than anything else. Plus they raised us with the classic American ethic of working hard, dreaming big and being successful, but that changed when my dad lost his job and they started to realize that for my generation, being American was very different, and we were going to have to find a different way. Donahue describes her life in the backwoods of California as idyllic and slow-paced. Absolutely nothing like the drama imagined on the Showtime show Weeds,\" which follows a pot-growing and dealing family. My life was so much simpler than the show Weeds. It was much more wholesome country living. But I think that is difficult for some people to grasp, Donahue said. But it was really just growing a plant. It isnt that much different from growing radishes or kale. I definitely didnt have that level of drama in my life. Still, most marijuana growers are men, which presented its own challenges. I had to figure out how to negotiate as a woman in a mans world, Donahue says. So now that she has written a book and is back in the public eye, will Donahue return to the rat race she left behind? Absolutely not, Donahue said. Being an actress was hard enough in my twenties. I am 38 years old now and wild horses couldnt drag me back there. I keep thinking it might be nice to write for television. Dont those people get paid really well?", "summary": null}
{"url": "http://www.foxnews.com/health/2009/02/09/great-medical-marijuana-debate/", "domain": "foxnews.com", "title": "The Great Medical Marijuana Debate", "authors": [], "publish_date": "02-09-2009", "text": "It seems that the medical marijuana movement is on the move! After years of difficult encounters with state and federal legislation to get approval on a nationwide level, stories about the benefits of medical marijuana have been overwhelming the news cycles. A recent story from Harvard declared that one of the active ingredients in marijuana cut tumor growth in common lung cancer in animals. I read another story that found marijuana use in the Seattle-area increased rates of testicular cancer . It seems science is all over the place, but many states are trying to amend their local laws in an effort to legitimize medical marijuana use among people that have medical necessity. So I wonder how our new administration will tackle the issue. Are we going to see national guidelines for proper indication based on real science? Or are we going to end up with the same system we have today, which seems to be an unregulated service with poor checks and balances? Certainly one thing that cannot be tolerated is for the federal government to look the other way. The medical community should have a strong voice, not only in science, but in the way the system will operate, since it is they who will most likely be responsible for any hiccups along the way. Patients who have legitimate medical needs should also be heard so the system doesn't become polluted with people trying to take advantage of the availability of medical marijuana.", "summary": "FoxNews.com"}
{"url": "http://www.foxnews.com/health/2011/02/08/smoking-pot-hasten-onset-mental-illness/", "domain": "foxnews.com", "title": "Smoking Pot May Hasten Onset of Mental Illness", "authors": ["Reuters"], "publish_date": "02-08-2011", "text": "Smoking marijuana has been linked with an increased risk of mental illness, and now researchers say that when pot smokers do become mentally ill, the disease starts earlier than it would if they didn't smoke pot. This means that serious psychiatric diseases that might not have shown up until kids were in their teens or twenties - or might never had developed at all are starting in children as young as 12 who smoke marijuana. The link between using pot and developing serious mental illness is strongest in the youngest smokers,12 to 15-year-olds, or kids even younger, said Dr. Matthew Large in an interview with Reuters Health. \"We have to (tell) people who have marijuana in their pockets not to give it to younger people,\" said Large, who headed up the research at the University of New South Wales in Sydney, Australia . Large and his colleagues looked at thousands of patients with psychotic disorders like schizophrenia . People with psychotic disorders lose touch with reality usually starting in adolescence or young adulthood. The authors of the new study found that in the subjects who had been pot smokers, the psychotic symptoms began nearly 3 years earlier than in those who had not been marijuana users. People with schizophrenia often have hallucinations (they see things that aren't there) and delusions (they're often convinced something improbable is true, when it isn't); they also tend to have unusual or bizarre behavior, social problems, and general difficulty in coping with life. According to the National Institute of Mental Health, approximately 2.4 million American adults,or about one in every 100 people over age 18, have schizophrenia. The vast majority of young people who use marijuana don't develop psychosis. And so far, no one's been able to prove that smoking marijuana actually causes psychotic disorders like schizophrenia, but the new research adds to \"growing evidence\" that it does, at least in some people, said Dr. Michael T. Compton at George Washington University Medical Center in Washington, DC, who worked on the study. A number of studies had already suggested that people develop schizophrenia at a younger age if they've been using pot - even if they weren't heavy users but not all researchers agreed. To get a better sense of the evidence, Large and Compton and their colleagues systematically combined and analyzed data from 83 studies involving more than 22,000 people with psychotic disorders like schizophrenia: 8,167 who used marijuana or other substances, and 14,352 who did not. \"Those who used marijuana had an earlier age at onset of the disorder, by (about 32 months) on average, than those who had not used marijuana,\" Compton said in e-mail to Reuters Health. Why was there disagreement in the past over whether this effect really exists? The reasons lie in the way the individual studies might have been done, the researchers say in their article, published in the Archives of General Psychiatry. In their larger analysis, they made sure to account for several factors that authors of the individual studies might not have considered. For example, psychosis develops earlier in boys than in girls - but Large and Compton found that even when they adjusted for that difference, the pot smokers still developed psychotic symptoms earlier. Also, older people are less likely to be smoking pot than younger patients, so if the individual studies had different proportions of various age groups, the results might have been skewed. Taking that factor into account, the researchers still found that marijuana users developed mental illness at a younger age. They also tried to see whether their findings could be explained by the year the research was done (because pot may have become more potent over time), whether the research had been done according to good scientific principles, and whether the investigators had defined the start of mental illness according to the date it was diagnosed instead of the date the symptoms started (the date symptoms started is more accurate). But they kept coming back to the same result: people with psychotic disorders who smoked marijuana had symptoms of mental illness at a younger age than those who didn't use pot. The researchers did not look at whether family history of psychosis played a role in determining who was most vulnerable to marijuana's apparent early-triggering effect. Are there some kids who are more at risk of psychosis from smoking pot than others? \"I'm sure there are,\" Large said. Kids with a family history of psychosis, or those with some psychotic symptoms but not full-blown schizophrenia are at particular risk, he said. But also at risk are kids who are struggling, not doing well at school or living in bad situations at home. One study found that compared to people who didn't use marijuana, people over 18 who did use it had twice the risk of mental illness, but kids under 15 had five times the risk, Large said. There are two main messages to take away from this work, Large said. One is that there's probably something in marijuana that triggers schizophrenia. What that is, isn't clear yet. \"Schizophrenia is still a mystery,\" he said. \"Psychotic illnesses are horrible for the people who have them, and terrible for their families too.\" The second message is far more important, he believes. Public health campaigns on the dangers of marijuana are focusing on older users, Large said, and overlooking the pre-teens and young adolescents who get their pot from older peers and even older siblings at home. \"Even if the onset of psychosis were inevitable (for a particular individual),\" Large's team writes, \"an extra 2 or 3 years of psychosis-free functioning could allow many patients to achieve the important developmental milestones\" of adolescence. That extra time could allow a young person to finish school and gain other skills that might reduce the lifelong disability that so often accompanies mental illnesses. Whereas most studies like his are presented at medical conferences, Large said he's not going to bother traveling around to announce his results to other doctors. Instead, he said, he wants to talk about his results in public forums. \"I'm not a marketing expert,\" he said, \"but we have to find a way to tell young kids to hold off.\" We might not be able to convince them to never use pot, he added, but they need to wait until they're older. A message, he acknowledged, that will be tricky to deliver.", "summary": null}
{"url": "http://www.foxnews.com/health/2011/02/11/pot-use-mellow-mens-sexual-function/", "domain": "foxnews.com", "title": "Pot Use May Mellow Out Men's Sexual Function", "authors": ["LiveScience"], "publish_date": "02-11-2011", "text": "Marijuana users sometimes report that pot enhances their desire for sex. But a new review of research on marijuana and sexual health suggests that male smokers could be courting sexual dysfunction. Research on the topic is contradictory and few studies are high-quality, said study researcher Rany Shamloul, a physician with appointments at the University of Ottawa and Queen's University in Canada as well as the University of Cairo. But recent research including the finding that the penis contains receptors for marijuana's active ingredient suggests that young men may want to think about long-term effects before rolling a joint, Shamloul told LiveScience. \"It's a strong message to our younger generations and younger men,\" Shamloul said. Shamloul reported his findings online Jan. 26 in the Journal of Sexual Medicine. Sex and drugs Scientists first began to study marijuana and sex in the 1970s. Some researchers found that cannabis seemed to have the effect of a love drug; in one 1982 study published in the Journal of Psychoactive Drugs, 75 percent of male pot smokers said the drug enhanced their sex lives. Meanwhile, another study published in the same journal the same year found that erectile dysfunction was twice as common in marijuana users not such good news for lit lotharios. Other research suggests a dose effect, in which small amounts of marijuana have little impact on sexual dysfunction, but more marijuana makes for fewer erections . But problems are rife with this research, Shamloul said, because none of the studies used validated measurement techniques when surveying men about their sexual function. The different questions used could skew the responses, as could the drug itself, he noted in the review. The 39 percent of men in the original 1982 study who said marijuana extended the duration of sex may just have been experiencing the drug's altering effects on the perception of time. What most concerns Shamloul is a study published in 2010 in the journal European Urology. In that study, researchers found receptors for tetrahydrocannabinol (THC), the active ingredient in marijuana, in penis tissue from five male patients and six rhesus monkeys. These receptors were mainly in the smooth muscle of the penis, Shamloul said. Additional lab studies suggest that THC has an inhibitory effect on the muscle. \"This is a more serious effect on the erectile function because the smooth muscle makes up 70 percent to 80 percent of the penis itself,\" Shamloul said. Men and marijuana Marijuana use is widespread, especially among men at their sexual peak in life , Shamloul said. The United Nations Office on Drugs and Crime reports that 162 million people worldwide use marijuana each year. More than 22 million use it daily. That makes understanding long-term effects important, Shamloul said. People tend to focus on the possible upsides of marijuana more than the possible downsides, said Sharon Johnson, a professor of social work at the University of Missouri, St. Louis, who has studied marijuana use and sexual health in the past. Her study, published in 2004 in the journal Archives of Sexual Behavior, found that marijuana users have a slightly elevated risk of inhibited orgasms and pain during sex. (Johnson was not involved in Shamloul's review study.) Research on sexual health and marijuana use in women is even less common than studies in men, Shamloul said. \"What we are really missing are clinical studies,\" Shamloul said. \"We are stuck with only animal studies and molecular studies, and some clinical studies done in the '60s and '70s, most on a very small number of men We need well-designed, placebo-control studies examining marijuana's effect in both the short-term and long-term.\"", "summary": null}
{"url": "http://www.foxnews.com/health/2011/05/05/dad-claims-marijuana-helped-3-year-old-son-beat-cancer/", "domain": "foxnews.com", "title": "Dad Claims Marijuana Helped 3-Year-Old Son Beat Cancer", "authors": ["Karlie Pouliot"], "publish_date": "05-05-2011", "text": "Cash was diagnosed with a PNET brain tumor at 20-months-old. He spent nine months in the hospital. A father from Montana claims his 3-year-old son, who was battling brain cancer, is alive today partly due to marijuana oil, which he gave him during the boy's nine-month stay in a Salt Lake City hospital. Mike Hyde said he fed his son Cash the oil through his gastrostomy tube (or G-tube) without doctors' knowledge to ease his pain while the toddler was going through chemotherapy treatments. After his first round of high-dose chemo in August 2010, he no longer ate anything, and this went on through September, Hyde told XXX. He was getting worse and worse. This harrowing ordeal started for the Hyde family in May of last year when radiologists at Community Medical Center in Missoula, Mont., discovered a stage 4 brain tumor when Cash was just 20-months-old. Shortly after, the toddler was transported to Primary Childrens Hospital in Salt Lake City, Utah, where he was placed in the intensive care unit. Cash, or Cashy as his dad likes to call him, was eventually diagnosed with a primitive neuroectodermal tumor (PNET), which is a malignant tumor of the central nervous system that spreads easily, and is usually found in infants, children and young adults. The oncologist recommended that Cashy receive three cycles of chemotherapy followed by three cycles of high-dose chemotherapy with stem cell rescue, Hyde said. Cash underwent the therapy, but the results were heartbreaking for his mom and dad, and it was at this point that they decided to step in. By the end of September he was so sick, Hyde said. He was no longer was able to take feedings into his G-tube. His stomach lining was burnt from the chemo therapy, it was no longer processing anything it was fried. I asked doctors if there was anything else we can give him and they said Were giving him max amounts of all anti-nausea medications we can give him. They basically told me that this was as good as it was going to get. I told them that it was unacceptable. At this point, Hyde decided to pull Cash off the anti-nausea drug cocktail due to numerous side effects, and at the same time, he decided to start administering .3 milligrams of marijuana oil through his sons G-tube. I put him on the oil and he started eating again, his quality of life completely changed, and we were told it was a miracle that it was just amazing. He was sitting up and laughing again, he said. But Cash took a turn for the worse after his sixth round of chemotherapy. He went into septic shock, he had a stroke and suffered pulmonary hemorrhaging all at the same time. Doctors told us he was not going to make it, Hyde recalled. He was on life support for 40 days and was in a medically-induced coma. They said he would have brain damage and his lungs would fail. But I knew the medicine (marijuana oil) was in his body, and that helped him heal. It helped to rebuild his stomach lining, his liver and his lungs. He walked out of the ICU in mid-December. The nurses and doctors called him a Christmas miracle. Cash, now 3, was finally released from the hospital at the end of January and his prognosis looks excellent. Two weeks ago, he went for a check-up, and doctors didnt even recognize him. They were amazed, Hyde said. The brain scans were amazing, his tumor is gone and his liver and kidneys are 100 percent healed. He should be on dialysis, but hes running around. And while Hyde acknowledges that chemo killed the cancer, he said it almost killed his son in the process. It brought him to the edge of life, and if I wouldnt have stepped in when I did, he wouldnt be here right now. The marijuana oil was the best pain drug available for Cashy, as well as a neuro-protectant, antioxidant and antibacterial. I know it saves Cashs life. Medical marijuana is legal in some U.S. states, including Montana, but is illegal to possess it without authorization from a medical professional. Hyde was able to get the oil for his son through a medical marijuana card that was issued by the state of Montana in Cashs name. Marijuana has been widely used to treat cancer patients suffering from chemotherapy-inducing nausea and vomiting.", "summary": null}
{"url": "http://www.foxnews.com/health/2011/12/14/survey-teen-smoking-at-historic-lows-but-marijuana-use-high/", "domain": "foxnews.com", "title": "Survey: Teen Smoking at Historic Lows But Marijuana Use High", "authors": ["Reuters"], "publish_date": "12-14-2011", "text": "Cigarette and alcohol use among teens is at the lowest level in decades, but marijuana use is on the rise, according to a survey released on Wednesday. Just under 19 percent of high school seniors said they smoked cigarettes in the past month compared to a peak rate of 36.5 percent in the mid-1990s, results from the National Institutes of Health Monitoring the Future survey showed. SUMMARY Although alcohol remains popular among teens, rates of underage and binge drinking showed significant declines Cigarette and alcohol usages by teens are at the lowest points since the first survey was taken in 1975 Marijuana use among teens rose in 2011 for the fourth straight year, and daily marijuana use is at a 30-year peak level among high schoolers Rates of cigarette smoking among all teens surveyed decreased compared to last year's results. Researchers said 100 percent smoke-free locations and higher cigarette prices helped drive down the number of teen smokers. Although alcohol remains popular among teens, rates of underage and binge drinking showed significant declines, researchers said. Overall, cigarette and alcohol usages by teens are at the lowest points since the first survey was taken in 1975. Marijuana use among teens rose in 2011 for the fourth straight year -- a sharp contrast to a dramatic decline that occurred in the preceding decade. Daily marijuana use is at a 30-year peak level among high school seniors, the survey found. Monitoring the Future is an annual survey of eighth, 10th and 12th graders conducted by researchers at the University of Michigan with funding from the National Institute on Drug Abuse. Nearly 47,000 students from 400 public and private schools were polled in classrooms earlier this year. Among 12th graders, 36.4 percent said they smoked marijuana in the past year and 6.6 percent reported daily use, it found. The 2011 survey for the first time included questions about use of synthetic marijuana, a blend of herbs and spices laced with chemicals and commonly branded Spice or K2. More than 11 percent of high school seniors reported using the synthetic substance in the past year, it found. Until recently, K2 and Spice were sold legally online, in gas stations and other shops. Earlier this year federal regulators banned some of the synthetic chemicals. Next year researchers said they expect to ask questions about bath salts, an increasingly popular street drug that mimics the effects of drugs like LSD or cocaine. Monitoring the Future is one of three major surveys used by federal health officials to monitor data on youth substance abuse.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2011/12/08/weed-wars-goes-inside-medical-marijuana-dispensary/", "domain": "foxnews.com", "title": "'Weed Wars' Goes Inside Medical Marijuana Dispensary", "authors": ["Hollie McKay"], "publish_date": "12-08-2011", "text": "The issue of legal medical marijuana isnt disappearing in a cloud of smoke, as Discovery Channels Weed Wars proves. The four-part series premiering Thursday goes inside controversial business of medical cannabis by following Oaklands Harborside Health Center, the nations largest medicinal cannabis dispensary, serving over 94,000 patients. The man behind the pot-centric business is Steve DeAngelo, who hopes that the show will educate Americans on the regulation, taxation and sale of medicinal cannabis. We wanted to be a model to other dispensaries, most of who have a media phobia. We wanted to tell our story and we gave Discovery complete access so that people could make up their own minds, DeAngelo told XXX Pop Tarts column. There are a lot of stereotypes about who comes to these dispensaries, but viewers will see our customers cover a huge cross-section of the population age, race and economic classes. They will also see how Harborside treats cannabis as a medicine, and we have a high standard of medical care. Although laced with Cheech and Chong-like stoner humor, Weed Warsalso documents the journey of the plant itself from germination to harvesting, spolighting the serious side of treating medical ailments, and why it shouldnt be used for party purposes. We cater to people with chronic pain, insomnia , depression and anxiety. We also have people come in that have brain tumors, MS, or cerebral palsy . Cannabis should be a frontline treatment before progressing on to more dangerous medications, DeAngelo continued. Personally, I dont advocate recreational marijuana use, but criminal prosecution for cannabis use is wrong too. We should tax it and regulate it like we do other substances. DeAngelo also stressed how the medical pot industry contributes to the economy and keeps communities safer. Harborside alone employees 120 people who all get paid a wage, health insurance and time off, and we are one of the top 10 tax payers in Oakland. Without the medical marijuana industry, billions of dollars in tax revenue would be eliminated, he said. So would you rather all the users purchase it from a safe place that is inspected and regulated? Or be forced to buy it illegally off-the-streets where the money goes back to gangs and Mexican drug cartels? Not everyone is quite so willing to hang a halo over the head of a joint. People abuse marijuana.Marijuana is an illegal drug according to the Drug Enforcement Agency, Beverly Hills-based addiction specialist Marty Brenner told us. The downside of addiction is that is harms your body in so many different ways. It impacts a number of things the ability to think probably, your bone density, and your liver.", "summary": null}
{"url": "http://www.foxnews.com/health/2008/05/09/new-report-links-teens-depression-marijuana-mental-illness-suicidal-thoughts/", "domain": "foxnews.com", "title": "New Report Links Teens, Depression and Marijuana to Mental Illness, Suicidal Thoughts", "authors": ["Fox News"], "publish_date": "05-09-2008", "text": "Depression, teens and marijuana are a dangerous mix that can lead to dependency, mental illness or suicidal thoughts, according to a White House report being released Friday. A teen who has been depressed at some point in the past year is more than twice as likely to have used marijuana as teens who have not reported being depressed - 25 percent compared with 12 percent, said the report by the White House Office of National Drug Control Policy.", "summary": null}
{"url": "http://www.foxnews.com/health/2010/03/01/long-term-marijuana-use-double-risk-psychosis/", "domain": "foxnews.com", "title": "Long-Term Marijuana Use Can Double Risk of Psychosis", "authors": ["Reuters"], "publish_date": "03-01-2010", "text": "Young people who smoke cannabis or marijuana for six years or more are twice as likely to have psychotic episodes, hallucinations or delusions than people who have never used the drug, scientists said on Monday. The findings adds weight to previous research which linked psychosis with the drug particularly in its most potent form as \"skunk\" and will feed the debate about the level of controls over its use. Despite laws against it, up to 190 million people around the world use cannabis, according to United Nations estimates, equating to about 4 percent of the adult population. John McGrath of the Queensland Brain Institute in Australia studied more than 3,801 men and women born between 1981 and 1984 and followed them up after 21 years to ask about their cannabis use and assessed them for psychotic episodes. Around 18 percent reported using cannabis for three or fewer years, 16 percent for four to five years and 14 percent for six or more years. \"Compared with those who had never used cannabis, young adults who had six or more years since first use of cannabis were twice as likely to develop a non-affective psychosis (such as schizophrenia ),\" McGrath wrote in a study published in the Archives of General Psychiatry journal. They were also four times as likely to have high scores in clinical tests of delusion, he wrote, and a so-called \"dose-response\" relationship showed that the longer the duration since first cannabis use, the higher the risk of psychosis-related symptoms. A study by British scientists last year suggested that people who smoke skunk, a potent form of cannabis, are almost seven times more likely to develop psychotic illnesses such as schizophrenia than those who smoke \"hash\" or cannabis resin. Previous studies had also suggested smoking cannabis can double the risk of psychosis, but the British study was the first to look specifically at skunk. Skunk has higher amounts of the psychoactive ingredient THC which can produce psychotic symptoms such as hallucinations, delusions and paranoia. McGrath said, however, that \"the nature of the relationship between psychosis and cannabis use is by no means simple\" and more research was needed to examine the mechanisms at work. As part of his study, McGrath and his team looked at links between cannabis use and psychotic symptoms among a group of 228 sibling pairs and found the association still held. This suggests other influences like genes or the environment were less likely to be responsible for the psychosis, they said. A international group of drug policy experts published a book earlier this year arguing that laws against cannabis have failed to cut its use but instead led to vast numbers of arrests for drug possession in countries like Britain , Switzerland and the United States , which cause social division and pointless government expense.", "summary": null}
{"url": "http://www.foxnews.com/health/2010/03/10/cannabis-deficient/", "domain": "foxnews.com", "title": "Marijuana Compound Treats Multiple Health Issues", "authors": ["Chris Kilham"], "publish_date": "04-20-2010", "text": "Today is known as National Marijuana Day or 4/20and if the idea of having a marijuana deficiency sounds laughable to you, a growing body of science points at exactly such a possibility. Scientists have known that the active psychoactive compound in marijuana is THC, which is short for tetrahydrocannabinol. In August 1990, researchers reported in the journal Nature the discovery of receptors in the brain that specifically accommodate the cannabinoids in pot. Cannabinoids bind to particular neurological sites in the brain, as though the brain was specifically designed to utilize this plant. Did nature toss cannabinoid receptors into the brain by random chance? Are cannabinoid receptors part of an intelligent design for deriving maximum benefit from cannabis? Is cannabis a divine elixir of sacred communion for which we are ideally suited? Actually, a more sober answer seems likely. When there are receptors in the brain for a particular type of compound, that compound is made in the brain. This is true of many important agents that work to transmit brain messages of all types. So a hunt began to find such a compound. In that vein, in 1992 researchers in Israel isolated the cannabinoid anandamide in the human brain. Unlike THC, anandamide is manufactured in the brain, and is therefore an endogenous cannabinoid. This agent, anandamide, is the compound that attaches to the built-in cannabinoid receptors in our brains. The name anandamide is based on the Sanskrit word ananda, which means bliss. Anandamide is a bliss molcule, enhancing greater well being and emotional satisfaction. Ever since the pioneering work of Dr. William O'Shaughnessy on cannabis and pain compiled in the 1840's a growing body of science has shown that cannabis offers relief for various types of pain. In the brain, the endogenous agent anandamide also plays a role in mitigating inflammation and pain. So both cannabinoids from inside and outside the body play a role in pain reduction. More recent studies show pain relief among sufferers of multiple sclerosis when cannabis is consumed. Anandamide also plays a role in proper appetite, feelings of pleasure and well-being, and memory. Interestingly, cannabis also affects these same functions. Cannabis has been used successfully to treat migraine, fibromyalgia , irritable bowel syndrome and glaucoma . So here is the seventy-four thousand dollar question. Does cannabis simply relieve these diseases to varying degrees, or is cannabis actually a medical replacement in cases of deficient anandamide? At least one author, medical doctor Ethan Russo, believes in the possibility of endocanabinoid deficiency, and suggests that such a deficiency might actually be a significant cause of the types of health problems listed above. His paper \"Clinical Cannabinoid Deficiency,\" published in Neuroendocrinology Letters in 2004, delved deeply into the various ways that cannabinoids function in the body, and how a deficiency in cannabinoids can lead to a broad range of diseases. Since the publication of that paper, a number of studies have further confirmed the effectiveness of cannabis for many health disorders. The idea of clinical cannabinoid deficiency opens the door to cannabis consumption as an effective medical approach to relief of various types of pain, restoration of appetite in cases in which appetite is compromised, improved visual health in cases of glaucoma, and improved sense of well being among patients suffering from a broad variety of mood disorders. As state and local laws mutate and change in favor of greater tolerance, perhaps cannabis will find it's proper place in the home medicine chest.", "summary": null}
{"url": "http://www.foxnews.com/health/2010/10/19/benefits-marijuana/", "domain": "foxnews.com", "title": "The Health Benefits and Risks of Marijuana", "authors": ["Ross Bonander"], "publish_date": "10-19-2010", "text": "The state of California's recent step toward fully decriminalizing the possession of small amounts of marijuana with Prop 19 has reignited one of the more contentious flash points in modern societywhere, if anywhere, marijuana has a place. Few things illustrate the controversy better than a comparison of the web pages that purport to separate myth from fact published by the Drug Enforcement Administration (DEA) and the Drug Policy Alliance (DPA). They are almost mirror images of one another, addressing the very same points, but drawing on different studies to reach their preferred conclusions. It's stunning to see how differently these agencies can interpret the same information. There is a single salvation from this cherry-picking point-counterpoint: the seminal report \"Marijuana and Medicine: Assessing the Science Base.\" This comprehensive summary of marijuana was written in 1999 by the most highly regarded nongovernmental medical organization in the country, the Institute of Medicine, and it serves as the primary source for the information in this article concerning the risks and benefits of marijuana. Health Risk Myths & Realities The essential questions are whether the active ingredient in marijuana, a cannabinoid (chemical compound) known as THC, has any medicinal value; whether the risks associated with its use outweigh the benefits; and whether THC answers a need not currently met by any other medications on the market. In the course of that debate, several health risks are often cited: Marijuana overdose There is no existing evidence of anyone dying of a marijuana overdose, but this doesn't preclude the possibility of experiencing adverse or unpleasant effects when it is consumed in large amounts. For comparison's sake, alcohol overdoses claim approximately 5,000 casualties per year.This is often cited as a reason that marijuana is safer than other drugs, like alcohol. Memory Marijuana does impair short-term memory, but only during intoxication. THC has been shown to have a negative effect on memory, and chronic abuse of marijuana will cause permanent impairment. Addiction The DEA's general opposition to marijuana is comprised of 1) that whatever medical value it has is already fulfilled by other, equally effective drugs on the market, and 2) that marijuana is highly addictive. Both points can be turned upside down: There is already an abundance of drugs that do the same job as products already on the market, and they receive approval anyway. This seems to run contrary to the DEA's first argument. And even a cursory look at many of the Schedule II opiates and amphetamines shows that high addiction potential is not a basis for legal classification of drugs. The point is that marijuana is not physically addictive, and even if it was, the DEA would appear to be quite hypocritical arguing this point. The immune system If smoked marijuana were to inhibit the activity of T-lymphocytes in the blood, it would compromise the body's ability to fight infection. This would put some people at the mercy of opportunistic infections and diseases, notably those who have immunosuppressive conditions like HIV or lymphoma . However, the data does not support this. What it does support -- barely -- is the compromised immunity of the lungs due to the smoke from marijuana. Heart problems It is accepted in medical circles today that marijuana use causes no evident long-term cardiovascular problems for normal persons. The DEA aggressively goes after this point, claiming that according to Harvard researchers, in the hour after having smoked marijuana, one's heart attack risk goes up five fold. However, this 'fact' is not properly cited and is indicative of the DEA's sloppy attempts to cite its sources. Marijuana's effects on blood pressure are complex and inconsistent as of yet. Cancer Is THC considered a carcinogen (cancer-causing) in humans? Not according to the two most esteemed agencies of relevance, the International Agency for Research on Cancer (IARC) and the U.S. National Toxicology Program (NTP). However, the same cannot be said for smoking marijuana, as the smoke from burning marijuana shares an array of dangerous and potentially carcinogenic chemicals with cigarette smoke. The DPA fumbles here, saying \"there have been no reports of lung cancer related solely to marijuana,\" subtly hinting that it's even possible to determine causation for any cancer in the first place. It should be said that although the DPA's information is generally more reliable than the DEAs, it does contain its fair share of porous arguments. The gateway effect Does marijuana use lead to harder drugs? Most long-term studies show that those people who report having tried disparate drugs like cocaine and heroin often share a history of having smoked marijuana. However, the implication that marijuana causes people to try harder drugs is as yet unproven, and indeed it may act as an alternative to more dangerous drugs. Potential benefits No serious proponent of medicinal marijuana would claim it cures anything. Marijuana does, however, treat symptoms -- pain, nausea -- that are caused by a wide range of illnesses. Pain management The receptors in the brain that allow uptake of cannabinoids (like THC) are actually part of the most widespread receptor system in the body. Not only is the body naturally attuned to these molecules, it also uses them to great effect -- numerous studies have established that cannabinoids help reduce pain and other distressing symptoms. Antiemesis Some chemotherapy regimens are notorious for causing terrible bouts of nausea and vomiting, and both THC and marijuana have been explored as antiemetic (antinausea) medication. Smoking marijuana does give the desired effect in a matter of minutes and could, therefore, relieve the symptom quickly. The potential drawback If marijuana becomes fully legalized in plant form and open to commercialization -- a stance largely supported by the National Organization for the Reform of Marijuana Laws (NORML) -- one notoriously vile group of manufacturers is uniquely poised better than any other to take control of the emerging market: Big Tobacco. Having fully established its disinterest in the public health generations ago by the shady promotion of smoking, the idea of Big Tobacco becoming the nation's pot supplier should frighten anyone favoring legalization and regulation. Still much to learn The dearth of useful clinical trial datarandomized, controlled, double-blind trials involving large patient populationsis the biggest hurdle facing marijuana's legitimacy. While numerous smaller tests have been performed that support both sides of the health argument, political and economic reasons will form the primary impetus for the legalization of marijuana. For a state like California, whose budget deficit amounts to billions of dollars, the potential tax revenue from legalized marijuana is a lot of money that is currently going up in smoke.", "summary": null}
{"url": "http://www.foxnews.com/health/2010/11/16/study-early-marijuana-use-increase-brain-damage/print", "domain": "foxnews.com", "title": "Study: Early Marijuana Use May Increase Brain Damage", "authors": ["Fox News"], "publish_date": "11-16-2010", "text": "Smoking marijuana at a young age causes more brain impairment than those who use the drug later in life or not at all, according to a study from McLean Hospital of the Harvard School of Medicine. The small study shows that smoking marijuana before the age of 16 leaves individuals with weakened executive function, such as planning, flexibility and abstract thinking. One of the tests conducted as part of the study included subjects being asked to sort a deck of cards following one set of rules, and then quickly switching to another set of rules without warning. The individuals who started smoking at an early age performed significantly worse than non-users and those who started using marijuana later in life. In other tests, early marijuana users continued to make the same errors repeatedly. The study included 33 young marijuana users and 26 non-users. Previous studies by neuroscientists had shown that those who smoke large amounts of marijuana on a regular basis do not do well on tests of memory and other mental abilities.", "summary": null}
{"url": "http://www.foxnews.com/health/2012/01/13/feds-crack-down-on-colorado-medical-pot-dispensaries/", "domain": "foxnews.com", "title": "Feds crack down on Colorado medical pot dispensaries", "authors": ["Reuters"], "publish_date": "01-13-2012", "text": "U.S. prosecutors in Colorado started a crackdown against nearly two dozen medical marijuana dispensaries located within 1,000 feet of schools, giving the proprietors 45 days to cease operations or face civil and criminal penalties. U.S. Attorney John Walsh issued the ultimatum in letters to 23 dispensaries and landlords he said were in violation of federal and state law, a statement Thursday from the U.S. Justice Department said. The move makes Colorado the latest battleground pitting federal prosecutors against storefront distributors of marijuana in states that have decriminalized marijuana for medical purposes. \"When the voters of Colorado passed the limited medical marijuana amendment in 2000, they could not have anticipated that their vote would be used to justify large marijuana stores located within blocks of our schools,\" Walsh said. He cited a 2011 memo from U.S. Deputy Attorney General James Cole that allows individual federal prosecutors to \"exercise their discretion to handle marijuana trafficking matters.\" The Colorado move followed an announcement in October by federal prosecutors in California that they were cracking down on medical pot dispensaries they said were fronts for large-scale, for-profit drug trafficking. Last March, federal agents also raided greenhouses and dispensaries in 13 cities in Montana cited by authorities as operating illegally under the guise of that state's medical marijuana law. A month later, U.S. attorneys in Washington state issued a legal opinion threatening to prosecute not only dispensary owners and growers but state officials who would have enforced a proposed state licensing system for medical marijuana. Washington Governor Christine Gregoire cited that warning in her decision to veto a bill to establish a new regulatory system for state-sanctioned suppliers of medicinal cannabis. A total of 16 states and the District of Columbia have enacted some sort of legalized medical-marijuana statutes, according to the National Drug Policy Alliance. But cannabis remains classified as an illegal narcotic under federal law, a point Walsh underscored in his letter to Colorado dispensary operators. \"The dispensary is operating in violation of federal law, and the Department of Justice has the authority to enforce the federal law ... even when such activities may be permitted under state law,\" the letter said. Walsh did not identify any of the letter's recipients, except to say the businesses were located throughout the state. Denver lawyer Robert Corry, who represents clients charged with marijuana offenses, said in recent testimony before the Denver City Council that \"there should be no arbitrary distance limits\" for legal marijuana businesses. \"There is no documented case of any child ever purchasing or obtaining medical marijuana from a dispensary,\" he said. Nevertheless, Walsh said law enforcement will be on the lookout for other violators, and offenders could be subject to asset seizure and property forfeitures. \"Those who do not comply will be subject to potential criminal prosecution and civil enforcement actions,\" Walsh said. \"Because the stores are operating within 1,000 feet of a school, enhanced penalties apply under federal law.\"", "summary": null}
{"url": "http://www.foxnews.com/health/2012/03/20/concern-growing-over-synthetic-marijuana/", "domain": "foxnews.com", "title": "Concern growing over synthetic marijuana", "authors": ["Reuters"], "publish_date": "03-20-2012", "text": "Three U.S. teenagers ended up in the emergency department with altered mental states and seriously elevated heart rates after smoking synthetic marijuana, doctors say in a new report that adds to earlier evidence the popular drug can be dangerous. One 16-year-old girl who was brought in by her boyfriend refused to move or speak and did not respond when doctors rubbed her chest hard or pinched her. Although she was lying down, her pulse was 105. She only came back around after getting two kinds of medications -- an anti-anxiety drug and one that's used to treat abnormal movements -- and resting for several hours. While her urine test was positive for THC, one of the active ingredients in natural marijuana, her boyfriend said they had also smoked K2, one of the many names for synthetic marijuana. The drugs were recently banned in the U.S. and the Drug Enforcement Administration has proposed to classify them permanently as schedule 1 controlled substances -- a category that includes heroin and natural marijuana. The synthetic versions are blends of herbs and spices laced with cannabis-like chemicals, and are sold under a variety of names, including Spice, K2 and Red X Dawn. The synthetic drugs are believed to be much stronger than regular pot, however, and the products may include other ingredients, too. \"Because it's unregulated we don't know exactly what's in it,\" said Dr. Joanna Cohen, one of the authors of the new report, which was published Monday in the journal Pediatrics. The two other cases involved both involved teenage boys. One of them, an 18-year-old, was brought to the ER from a party, where he had gotten into an altercation. He was aggressive, agitated and sweating profusely and had a pulse of 131. The other, a 16-year-old, seemed confused and agitated and had trouble speaking. Both teens calmed down after getting an anti-anxiety drug and were discharged from the hospital after a number of hours. Both teens had a negative drug screen, but said they had been smoking synthetic pot, which isn't detectable on standard drug tests. Cohen, an emergency physician at Children's National Medical Center in Washington, D.C., said the three cases described in her report are the only ones she has witnessed personally. But last November, a team of Texas doctors published a report on three 16-year-olds who had experienced heart attacks after smoking synthetic cannabis. And according to Cohen and her colleagues, poison control centers across the country have received 4,500 calls involving the products since 2010. \"If people were getting the effects that they wanted they probably wouldn't be calling the poison control centers,\" she told Reuters Health. \"Anytime your teenager is acting abnormally or having aggressive agitation you should certainly seek medical attention.\"", "summary": null}
{"url": "http://www.foxnews.com/health/2012/03/20/researchers-study-neuroprotective-properties-in-cannabis/", "domain": "foxnews.com", "title": "Researchers study neuroprotective properties in cannabis", "authors": ["Fox News"], "publish_date": "03-20-2012", "text": "With more states opting to legalize the sale of medical marijuana , researchers are taking a closer look at the use of cannabis to treat chronic illnesses. Dr. Manny Alvarez, senior managing health editor of XXX, recently sat down with the Medicine Hunter, Chris Kilham, to find out how its being studied. Dr. Manny: Now from the medical marijuana perspective, as far as the treatment of chronic illnesses, what is it about cannabis that makes it that special? Medicine Hunter: Well, it seems that there are primarily two things there's the THC, that's what people associated with getting high. And that appears to have a saliatory effect on the eyes in case of glaucoma . For people who are suffering from chemotherapy and can't eat, it helps to get their appetite back. And we also know that it is a potent pain reliever and science on that goes back to the 1890s. But theres another agent in cannabis that is getting more attention now, and that is called cannabidiol. And this is something that you can swallow by the bucket-full, and it won't get you high at all. But it appears to have profound nerve-protective and brain-enhancing properties. And interestingly enough, it also induces an anti-anxiety effect. So this appears to be a very important agent, perhaps useful in the treatment of neurodegenerative disorders. DM: Are they extracting that particular chemical off the marijuana? MH: There seem to be two pathways that people are taking. You've got G.W. pharmaceuticals in Britain that has come out with a whole cannabis fluid spray. You've got people also isolating cannabidiol and playing with that in the lab. I don't know how this is all going to settle out I mean, as a whole-plant person, I'm inclined toward the whole extract. But it does appear that this may also have anti-cancer properties, and that's very intriguing. DM: Is marijuana addictive? MH: I would say that people can absolutely become dependent upon it. But not physiologically addictive. And, as you know, that's not just parsing terms I mean physiological addiction, you go through very grave withdrawal. But people can become dependent on it just as they can on any substance. DM: Tell me about this study in the American Journal of Pediatrics talking about pregnant Jamaican women and the use of pot. MH: Melanie Dreher, who is the dean of nursing at Rush Medical Center in Chicago , did a study in Jamaica . It was actually published in the American Journal of Pediatrics in 1994, but now it's re-circulating because of all the interest in the neuroprotective properties. Basically, she studied women during their entire pregnancy, and then studied the babies about a year after birth. And what she studied was a group of women who did smoke cannabis during pregnancy and those who didn't. She expected to see a difference in the babies as far as birth weight and neuro tests, but there was no difference whatsoever. The differences that the researchers did notice, that are unexplained and kind of curious are that the babies of the women who had smoked cannabis -- and we're talking about daily use during their pregnancy -- socialized more quickly, made eye contact more quickly and were easier to engage. We don't know why this is so, but all the old saws of smoking during pregnancy will result in low birth weight did not show up -- at least in the Jamaican study. In U.S. studies where we've seen a similar investigation, women have concurrently been abusing alcohol and other drugs as well. Alvarez said its interesting to note that there may be neuroprotective properties present in cannabis and the cannibidiol extract, but that smoking of any kind in pregnant women is discouraged. More research is needed when it comes to medical marijuana, he added.", "summary": null}
{"url": "http://www.foxnews.com/health/2012/06/08/cdc-more-us-teens-smoke-marijuana-than-cigarettes/", "domain": "foxnews.com", "title": "CDC: More US teens smoke marijuana than cigarettes", "authors": ["Associated Press"], "publish_date": "06-08-2012", "text": "A government survey shows more teens are now smoking pot than cigarettes. The Centers for Disease Control and Prevention reported Thursday that 23 percent of high school students said they recently smoked marijuana, while 18 percent said they had puffed cigarettes. The survey asked teens about a variety of risky behaviors. For decades, the number of teens who smoke has been on the decline. Marijuana use has fluctuated, and recently rose. At times, pot and cigarette smoking were about the same level, but last year marked the first time marijuana use was clearly greater. An earlier survey by the University of Michigan also found that pot smoking was higher. A Michigan expert said teens today apparently see marijuana as less dangerous than cigarettes.", "summary": null}
{"url": "http://www.foxnews.com/health/2012/07/13/one-in-eight-with-fibromyalgia-uses-cannabis-as-medicine/", "domain": "foxnews.com", "title": "One in eight with fibromyalgia uses cannabis as medicine", "authors": ["Reuters"], "publish_date": "07-13-2012", "text": "One in eight people with the painful condition fibromyalgia self-medicate with pot and other cannabis products, according to a new Canadian study. \"That is not unusual behavior, in general, for people with chronic medical illnesses for which we don't have great treatments,\" said Dr. Igor Grant, who heads the Center for Medicinal Cannabis Research at the University of California and was not involved in the study. \"People start looking around, they look for other types of remedies, because they need the help,\" he told Reuters Health. The question is if self-medicating with cannabis is really helpful for people with fibromyalgia, researchers say. Marijuana has been shown to ease certain types of pain in patients with HIV and other conditions. But Grant said he doesn't know of any research showing the drug can relieve the pain associated with fibromyalgia. And the question of whether it helps fibromyalgia sufferers regain some of their daily functions, such as housekeeping or working, remains up in the air, too. \"We don't want to just see pain reduction, but an improvement in function,\" said Peter Ste-Marie, a pain researcher at McGill University in Montreal, who worked on the new study. \"If it's not helping them get back into a daily life pattern, is it helping them?\" People with fibromyalgia typically experience pain in their joints and muscles and may also suffer from frequent headaches and fatigue. According to the Centers for Disease Control and Prevention, about two percent of adults have fibromyalgia, which remains a mystery to scientists. The condition can be treated with physical therapy, antidepressants, pain medications and other approaches, although none of them is a cure. To see how many people turn to marijuana, Ste-Marie and his colleagues collected information from the medical records of 457 patients who came to the pain unit at McGill University Health Center. Their findings are published in the journal Arthritis Care & Research. All of the patients had been referred to the clinic for fibromyalgia symptoms, although only 302 of the patients were confirmed to have fibromyalgia as their primary diagnosis. About 10 percent said they smoked marijuana for medical purposes and another three percent had a prescription for a synthetic form of the active chemical in the cannabis plant. \"The popular knowledge of marijuana being available for pain would tend to demonstrate why 10 percent of patients would give it a try,\" said Ste-Marie. \"There really is no miracle drug for fibromyalgia. We definitely understand that patients would try to find something else,\" he told Reuters Health. The researchers couldn't tell from the study which of the patient had started smoked pot before their fibromyalgia developed. According to the Centers for Disease Control and Prevention, about 40 percent of U.S. adults have tried marijuana at some point. The study showed that pot smokers and non-users had the same rates of disability and unemployment. However, patients who had unstable mental illness or had a worrisome use of opioid pain medications were more likely to report using cannabis - a finding that raised concerns with Ste-Marie and his colleagues. \"Before saying herbal cannabis has a future in fibromyalgia, there are multiple things that need to be looked at,\" he said.", "summary": null}
{"url": "https://www.foxnews.com/auto/porsche-aims-high-with-hemp-bodied-car", "domain": "foxnews.com", "title": "Porsche aims high with hemp-bodied car", "authors": ["Gary Gastelu"], "publish_date": "01-04-2019", "text": "Porsches smoking hot new race car is the worlds first with bodywork built from hemp. The 718 Cayman GT4 Clubsport features composite doors that use an organic fiber mix derived largely from hemp and flax that take the place of traditional carbon fiber to reinforce a polymer resin. Porsche says the material is similar in weight and stiffness to a traditional carbon fiber composites and that the organic ingredients used are agricultural by-products, making it more environmentally friendly. (Ford) Porsche isnt the first automaker with this sort of idea, however. Back in 1941 Henry Ford built a prototype with a body made entirely from plastic that reportedly used cellulose from hemp, wheat and soybeans in its construction, although the exact formula has been lost to history. Along with the weight-reduction provided by the doors, the stripped-out Clubsport features a 425 hp 3.8-liter flat-six engine, 6-speed dual-clutch automatic transmission, racing seats, roll cage, fuel cell, racing brakes and suspension, plus additional equipment for track use. Two versions are being offered: a $150,000 Trackday model and a Competition version aimed at top-level racing that costs $175,000. (Porsche) Porsche hasnt indicated any plans to use the new material on a street legal production car, but its improved sustainability would further enhance the green image of its upcoming lineup of electric vehicles.", "summary": null}
{"url": "https://www.foxnews.com/entertainment/brad-pitt-turned-marijuana-hiding-from-public-amid-immense-fame-1990", "domain": "foxnews.com", "title": "Brad Pitt says he turned to marijuana, hiding from public amid immense fame in 1990s", "authors": ["Tyler McCarthy"], "publish_date": "12-10-2019", "text": "Brad Pitt admitted that the pressures of his immense fame in the 1990s caused him to turn to marijuana and seclusion in order to cope. In an in-depth interview with The New York Times Magazine, Pitt, who rose to fame with hit films such as Interview with the Vampire , Seven and Fight Club throughout the decade, said that he spent a good portion of the '90s sequestered in private because he didnt know how to react to the public interest in his every move and decision. I spent most of the 90s hiding out and smoking pot, he told the outlet . I was too uncomfortable with all the attention. Pitt, 55, said by the early 2000s he realized that he was imprisoning himself with his lifestyle of avoidance. Brad Pitt and Angelina Jolie divorced in 2016. (Evan Agostini/Invision/AP, File) Now I go out and live life, and generally people are pretty cool, he explained. Pitt spent the next few years starring in more hit films and getting married to his Mr. and Mrs. Smith co-star, Angelina Jolie . However, after the couple split in 2016 , hes been thrust back into the public eye for more than his movie roles. In the interview, the star opened up about his relationship with fame today and how he manages to live his life without going back into hiding. In short, he simply stopped reading the stories that are being written about him. Not just reviews. I mean any magazine in the doctor's office,\" he said. \"Because some of it would bounce around like a rat in the skull. It would stay there, and it would inform some of my decisions and choices in work, in life, and I didnt find any of it helpful.\"", "summary": null}
{"url": "http://www.foxnews.com/health/2014/01/08/scientists-discover-hormone-that-blocks-pot-high.html", "domain": "foxnews.com", "title": "Scientists discover hormone that blocks pot \"high\"", "authors": ["Fox News"], "publish_date": "01-08-2014", "text": "French researchers have discovered that a naturally occurring hormone acts as a defense in the brain against the psychoactive effects of marijuana consumption. The hormone, pregnenolone reduces the activity of a brain molecule that acts as a cannabinoid receptor. Researches think the discovery could help people with addictions to marijuana, as well as allowing people to take medical marijuana without the behavioral effects. The study was published in the journal Science . About 147 million people globally or about 2.5 percent of the population use cannabis, according to the World Health Organization.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2014/01/31/report-justin-bieber-plane-stopped-on-suspicion-it-was-carrying-weed.html", "domain": "foxnews.com", "title": "Justin Bieber released after plane stopped on suspicion of carrying pot", "authors": ["New York Post"], "publish_date": "01-31-2014", "text": "The troubled and talented Justin Bieber From a YouTube sensation to an award winning star. Will Justin Bieber be able to get his career and life back on track following a series of arrests and run-ins with the law? Justin Bieber and his entourage were held at Teterboro airport in New Jersey Friday after officials suspected the pop singer's plane was carrying marijuana, but sniffer-dogs came up empty and all aboard were released, The New York Post's Page Six reported. The pop star who had chartered a jet for his dad and entourage of friends was on his way to Super Bowl pre-parties, according to TMZ . The plane had just arrived when U.S. Customs officials detected a strong odor of pot, Page Six reported. The plane was ordered held until drug-sniffing dogs could check it out. Bieber was held for several hours until the dogs came up empty, and he and his entourage were then released by customs officials, PageSix.com reported.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2015/01/15/report-bethenny-frankel-to-launch-skinnygirl-marijuana-line.html", "domain": "foxnews.com", "title": "Report: Bethenny Frankel to launch Skinnygirl marijuana line", "authors": ["New York Post"], "publish_date": "01-15-2015", "text": "Bethenny Frankel's business aspirations have gone to pot. Diet-conscious Frankel plans to launch her own brand of Skinnygirl marijuana, according to a new report in Us Weekly .The dope new offering which claims not to give users the munchies would join Frankelslow-calorie Skinnygirl-brand cocktails. It will be a specially engineered strain of pot designed to not give you the munchies, a source close to Frankel told the magazine. She read about how profitable the cannabis industry is and wants to get in on that. The green goodieswould be sold in Alaska, Colorado, Oregon and Washington, where recreational marijuana use is legal.", "summary": null}
{"url": "http://www.foxnews.com/auto/2016/05/13/pot-growing-neighbors-blamed-for-fire-that-killed-import-cars-dogs.html", "domain": "foxnews.com", "title": "Pot-growing neighbors blamed for fire that killed import cars, dogs", "authors": ["Pete Bigelow"], "publish_date": "05-13-2016", "text": "A few days ago, we brought you news on marijuana's danger to drivers . Today, we bring you news on marijuana's danger to cars. Earlier this month, a fire at International Vehicle Importers , a Southern California company that specializes in bringingJapanese carsto the United States, destroyed much of the inventory. The cause of the blaze wasn't initially known, but now the owner of the company is blaming a pot-growing operation in an adjacent warehouse. \"After the fire, it was discovered that an illegal (in Ontario, California) marijuana grow was moving in next door,\" Sean Morris, the owner of International Vehicle Importers, wrote on Facebook . \"There was activity all day on Sunday next door, just prior to the fire. The thoughts are that they overloaded the main power breakers and this caused the fire.\" Twenty-four cars were lost in the fire, which occurred May 1, including several 1990 Nissan SkylineGT-Rand GTS models, a 1989NissanCefiro, 1989ToyotaSoarer, and a '94 Eunos/MazdaCosmo, along with several motorhomes andmotorcycles. Most important, Morris and his family lost two dogs, Max and Gigi, in the fire. Police officials have yet to confirm the link between the fire and a marijuana-growing operation next door, though Morris posted pictures of a search warrant and apparent plant on his Facebook page. He writes the business wasinsured, and that it still has cars en route from Japan and more at its Long Beach location. \"Along with business items, the dogs, and some spare parts, we also had some personal items that were being stored at the warehouse,\" he said. \"Thank you for all the support out there. You know who you are.\"", "summary": null}
{"url": "https://www.foxnews.com/entertainment/tommy-chong-says-stay-high-amid-potential-pot-crackdown", "domain": "foxnews.com", "title": "Tommy Chong says 'stay high' amid potential pot crackdown", "authors": ["Associated Press"], "publish_date": "02-24-2017", "text": "Tommy Chong has a message for those fearing a crackdown on recreational marijuana use: Don't worry. Stay High. Chong shot to fame in the 1970s alongside Cheech Marin as the stoner comedy duo Cheech & Chong. After White House press secretary Sean Spicer told reporters Thursday that the Department of Justice \"will be further looking into\" recreational pot use, Chong tweeted, \"Of course Trump is going after legal marijuana but like the failed Muslim ban it will be defeated in court. Don't worry stay High.\" Chong has a line of marijuana products on the market in states where pot is legal.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2017/04/17/melissa-etheridge-smokes-pot-with-her-kids-it-brings-much-closer.html", "domain": "foxnews.com", "title": "Melissa Etheridge smokes pot with her kids: 'It brings you much closer'", "authors": ["Fox News"], "publish_date": "04-17-2017", "text": "Melissa Etheridge likes to smoke marijuana with her family, she revealed as part of Yahoos Weed & the American Family project, previewed by People . The 55-year-old described smoking with her children, Bailey, who is 20, Beckett, who is 18. I have smoked with my older two, Etheridge told Yahoo . It was funny at first, and then they realized, its a very natural, end-of-the-day [thing] And it brings you much closer. Id much rather have a smoke with my grown kids than a drink oh, God, no. She said her 10-year-old twins also know about her marijuana use. My children have a very clear understanding of cannabis, she told Yahoo. When I hold it without shame or confusion, then they can understand it as simple as if I was pointing to a bottle of Percocet and said, Thats Mamas medicine. You take the naughtiness out of it, and its not something that kids run to. Etheridge said she also lights up with wife Linda Wallem. Cannabis is the best marital aid, she said. When its date night It takes down your inhibition; your sexual desires are enhanced. We take a bath every night and smoke and talk and wind down and sleep a very, very good night sleep and sleep is extremely important.", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2015/02/06/busy-philipps-says-seth-rogen-gave-her-pot-during-freaks-and-geeks.html", "domain": "foxnews.com", "title": "Busy Philipps: Seth Rogen gave me pot on 'Freaks and Geeks'", "authors": ["ET Online"], "publish_date": "02-06-2015", "text": "Call this the worst secret kept in Hollywood. \"Cougar Town\" star Busy Philipps appeared on Bravo's \"Watch What Happens Live \" on Wednesday, and was honest when a viewer asked who the biggest stoner was on the set of NBC's \"Freaks and Geeks.\" Philipps starred in the now beloved comedy series alongside Seth Rogen, James Franco, Jason Segel and Linda Cardellini from 1999-2000. Though host Andy Cohen initially guessed James Franco, Philipps said that Franco doesn't do pot, and revealed that it was actually Rogen who used to provide her with weed. \"Yeah, I would say Seth,\" she shrugs. \"He used to give me my pot, so ...\" According to the 35-year-old actress, it was high quality product. Rogen has been open about his marijuana infatuation before, even offering to be rapper Waka Flocka Flame's personal blunt roller in September. Waka Flocka Flame then posted a photoshopped pic of him and \"The Interview\" star sharing some weed, writing: \"First day on the job @SethRogen @3BRICKHOUSE #icanROLL.\"", "summary": null}
{"url": "http://www.foxnews.com/entertainment/2013/07/30/pot-reportedly-found-in-bieber-tour-bus-at-canadian-border.html", "domain": "foxnews.com", "title": "Pot reportedly found on Bieber tour bus at Canadian border", "authors": ["Associated Press"], "publish_date": "07-30-2013", "text": "U.S. border agents found marijuana on a bus with singer Justin Bieber's tour as it crossed into Detroit from Windsor, Canada. The Detroit Free Press reports that U.S. Customs and Border Protection spokesman Ken Hammond confirms that the bus was stopped Sunday as it attempted to enter the U.S. on the Ambassador Bridge. The singer was not on the bus at the time and performed later that night at Joe Louis Arena. Hammond says a police dog indicated the presence of drugs on the bus and that drug paraphernalia and a small amount of marijuana were found. He says the bus driver was cited and that the bus and its passengers were allowed to go.", "summary": null}
{"url": "https://www.foxnews.com/health/181-vie-for-license-to-dispense-medical-marijuana-in-massachusetts", "domain": "foxnews.com", "title": "181 vie for license to dispense medical marijuana in Massachusetts", "authors": ["Associated Press"], "publish_date": "09-25-2013", "text": "State health officials have released a list of 181 applications they received from groups hoping to open medical marijuana dispensaries. The applicants will be competing for a maximum of 35 licenses allowed under a voter-approved law that makes marijuana available to patients with certain medical conditions. The list released on Friday by the Department of Public Health includes the preferred county in which the applicant hopes to operate. Middlesex had the most applicants with 47, followed by 21 in Suffolk County, 19 in Plymouth County and 14 in Worcester County. Applicants are not required to name a specific city or town in the first phase of a two-part application process. Some groups submitted multiple applications in one or more counties. Massachusetts hopes to begin awarding licenses by the end of the year.", "summary": null}
{"url": "https://www.foxnews.com/health/marijuana-and-pregnancy-5-key-takeaways-from-the-new-official-guidelines", "domain": "foxnews.com", "title": "Marijuana and pregnancy: 5 key takeaways from the new official guidelines", "authors": ["Leslie Nemo"], "publish_date": "09-27-2018", "text": "More than half of Americans support the legalization of marijuana, but questions remain about how the drug affects our health. Those questions are especially important for one group: pregnant women. Marijuana use during pregnancy is becoming more common , despite the lack of clarity about its possible effects. But today (Aug. 27), the American Academy of Pediatrics (AAP) released its first-ever guidelines on marijuana use for pregnant and breast-feeding women. The new recommendations are based on an analysis of the existing research on how marijuana affects pregnancy, breast-feeding and childhood development, and they touch on a range of questions that expectant parents might have. [ 7 Ways Pregnant Women Affect Babies ] Here are the most important takeaways from the report. Don't use marijuana, in any form, during pregnancy. The AAP report concludes that completely avoiding marijuana use during pregnancy is best. That's in part because THC , or tetrahydrocannabinol the compound responsible for marijuana's psychoactive effects can cross the placenta. Several long-term studies have found relationships between marijuana use by pregnant women and slightly shorter gestational periods and lower birth weights, according to the report. Other studies looking at newborns have found that babies who were exposed to marijuana in utero had some other irregularities compared with other babies, such as unusual sleep patterns. Ultimately, based on the available evidence, the AAP decided to recommend against the use of marijuana during pregnancy, said Dr. Seth Ammerman, a pediatrics professor at Stanford University and a co-author of the AAP report. Dr. Torri Metz, a high-risk obstetrician at University of Utah Health, who wasn't involved with the report, said this stance from pediatricians falls in line with what experts in other medical specialties, such as obstetrics and gynecology, have concluded. \"This is not a paradigm shift but something we should continue to emphasize,\" Metz told Live Science. Don't use marijuana while breast-feeding. Breast-feeding moms should avoid marijuana use, because THC, along with some other potentially psychoactive compounds in pot, gets into breast milk, Ammerman told Live Science. In fact, a new study published alongside the report in the journal Pediatrics looked at breast milk from 50 women who used marijuana and found THC in 63 percent of the samples up to six days after they reported using the drug. Other cannabinoids, such as cannabidiol (CBD), showed up in just 5 percent of the samples. More on this... The 11 strangest pregnancy trends Blossoming body: 8 odd changes that happen during pregnancy 18 ways pregnancy may change your body forever Because other research found that these compounds could impact fetal development, it's possible that they could also affect a breast-feeding child, the researchers noted. But that specific link hasn't been explored, and breast-feeding is the still recommended option for a child's milk, Ammerman said. \"The goal is to encourage breast-feeding,\" he said, \"but if you're breast-feeding and using marijuana, you should cut down or stop\" marijuana use. There's no research showing that marijuana helps to treat morning sickness. The new report acknowledges that some pregnant women may use marijuana because they've heard that it eases morning sickness. But \"there are no research studies that say marijuana is effective for nausea in pregnancy,\" Metz told Live Science. If nausea during pregnancy is a problem, there are several treatments approved for use , including vitamin B6 and doxylamine, she added. Doctors who treat sexually active women should talk to them about drug use. Accidental pregnancies happen, and if someone is using drugs in the weeks before they know they're pregnant, that could cause problems for a fetus in its most critical stages, Ammerman said. \"One of the hopes of our recommendations is that pediatricians will take a more proactive role in counseling their patients who are sexually active about these issues, because it is really important,\" he said. In addition to discussing these recommendations with patients, doctors should be careful to avoid judging women regarding drug use, Ammerman added. There are still a lot of questions that need be answered. Despite the publication of the guidelines, there's still a lot of research that needs to be done. For example, researchers have worked primarily with marijuana compounds, like THC and CBD, that people hear about most, but there are dozens more that deserve studies, Ammerman said. There's also a lot of room for research on what, if any, complications marijuana can cause for pregnant women themselves, Metz noted. And researching marijuana's impact on child development can also be difficult. It's unethical to give marijuana to pregnant individuals, so researchers mostly rely on data from parents who report using the drug. What's more, researchers have to account for the different ways pot is used, and decipher the dose concentrations, which are changing THC concentrations in marijuana increased from about 4 percent in the 1990s to about 12 percent in 2014. And, of course, the U.S. Drug Enforcement Administration still classifies marijuana as a Schedule I drug, which puts up a lot of barriers for researchers, Ammerman said.", "summary": null}
{"url": "https://www.foxnews.com/health/florida-doctor-sells-cannabis-infused-ice-cream", "domain": "foxnews.com", "title": "Florida doctor sells cannabis-infused ice cream", "authors": ["Madeline Farber"], "publish_date": "10-05-2018", "text": "Cannabis-infused ice cream helps patients by doctor's orders Florida doctor swears by products with CBD extract for his patients which has soothing effects and helps with pain, anxiety and inflammation. A doctor in Florida has taken an unconventional approach to help his patientsmanage pain: ice cream cannabis-infused ice cream, to be exact. Ashok Khanna, an internal medicine physician at the Florida Primary Care Center in Winter Garden, has recently started to sell ice cream that contains CBD one of the many chemical compounds found in the cannabis plant. CBD is not psychoactive, unlike THC, another chemical compound or cannabinoid found in marijuana. This means patients who eat the ice cream will not become high, XXX reports. CBD iswidelyavailable across the U.S., though some states require a prescription to use the oil for medicinal purposes. CBD has soothing effects.The oil has been used to treat patients with anxiety and depression, according to Healthline . Retired NFL players have also used it as a way to alleviate pain, Mens Health reported . In June, the U.S. Food and Drug Administration approved the first drug derived from marijuana to treat epilepsy. The ice cream made by the Florida-based Heavenly Hash Creamery has also been beneficial for those battling cancer, helping with inflammation and pain, according to XXX. \"It makes sense to give them something that'll make them feel better, Khanna told the news station of his decision to sell the ice cream.", "summary": null}
{"url": "https://www.foxnews.com/health/2016/06/02/marijuana-use-by-adults-tied-to-few-physical-health-problems.html", "domain": "foxnews.com", "title": "Marijuana use by adults tied to few physical health problems", "authors": ["Reuters"], "publish_date": "06-02-2016", "text": "Other than being at an increased risk of gum disease, people who smoked marijuana for up to 20 years during adulthood were generally as healthy as people who didn't light up, according to a new study. The same researchers had previously found that marijuana users were at higher risk of cognitive decline and descent into lower social and economic strata, but the new study suggests the same isn't true for physical health. \"The only measures that seemed to indicate any really serious health problem was periodontal disease,\" said senior author Terrie Moffitt, of Duke University in Durham, North Carolina. In periodontal disease, the gums around the teeth become inflamed, according to the National Institutes of Health. The gums pull away from the teeth, creating pockets that can become infected. Left untreated, periodontitis can lead to loss of teeth. For the new study, the researchers studied 1,037 people born in New Zealand in 1972 and 1973. Participants were tracked from age 3 to age 38. Overall, about 65 percent reported using marijuana at some point after age 18, according to the results in JAMA Psychiatry. The researchers did not find a link between marijuana use in adulthood and poor physical health for a number of conditions, including lung function, systemic inflammation, metabolic health, blood pressure and body mass index (BMI), which is a measure of weight in relation to height. After adjusting for a number of factors like tobacco use, the researchers did find that marijuana use throughout adulthood was tied to gum disease toward the end of the study period. Moffitt told Reuters Health that the connection between marijuana use and the oral condition is likely explained by people putting lit objects close to their gums. \"Anything you smoke heats up your gums and causes inflammation and inflammation is bad for your teeth,\" she said. For comparison, the researchers also looked at whether tobacco was tied to any poor physical health outcomes. They found it was tied to a number of poor health outcomes like inflammation, gum disease, cholesterol, lung function and blood sugar. Cannabis \"is not a really big public health problem right now whether it causes mental health problems, downward social mobility and physical ailments because not many people are using it compared to tobacco and alcohol,\" said Moffitt. \"If the proportion of people who are likely to use cannabis were to increase, many problems associated with it would naturally increase as well,\" she said.", "summary": null}
