{"url": "http://www.huffingtonpost.com/2008/05/21/cannabis-college-a-master_n_102843.html", "domain": "huffingtonpost.com", "title": "Cannabis College: A Master's In Marijuana", "authors": ["Current"], "publish_date": "05-29-2008", "text": "The 35-year-old son of a prominent cannabis rights activist goes back to school...to study pot (at Oaksterdam University in Oakland). So, what do you think? How do you feel about medical marijuana? Would you ever attend Cannabis College? Do you think it should be considered a real school? Tell us your thoughts below!", "summary": null}
{"url": "http://www.huffingtonpost.com/2009/03/26/obama-takes-pot-legalizat_n_179563.html", "domain": "huffingtonpost.com", "title": "Obama Takes Pot Legalization Question During Townhall", "authors": ["Sam Stein"], "publish_date": "04-26-2009", "text": "The White House's innovative Open for Questions forum has produced plenty of substantive questions on wonky issues. But roughly midway through, the president preemptively took one of the more popular and provocative questions of the bunch. The query, which received more than three million votes, was: \"With over 1 out of 30 Americans controlled by the penal system, why not legalize, control, and tax marijuana to change the failed war on drugs into a money making, money saving boost to the economy? Do we really need that many victimless criminals?\" Obama actually interrupted the M.C of the event -- Jared Bernstein, chief economist to the Vice President -- in order to tackle the topic. He kept his answer brief. \"There was one question that voted on that ranked fairly high and that was whether legalizing marijuana would improve the economy and job creation,\" he said. \"And I don't know what this says about the online audience, but ... this was a popular question. We want to make sure it's answered. The answer is no, I don't think that's a good strategy to grow our economy. All right.\" Responded Bernstein: \"Thank you for clearing that up.\" Jack Cole, executive director of Law Enforcement Against Prohibition (LEAP), said in response: \"Despite the president's flippant comments today, the grievous harms of marijuana prohibition are no laughing matter. Certainly, the 800,000 people arrested last year on marijuana charges find nothing funny about it, nor do the millions of Americans struggling in this sluggish economy. It would be an enormous economic stimulus if we stopped wasting so much money arresting and locking people up for nonviolent drug offenses and instead brought in new tax revenue from legal sales, just as we did when ended alcohol prohibition 75 years ago during the Great Depression.\"", "summary": null}
{"url": "http://www.huffingtonpost.com/2010/02/18/marijuana-provides-pain-r_n_466993.html", "domain": "huffingtonpost.com", "title": "Marijuana Provides Pain Relief, New Study Says", "authors": [], "publish_date": "02-18-2010", "text": "The first U.S. clinical trials in more than two decades on the medical benefits of marijuana confirm pot is effective in reducing muscle spasms associated with multiple sclerosis and pain caused by certain neurological injuries or illnesses, according to a report issued Wednesday. Igor Grant, a psychiatrist who directs the Center for Medicinal Cannabis Research at the University of California, San Diego, said five studies funded by the state involved volunteers who were randomly given real marijuana or placebos to determine if the herb provided relief not seen from traditional medicines. \"There is good evidence now that cannabinoids may be either an adjunct or a first-line treatment,\" Grant said at a news conference where he presented the findings. The California Legislature established the research center in 2000 to examine whether the therapeutic claims of medical marijuana advocates could withstand scientific scrutiny. In 1996, state voters became the first in the nation to pass a law approving pot use for medical purposes. Thirteen other states have followed suit, but California is the only one so far to sponsor medical marijuana research. After 10 years and nearly $9 million, the Center for Medicinal Cannabis Research is preparing to wrap up its work next year. Along with the studies on muscle spasms and pain associated with spinal cord injuries and AIDS, the center also has funded research on how marijuana affects sleep and driving, limb pain due to diabetes, and whether inhaling vaporized cannabis is as effective as smoking it. A laboratory study supported by the center examined if pot could be helpful in treating migraine headaches and facial pain. In that study, rats given a cannabis-like drug exhibited reduced activity of nerve cells that transmit pain. State Sen. Mark Leno, a San Francisco Democrat who chairs a budget subcommittee on health and human services and supports medical marijuana, said he doubted there would be more financial support for the center, given California's ongoing budget crisis. The federal government classifies marijuana as an illicit drug with no medical use but produces the only pot legally available for scientific research under a contract with the University of Mississippi. Grant said obtaining some of the Mississippi crop and meeting the complex security regulations required by the Drug Enforcement Agency and other federal agencies was time-consuming and cumbersome. Grant, however, had no problem with the quality of the government's supply. Its consistency was helpful in determining that patients who smoked less-potent marijuana enjoyed the same amount of pain relief but less mental confusion than those who inhaled a more powerful strain, he said. Such quality control is notably absent from the marijuana that patients with a doctor's recommendation can legally obtain in California through hundreds of cooperatives and storefront dispensaries, Grant said. He said more research was needed on how pot works and its side effects. \"Because we don't know the composition of the strains that are on the street, we don't know what patients really are getting,\" he said. \"As a doctor I feel some discomfort when someone says take X or Y pill or herb because we think that might be helpful.\" Since its founding, the center has approved 15 research studies, but five had to be discontinued because there were not enough volunteers willing or able to meet the criteria for participating. One proposed study on the effectiveness of marijuana in reducing chemotherapy-related nausea was canceled because researchers could not recruit enough cancer patients who weren't already treating their symptoms effectively with anti-nausea medications. In the 24-page report submitted Wednesday to the Legislature, Grant said research protocols had been rigorous, with six studies published or accepted for publication in peer-reviewed science journals. In four studies, participants suffering from multiple sclerosis, AIDS or diabetes, along with healthy volunteers injected with a chili pepper substance to induce pain, were randomly assigned to receive cigarettes filled with marijuana. Half had the active ingredient delta-9-tetrahydrocannabinol, or THC, removed. Not every patient who smoked the real marijuana reported improvement. But the percentage who did was comparable to those who said they experienced relief from antidepressants and other medications commonly prescribed for neuropathic pain, the study said.", "summary": null}
{"url": "http://www.huffingtonpost.com/2011/01/04/chris-matthews-inlaw-pot-bust_n_804321.html", "domain": "huffingtonpost.com", "title": "Chris Matthews’ In-Law Arrested In Multimillion Dollar Pot Bust", "authors": [], "publish_date": "01-04-2011", "text": "Chris Matthews' in-law has been arrested in connection with an $8.1 million pot bust, the Cape Cod Times reports . Federal agents intercepted a boat coming to the U.S. from Jamaica six weeks ago and seized 4,497 pounds of marijuana, the paper writes. They traced the pot back to Dartmouth, Mass, where the captain and owner of the boat, James Ormonde Staveley-O'Carroll, lives. Staveley-O'Carroll's daughter, Sarah, is married to Matthews' son, Michael. Staveley-O'Carroll was targeted as the ringleader of the plan to bring the drugs to America. He is being held in Mississippi and is awaiting trial along with two co-defendants. They are charged with conspiracy to possess controlled substance with intent to distribute, conspiracy to import controlled substance with intent to distribute, possession of controlled substance with intent to distribute and importation of controlled substance with intent to distribute. The Times reports that, according to a federal affidavit, the drug bust is \"the result of an investigation by Homeland Security agents and stems from information provided by a confidential informant that the Sarah Moira was smuggling about 4,000 pounds of marijuana from Jamaica to the U.S.\" Staveley-O'Carroll's co-defendants told investigators that he hired them to help prepare the Sarah Moira for a trip to Jamaica to pick up the pot. They alleged that two boats arrived at the Sarah Moira with bags full of drugs, which they transferred to the boat bound for the U.S.", "summary": null}
{"url": "http://www.huffingtonpost.com/2012/01/09/michigan-marijuana-amendment_n_1194313.html", "domain": "huffingtonpost.com", "title": "Michigan Marijuana Amendment Would End Debate Over Medicinal Use", "authors": ["David Sands"], "publish_date": "01-09-2012", "text": "Michigan marijuana activists are gearing up for a campaign to amend the state's constitution to legalize the herb. If passed, the proposed amendment would end the prohibition of marijuana in Michigan. It covers the cultivation, use, sale and distribution of the cannabis plant for adults over the age of 21. Charmie Gholson, communications director for Committee for a Safer Michigan , the Detroit-based group sponsoring the effort, told XXX that media reports claiming a petition drive in favor of the amendment would start this week were a bit premature. Organizers are still waiting for the exact formatting of the proposal to be approved by the State of Michigan, but expect to make a formal announcement next week. Michigan Attorney General Bill Schuette has spurred the legalization effort, perhaps unintentionally, outraging pro-pot activists with his adversarial stance towards the Michigan Medical Marihuana Act. That law, passed by voters in 2008, allows patients who register with the state to use the plant for medicinal purposes. Nearly 129,600 patients now belong to the program . In an recent interview with Michigan Radio , Schuette called the medical marijuana legislation \"a patchwork law that is so full of holes it makes a mockery of Swiss cheese.\" \"We should not have nod and a wink justice,\" he said, adding his belief that activists had used vague language and medical allusions to sneak through a more far-ranging marijuana decriminalization. Since taking office in 2011, Schuette has worked to shut down marijuana clinics , and to prosecute patients enrolled in the state marijuana registry . Matt Abel, a Detroit attorney who is leading the amendment drive, recently told the Metro Times that the \"blatant abuse and violation\" of the medical marijuana law by police and prosecutors has left many with few options beyond amending the state constitution. \"If we don't try to do something now, it may be years before we have appropriate reform,\" Abel said. Other Michigan activists have worked to decriminalize marijuana through local ordinances. In November, Kalamazoo voters approved putting possession of less than an ounce of marijuana at the lowest level priority for city police , the Metro Times reports. A recall effort against Schuette is also underway. That measure would require 807,000 signatures by March to be placed on the November ballot.", "summary": null}
{"url": "https://www.huffpost.com/entry/weed-edibles_n_3831498", "domain": "huffpost.com", "title": "Weed Edibles: The Most Creative Marijuana Food Products", "authors": ["Nile Cappello"], "publish_date": "08-30-2013", "text": "With many states on their way to legalizing marijuana , the conversation surrounding this herb has been even louder than usual lately. With legalization (both for recreational and medicinal purposes ) has come a new wave of creativity in terms of one of weed's most popular forms: edibles. While it may not surprise you that brownies remain one of the most popular marijuana-infused baked goods, it seems that the possibilities are endless when it comes to weed edibles -- we found dispensaries selling everything from throat lozenges to fudge. Considering the way the Internet blew up over Nugtella , we expect even more creations to come.", "summary": null}
{"url": "https://www.huffpost.com/entry/drinkable-marijuana-legal_n_5760660", "domain": "huffpost.com", "title": "You Can Now Sip On A Marijuana-Infused Drink In Washington", "authors": ["Emily Thomas"], "publish_date": "09-03-2014", "text": "This isnt your average herb-infused drink. Nearly two months after recreational marijuana sales started in Washington , drinkable forms of the drug have hit store shelves. Produced by Washington-based company Mirth Provisions, an aptly titled beverage line called Legal is currently available at eight of the states 22 recreational marijuana stores , according to Fortune. The drinks come in five different flavors, including sparkling pomegranate and cold brew with milk and sugar. Though all Legal beverages are infused with 22 milligrams of THC -- \"enough to know that you're high, but not so much as to overwhelm,\" Mirth Provisions founder Adam Stites told XXX -- each flavor touts a slightly different high. The high produced by the cold brew with milk and sugar , for example, is described on the companys website as an uplifting, euphoric head high and a gentle body buzz. Were particularly fond of the description for the sparkling lemon ginger flavor: Couch, meet butt. This delicious fusion of tangy lemon and spicy ginger is so ridiculously relaxing that you may find yourself becoming one with your furniture. Whether youre melting into a beach blanket or parked on the sofa, prepare for many glorious hours of doing absolutely nothing. Stites says \"drinkables\" dont carry as much of a taboo as other forms of marijuana. \" Its much more approachable , as opposed to Hey, mom and dad, do you want a joint?' Stites told Portland, Oregon, news outlet KGW-TV. (Story continues below) Mirth Provisions had previously announced that the beverages would hit store shelves in July , but the company faced some minor setbacks that pushed back the product's release date. Stites says his company has learned a lot from observing Colorado's struggle with implementing recreational marijuana sales. \"Washington is learning from some of the challenges Colorado has seen, we're slower, more deliberate, more regulated (we had to get city approvals, Liquor Control Board approvals, and approvals from the Washington State Department of Agriculture), and in the end, I believe we'll have a strong sustainable legalized marijuana system,\" he told XXX. He says green beverages are an amazing, untapped new market, and he's happy to be able to \"create a product that allows others to enjoy their new freedoms.\" It's an opportunity to make an amazing, unique, unusual, and delicious product while also making history, Stites said. I think my grand-kids will be amazed to know that people used to go to jail for having a plant.", "summary": null}
{"url": "https://www.huffpost.com/entry/weed-bar-tent-oregon-wedding-reception_n_55df5ba0e4b08dc09486cce3", "domain": "huffpost.com", "title": "Oregon Wedding Featuring Weed Bar Was A Huge 'Hit' With Guests", "authors": ["Ryan Grenoble"], "publish_date": "08-27-2015", "text": "This wasn't your typical weeding... er, wedding. For their matrimonial ceremony this summer, Oregon couple John Elledge and Whitney Alexander decided to augment the standard open bar with a \"weed tent.\" The experience included transportation to and from the event (safety first!) and a budtender to help guests in need of a little guidance. Guests browse the marijuana bar at the Elledge-Alexander wedding earlier this summer. Thanks to Oregon Measure 91 , the weed tent was completely legal, as long as the couple followed some basic rules, Mark Pettinger of the Oregon Liquor Control Commission told Portland news station KGW . \"On private property where no liquor license is involved, it is legal,\" Pettinger said, noting that \"there cannot be bartenders and budtenders\" at the same event. \"My fiance, John, has been in the medical marijuana industry in Oregon for years,\" Alexander told The XXX, explaining the inspiration. \"We were happy to give our guests, especially the ones from out of town, a unique experience.\" The 'weed bar,' along with a tent to keep smoke contained. Alexander added that she doesn't use alcohol or marijuana, and the couple took extra care to reduce the odds of other guests encountering any secondhand smoke. \"The tent was set well away from the rest of the reception, and facing away from the crowd to control where the smoke went,\" she said. \"There were actually guests that had no idea it was there until after the fact.\" Wedding planners Nora Sheils and Elizabeth Corr of Bridal Bliss said the novelty of the weed bar was a huge hit. \"We were worried that the tent might take away from the reception but it did the exact opposite,\" Sheils told XXX in an email. \"Guests had a fun time and ended up dancing the night away, just like any other wedding.\" The couplehad a budtender on hand to answer questions for guests and facilitate the process, including moderating attendees' consumption, if need be. And yes, the couple did provide late-night snacks, offering their undoubtedly hungry guests an array of french fries and beignets.", "summary": null}
{"url": "https://www.huffpost.com/entry/the-biggest-legislative-m_b_11408064", "domain": "huffpost.com", "title": "The Biggest Legislative Marijuana Policy Reforms Of 2016", "authors": ["Rob Kampia"], "publish_date": "08-10-2016", "text": "On July 29, Illinois Gov. Bruce Rauner (R) signed a bill removing the threat of arrest for small amounts of marijuana, capping a record year of legislative and administrative marijuana policy reforms throughout the country. Two states, Pennsylvania and Ohio, enacted effective medical marijuana laws via their legislatures, making them the 24th and 25th states to do so, respectively. As a result, more than half of the U.S. population now lives in states that have opted to legalize medical marijuana. This year has also seen improvements to several existing medical marijuana programs. Colorado adopted “Jack’s Law,” which provides protections for medical marijuana patients who attend public schools. Connecticut, New Hampshire, Rhode Island, and Vermont expanded the lists of medical conditions for which patients can qualify to use medical marijuana. Vermont also enacted a law that reduces the required time for a patient-provider relationship from six to three months, allows marijuana to be transferred to research institutions, and requires labeling and child-resistant packaging for edibles sold at dispensaries. Oregon increased access to medical marijuana for veterans who receive assistance from the VA program. In Illinois, Gov. Rauner signed a bill to extend and expand the state’s pilot medical marijuana program, and in Maryland, lawmakers enacted a law allowing nurse practitioners, dentists, podiatrists, and nurse midwives to recommend medical marijuana to qualifying patients. Florida enacted a law allowing terminally ill patients to use any form of medical marijuana. However, this law does not affect Florida’s flawed low-THC medical marijuana law for non-terminal patients. It also contains a major flaw in that it requires physicians to acquire medical marijuana for terminal patients, exposing the physicians to potential criminal sanctions and/or loss of licensure. In addition to Illinois, a number of other states enacted laws to reduce marijuana possession penalties. Kansas lowered the maximum jail sentence for first-time possession and reduced second offenses from felonies to misdemeanors. Louisiana and Maryland removed criminal penalties for possession of paraphernalia, with the Maryland Legislature overriding Gov. Larry Hogan’s (R) veto. Oklahoma cut the penalties for second marijuana possession offenses in half, and Tennessee reduced a third possession offense from a felony to a misdemeanor, making the maximum penalty less than a year in jail. At the local level, New Orleans and a number of Florida counties passed ordinances that give police the option to issue summons or citations instead of arresting people for low-level possession. In states where marijuana is legal for adults, legislators and regulators made notable improvements and progress toward full implementation. In Colorado, lawmakers passed a bill to allow out-of-state ownership of marijuana businesses and increased the amount of marijuana that non-residents may purchase at retail establishments. Colorado also increased local control of testing laboratories and created a new business category for businesses that transport marijuana. And in Washington State, a number of bills were passed to streamline practices in the marijuana industry and make it easier to apply for research licenses. Alaska regulators began licensing marijuana cultivators and expect to begin issuing retail licenses soon. Oregon is in the process of licensing adult-use marijuana retailers while currently allowing any adult to purchase marijuana from existing medical dispensaries; Oregon also passed comprehensive regulations that, among many other things, increase cooperation between the medical and adult retail programs, exempt patients from being taxed, allow out-of-state investment in marijuana businesses, and protect financial institutions from prosecution under state law for doing business with the marijuana industry. In addition to this progress, Vermont came close to becoming the first state to legalize and regulate marijuana for adults 21 and older through a legislature; a comprehensive bill passed in the state Senate but stalled in the House. Rhode Island is close behind Vermont, with both states expected to enact legalization laws during their 2017 legislative sessions. Looking forward to November 8, voters in as many as 10 states will be voting on marijuana ballot measures. Specifically, medical marijuana initiatives have already qualified for the ballot in Arkansas and Florida, and Missouri and North Dakota could also be in play. As for regulating marijuana like alcohol, such ballot initiatives have qualified for the ballot in California, Maine, Massachusetts, and Nevada, with Arizona soon to follow. Finally, a tenth state, Montana, will be voting to improve its existing medical marijuana law. This year is already the most important year in the history of the movement to end marijuana prohibition in the United States.", "summary": null}
{"url": "https://www.huffpost.com/entry/cannabis-is-no-ordinary-commodity_b_59aea0e5e4b0bef3378cdb29", "domain": "huffpost.com", "title": "Cannabis Is No Ordinary Commodity", "authors": ["Lloyd I. Sederer"], "publish_date": "09-05-2017", "text": "Pot is different from growing, distributing and selling potatoes, beef, salmon or cars, common commodities with of course complex forces at work. But cannabis takes complexity to a whole new level, comparable to tobacco and alcohol - which have been among the principal killers of Americans. Yet the US is ablaze with cannabis: It is our #1 illicit drug and medical marijuana (MJ) is legalized in 29 states and recreational marijuana legal in 8 states (DC permits both). 63% of Americans live in states with medical or recreational MJ or both. The flame is everywhere and picking up intensity. Over 22 million Americans (12 and older) reported using MJ in the past month . While some die-hards may imagine prohibiting the use of (especially) recreational marijuana and using law enforcement to make that happen that seems an extremely unlikely, not to mention a futile, path for this country. Informed and candid cops know that arrest and incarceration cannot solve problems of drug use and dependence. So we face questions like: Should cannabis be fully decriminalized? Should medical and recreational MJ be legalized in all states? Should production and sales be limited? Should the market be allowed its sway? If you as a state feel the heat and it is not if but when , what design logic would be a useful guide? Will it be individual freedom (for adults), free or regulated markets, or the health of the collective, as shaped by public health goals? Who will benefit therapeutically and financially? Who will suffer? What are the least worst options, given the well-known public health principle that increased access results in greater use? These questions are for your consideration as a citizen (and tax payer), consumer, parent, co-worker, business owner or state or federal official. We need to shine some light on a poorly lit set of data (mostly from when MJ was 1/60th as potent as it is today) and experience (which is not at all uniform or robust from the states having gone ahead) to make decisions now. The cannabis fire will rapidly outpace what science and practice may reveal in the years to come. To examine what we know and what we can do in a clear and sensible way a 3-day, National Cannabis Summit was held in Denver, CO, in late August, convened by three organizations. It was the brainchild of Neal Shifman, CEO of Advocates for Human Potential, a human services research, consulting and training organization. He joined forces with The National Council for Behavioral Health, constituted of 2900 member mental health and addictions treatment organizations, and the Addiction Technology Transfer Center Network, which promotes adoption and implementation of what works for people with Substance Use Disorders. Advocates for Human Potential 2017 National Cannabis Summit The conference smartly assembled a diverse group of government and private stakeholders. In practical ways, it crisply reported and discussed state implementation efforts to date, therapeutic effects and health risks of cannabis, legal and clinical knowledge, and the neuroscience of cannabinoids (the term for the class of diverse chemical compounds that act on our brain and body nerve receptors). Here are my take-away messages. Start small, as a state or county. Build slowly. There is no going back from full recreational legalization, especially when for-profit companies are financing its implementation. Imagine when Anheiser-Busch and RJ Reynolds Tobacco Company start promoting and distributing cannabis. Remember This Buds For You, The Marlboro Man and Joe Camel? Hence, also ban advertising. Separate out the growers from the distributors and those two from the retail sellers. Do not permit what is called vertical integration, where one entity controls the supply chain, which can foster monopoly. Pursue a harm reduction strategy, as Canada is doing nationally under its progressive Prime Minister, Justin Trudeau. Identify and work to prevent or delay use by pregnant mothers or teenagers, where brains are under development. Add other highly vulnerable populations to that strategy, including those with known predispositions to or with family histories of a substance use or mental health disorder. Dont smoke cannabis. Vape or eat it: Smoking is really bad for the lungs. Decriminalize cannabis. Limit access. Make the minimal age 21, set limits of quantities for legal possession and number of home grown plants (which can become a black/grey market cottage industry), set limits on dosages because potency counts (e.g., 10 mg for edibles), require minimum prices so MJ does not become cheap (as it has in Washington State), and contain production quotas and retail outlets. Enforce the laws about Driving Under The Influence (DUI) and underage sales. Dont permit public consumption. Require childproof packaging. Ensure that cannabidiol (CBD) - the second most common cannabinoid in MJ after THC, and without psychoactive properties - is present in MJ products in significant amounts (we still dont know what that is but it is not near zero) because it appears protective against psychosis. Direct state (or federal, if that ever happens) cannabis taxes to fund health insurance, as well as prevention (especially for youth) and public information campaigns. Allocate a percentage of taxes to fund de-identified (i.e., privacy protected) state registries and use them to evaluate the impact of legalization on health and public safety - both for its therapeutic value and its harm to the brain and body (including diseases and traffic accidents). Get the FDA to declare cannabis a Schedule 2 drug, not its current hugely deterring Schedule 1 status, so our country can actually study this drug. Expect over 40% of current MJ users to ingest 20 or more days/month. Recognize that the predominance of regular users appears to stop on their own or not use abusively, without services (unassisted recovery see Dr. John Kelly, ). Ensure that those who need assistance, because cannabis is addictive, can access and continue in treatments known to work. Sustain or increase federal funding to study the effects and therapeutic potential of cannabinoids, including plant-based THC and CBD as well as the brains own cannabinoid system (driven by endocannabinoids). As citizens and policy makers we need to lean in to the dilemma of what to do about cannabis. Silence only lets a vocal minority rule. Like climate change, it is everyones issue, deniers notwithstanding. As a friend of mine recently wrote, A fool can throw a stone into the water that ten wise men cannot recover. (From Jay Neugeboren, March 2017). In other words, there is no single or simple solution to the cannabis Rubic cube. We will have to act now, and sensibly, and let science catch up. To paraphrase what Churchill said of we Americans, we do the right thing after we have exhausted everything else. Whats ahead is surely difficult but it is not impossible.", "summary": null}
{"url": "https://www.huffpost.com/entry/sonic-gulfport-marijuana-smoke_n_5ac53c46e4b056a8f597f630", "domain": "huffpost.com", "title": "Mississippi Sonic Won't Serve Stoners Toking In The Drive-Thru", "authors": ["David Moye"], "publish_date": "04-04-2018", "text": "A Sonic restaurant in Gulfport, Mississippi, is hoping to weed out a certain part of its customer base: Stoners who get high in the drive-thru. Apparently, employees arent stoked about serving customers stinking of pot smoke, so they decided to toke er, take matters into their own hands. Two weeks ago, employees posted a sign in a window warning cannabis-consuming customers not to get baked in the drive-thru lane. The sign reads: ATTENTION! If you are smoking weed in the drive thru you will not be served! Please show some common courtesy and smoke and air out before pulling up to order. Please stop smoking weed in the drive-thru, Gulfport restaurant asks: Sun Herald (@sunherald) March 30, 2018 Store manager Yasman Freeman told the Biloxi Sun Herald that the final straw came about two weeks ago when a customer blew pot smoke at an underage employee working the drive-thru window. It seems to be working: Freeman said the sign seems to have reduced some of the wacky weed aromas that used to waft from customer cars. But theres been an increase of other activity, she admits. There have also been a lot of pictures (of the sign) taken, she said. Mississippi is one of 22 states that have decriminalized possession of small amounts of marijuana. In February, lawmakers in the capital city of Jackson voted to make fines for first-time possession even lower than state guidelines. Theres no word on whether signs like Sonics Gulfport location will become a fixture at other locations, but Eaters Greg Morabito rightly noted that a place that serves footlong chili cheese dogs, jalapeo poppers, and breakfast burritos is bound to attract weed smokers . He suggested the chain might want to invest in similar signs for other franchises before it introduces the pickle-flavored slushie later this summer.", "summary": null}
{"url": "https://www.huffingtonpost.ca/2019/01/09/marijuana-prices-canada_a_23638528/", "domain": "huffpost.com", "title": "Legal Marijuana In Canada Much More Expensive Than Black Market: StatCan", "authors": ["Canadian Press"], "publish_date": "08-10-2016", "text": "Statistics Canada says that the average price of a legal gram of recreational pot last year was $9.70, nearly 50 per cent higher than the illicit market price of $6.51. The agency says it received 385 price quotes deemed plausible using the StatsCannabis crowdsourcing application between Oct. 17, when adult-use pot became legal in Canada, and Dec. 31. It added that roughly half of the respondents told the agency they bought recreational pot from a legal supplier. Statistics Canada also says the average amount of non-medical cannabis purchased from an illegal supplier was more than double the quantity bought from legal channels, such as government-run stores or websites. Respondents told the agency since Oct. 17 they purchased an average of 17.2 grams from illegal suppliers, compared with 8.3 grams from legal retail outlets or online for mail delivery. However, availability of legal cannabis amid widespread product shortages across Canada since legalization day may be a contributing factor.", "summary": null}
