{"url": "", "domain": "", "title": "", "authors": [], "publish_date": "02-42-8395", "text": "Hey there. Sorry for the delay. Sometimes when I'm not finding any common ground with someone it helps to take a step back and think it over a while before responding... well that, and I've been on vacation for the last few days without my laptop and sure as shit wasn't going to reply to this on my phone. So I think you'll agree we've gotten a bit into the weeds and tangented rather far from the original topic, so I hope to draw back on a few aspects and hopefully find that common ground we've been looking for. >But I do feel like you're very vague about what you actually believe... To your last sentence, yes, I think that's exactly the issue, here. I really don't feel I'm being squirrely, deliberately or otherwise, but the nature of this discussion might make it seem like that; there's a difference between my beliefs, Peterson's beliefs, things I agree with Peterson on, and my ability to explain what I think Peterson meant when he said this or that thing. It also really doesn't help that the \"this or that thing\" we've honed in on for several replies now is 30 seconds of fast-paced dialogue during a hostile interview, where the topic being discussed gets no context before rolling out and isn't touched upon later in the interview. If we were discussing a full chapter in a book of his, for instance, we probably wouldn't be running into this issue quite as much. And I know perhaps you take this (the fact readers/listeners can't plainly and objectively reiterate his views) as evidence that Peterson is intrinsically vague, but I'd point out this is hardly a phenomenon unique to him; people debate endlessly about what figures like Freud or Marx really meant in their writings, even decades after their deaths; I have constant back-and-forths with my music-buff friends about what the lyrics to this song or that song really mean; hell, various holy texts have been available to humanity for thousands of years and even today nobody can seem to agree on what they really meant. I think you're a bit overly-critical of Peterson's apparent inability to express complex ideas in a succinct way that leaves no ambiguity, since it's hardly a problem that's unique to him. And it also depends on the topic being discussed. Nobody is asking \"well what does Peterson really *mean* when he says he likes collecting Soviet-era propaganda artifacts?\" in a way *plenty* of discussion has arisen from \"what does Peterson really *mean* by his definition of truth.\" The latter topic is just a bit deeper than the former, and thus more likely to have different ways folks will interpret it. Finally, I'd like to add there's been very little that you've actually asked *me* about what *I* believe, or even how much I agree with what Peterson says. Mostly you've been asking me to explain what I think Peterson thinks based on some very short sound-bytes of his. If you do want to know, ask a question and I'll be as clear and succinct as possible in answering, but given that not a lot of that has been happening I think it's a bit unfair to say \"you're very vague about what you actually believe.\">Newman may or may not be a good journalistThis, I've decided, is probably one of the issues we'd do better to drop than keep harping on; all I can do is imagine myself on the receiving end of her tactics in that interview and find them contemptible and counterproductive, while you feel they were perfectly justified given her target. But Newman isn't really our issue, here: Peterson is. If Peterson isn't a slimy snake, like I assert, Newman was a dick during the interview; if Peterson is a disingenuous, dangerous, and vague character like you assert, Newman was 100% justified in her tactics. But discussing those tactics isn't helpful unless we can agree on the nature of the target - Peterson - so I feel maybe we ought to leave the Newman issue alone for a bit. Thoughts?>Peterson up originallyNewman aside, this is one thing I take a bit of an issue with. Have you seen his discussion (or perhaps debate) with Harris? Not 10min into a multi-hour long discussion they hit on a point of disagreement and don't leave it for the rest of the podcast. It was irritating just because I feel the podcast would have been more worthwhile if they just agreed to disagree on that one point and moved on to other topics, but it was also a prime example of how two people can disagree profoundly on one central ideological point and yet still have a reasoned, rational, calm discussion about it for multiple hours. >Legit questionWell first, I hardly see how that follows from the bit of mine you were quoting; I just said if you're going to pull a scandalous or absurd sounding sound-byte and pin it on someone you ought to give them a chance to explain it. As I proved with the many absurd sounding quotes I was able to pull from just a few days of your comments on Reddit, making someone sound crazy is quite easy if you want to go that route. Second, and to answer the actual question: yes, I think dismissing people on a probability based on partial evidence is a bad move. Don't you? I mean, say you were trying to have a reasoned discussion with someone on CMV later today and I butted in to your conversation saying to the other guy \"woah, don't listen to u/PreacherJudge, that dude is crazy; he claims he's an alien who has a secret fountain of youth and he advocates throwing babies\" (again, all actual quotes of yours); in that case, I think you'd be rather put-out if your discussion partner ceased talking with you because, based on the scant, context-less evidence I provided, you *might* be a horrible or crazy person. >This might actually be the central disagreement between us. I'm a bit mixed on that, really. Take the late Christopher Hitchens, for example; love him or hate him, the dude was a fantastic, enthralling orator who knew how to work a crowd. There were countless times I listened to his debates where I actually agreed more with his opponent, but since Hitchens was witty and amusing and personable compared to his pencil-necked, stuffy, asocial opponents, I (and the crowd) would often feel an urge to side with Hitchens instead of his more rational opponent. All things being equal, debate would be the *perfect* mechanism for determining superior ideas, but unfortunately some people have shitty ideas and superior rhetorical skills while others have great ideas and no good way to present, much less argue for, them; things aren't all equal. That said, what other mechanism would you propose? You and I are engaged in something of a debate right now. I don't feel one of us is mopping the floor with the other, but even if one of us was, what's the alternative? If not through discussion and debate, how else would we strive to make good ideas rise to the top? And even if you think it generally works except for a few bad actors, by what mechanism should we weed them out? You clearly think Peterson is a bad actor, but there are millions who don't... so how do we square your opinion that Peterson ought not debate with the opinions of others who think he should? >But this is another thing where what you actually believe is getting lost. Well two thoughts on this:1) Being a moderate, at least imho, doesn't mean you're straight down the center of every issue. I think it means you can pick and choose from both sides of the political spectrum, and, when needed, go straight down the center. But you don't *have* to. Yes, I have some views that are traditionally conservative. I think a lot of the hubub over gun control is nonsense, for example. That's a conservative opinion. But because I also support gay marriage, am pro-choice, etc., I can't find a home in the conservative party. Second, before we get into the weeds much further about just how real the potential threat of any given left-leaning group might be in regards to going full radical, can I ask if you even entertain that possibility? In short:- Do you think there's any group of people on the left who are at risk of becoming left-wing radicals?And:- Do you believe left-wing radicals have any threat potential at all (e.g. do you think if America were to become Communist a la the Soviet Union overnight, might that potentially be a bad thing for the citizens of America)? >What on earth does any of this have to do with having good political views?While I'm asking questions, might I also ask your approximate age? I'm harping on the capacity of 18 year olds to make overarching decisions about not just how they think, but how they think *other* people ought to think, and getting a visceral reaction from you, which makes me wonder if perhaps you're in the age range I've targeted. I ask because among folks, say, post-grad to ~50, it's rather a given that they think they were morons when they were 18. That view isn't exactly controversial to anyone who's not ~18. If you are in that view I didn't mean to offend; my line of work has put me in contact with a large number of highly intelligent, involved, and thoughtful youth who I often regard as far more competent than my similarly-aged peers, and just based on this interaction if you *are* in that age range you clearly fall into that category, but as a group those exceptions do little to nullify the general consensus that teenagers don't know what the hell they're talking about. >Wait, if they achieved a policy victoryJust because of the clear way the admin threw them a bone to shut them up and the activists, clearly not expecting a victory, mulled it over for a second... and then launched into other wild demands while still claiming (despite the concession made moments prior) that the admin were all racists opposed to the activists. The whole exchange just reminded me of worn out parents dealing with bratty children.\n", "summary": null, "top_ps": [0.949999988079071], "gens_article": ["Buffalo Wild Wings raised its 2012 second-quarter profit and revenue guidance as sales at its hot chicken wings franchises made an inroads in North America during the quarter.\nBuffalo Wild Wings raised its 2012 profit and revenue guidance as sales at its hot chicken wings franchises made an inroads in North America during the quarter.\nThe Las Vegas-based chain’s first-quarter earnings and revenue surged higher because of the popularity of its push wings, Buffalo Wild Wings said Wednesday in a release. It will report a second-quarter profit of $290 million, or 84 cents a share, versus a year-earlier profit of $62 million, or 7 cents a share.\nAnalysts polled by Thomson Reuters, on average, expected third-quarter earnings of 68 cents a share on revenue of $514.9 million.\nAfter a busy 2007, Buffalo Wild Wings was bought out by various private equity firms for $670 million in January 2008 after facing strong competition from Frito-Lay’s Chicken Wings and a deal with Hattiesburg, Mississippi-based Lamone.\nRevenue from Buffalo Wild Wings, one of the region’s largest wings chains, surged 7 percent during the quarter, due to increased sales at its franchises and a steady increase in restaurant traffic.\nThe company attributed that growth to the success of its wings business and sales on Buffalo Wild Wings’ mobile app, which launched in late 2007.\nThe sales were helped by a 12 percent rise in sales at Buffalo Wild Wings’ franchisees and a 15 percent gain at the restaurants that have been built after closing for renovations. Those customers earned a profit of 43 cents a share in the quarter, compared with a loss of $36 million in the year-earlier period.\nAnalysts had been expecting third-quarter earnings of 74 cents a share on sales of $376.3 million.\nSales at Buffalo Wild Wings restaurants open at least a year surged 12 percent in the quarter.\nBuffalo Wild Wings now expects net income of between $292 million and $345 million in fiscal 2012, compared with $280 million to $355 million a year ago.\n"], "gensraw_article": [[36475, 7336, 6184, 17331, 4377, 664, 2322, 1219, 13, 24386, 7631, 291, 6427, 11155, 356, 4201, 380, 664, 3025, 9016, 12099, 28089, 926, 282, 288, 21373, 288, 2259, 2254, 1142, 263, 3861, 14, 199, 36475, 7336, 6184, 17331, 4377, 664, 2322, 7631, 291, 6427, 11155, 356, 4201, 380, 664, 3025, 9016, 12099, 28089, 926, 282, 288, 21373, 288, 2259, 2254, 1142, 263, 3861, 14, 199, 465, 10124, 9622, 13, 3107, 6334, 448, 248, 83, 718, 13, 24386, 12043, 291, 6427, 36062, 2441, 781, 287, 263, 11534, 287, 664, 4575, 12099, 12, 14906, 6184, 17331, 532, 3584, 288, 258, 2651, 14, 633, 482, 990, 258, 1219, 13, 24386, 7631, 287, 721, 24370, 1511, 12, 394, 9509, 16060, 258, 2649, 12, 9052, 258, 615, 13, 452, 2506, 7631, 287, 721, 5238, 1511, 12, 394, 768, 16060, 258, 2649, 14, 199, 37703, 6449, 37699, 417, 32426, 8429, 12, 320, 2812, 12, 2939, 2369, 13, 24386, 12043, 287, 8258, 16060, 258, 2649, 320, 6427, 287, 721, 47397, 14, 25, 1511, 14, 199, 3261, 258, 8180, 4344, 12, 14906, 6184, 17331, 374, 5840, 504, 417, 2973, 2840, 13599, 9612, 330, 721, 43799, 1511, 288, 3270, 3649, 707, 6477, 1914, 5450, 423, 377, 39835, 13, 23764, 448, 248, 83, 16406, 17331, 291, 258, 1731, 352, 48510, 445, 7424, 12, 13798, 13, 3107, 10924, 506, 14, 199, 3042, 4081, 423, 14906, 6184, 17331, 12, 531, 287, 263, 3815, 448, 248, 83, 4388, 12099, 14660, 12, 36062, 768, 1412, 1142, 263, 3861, 12, 2234, 285, 3221, 4201, 380, 664, 28089, 291, 258, 11832, 2621, 288, 7073, 4980, 14, 199, 465, 1665, 14184, 327, 3350, 285, 263, 1944, 287, 664, 12099, 1598, 291, 4201, 320, 14906, 6184, 17331, 448, 248, 5176, 599, 12, 544, 5612, 288, 2740, 4344, 14, 199, 465, 4201, 548, 4194, 417, 258, 1106, 1412, 4486, 288, 4201, 380, 14906, 6184, 17331, 448, 248, 8664, 275, 291, 258, 1316, 1412, 4462, 380, 263, 10809, 327, 424, 588, 3171, 707, 9606, 330, 44482, 14, 5846, 4298, 7367, 258, 7631, 287, 5947, 16060, 258, 2649, 288, 263, 3861, 12, 3689, 352, 258, 2995, 287, 721, 2624, 1511, 288, 263, 615, 13, 452, 2506, 2279, 14, 199, 37703, 6449, 551, 588, 12452, 2369, 13, 24386, 12043, 287, 8916, 16060, 258, 2649, 320, 4201, 287, 721, 32129, 14, 19, 1511, 14, 199, 44491, 380, 14906, 6184, 17331, 10809, 1281, 380, 1552, 258, 615, 36062, 1106, 1412, 288, 263, 3861, 14, 199, 36475, 7336, 6184, 17331, 784, 13424, 2011, 3740, 287, 1023, 721, 32760, 1511, 291, 721, 27713, 1511, 288, 9069, 2322, 12, 3689, 352, 721, 21034, 1511, 285, 721, 28568, 1511, 258, 615, 2085, 14, 199, 50266]], "probs_article": [[6.336483056657016e-05, 0.5260862112045288, 0.007923527620732784, 0.998986542224884, 0.00264225946739316, 0.436481773853302, 0.005982046481221914, 0.0040118577890098095, 0.5672586560249329, 0.9979298114776611, 0.3514779210090637, 0.04476272687315941, 0.33025360107421875, 0.3272232711315155, 0.03904205933213234, 0.03480606898665428, 0.10244747251272202, 0.43919938802719116, 0.005275133531540632, 0.01828376017510891, 0.6483650803565979, 0.0029579016845673323, 0.0008827120764181018, 0.029295209795236588, 0.011367115192115307, 0.16127081215381622, 0.1877620667219162, 0.05216703936457634, 0.9203528761863708, 0.007491242606192827, 0.8587133288383484, 0.11177483201026917, 0.7964475750923157, 0.858975887298584, 0.036325979977846146, 0.9996205568313599, 0.9990689158439636, 0.9987398982048035, 0.1091880276799202, 0.9833827614784241, 0.8974062204360962, 0.011829284019768238, 0.9550348520278931, 0.9905097484588623, 0.9917452931404114, 0.749386191368103, 0.9796316027641296, 0.9939395189285278, 0.9984898567199707, 0.9943956136703491, 0.9740093946456909, 0.9996899366378784, 0.9901219010353088, 0.9967795014381409, 0.9983760118484497, 0.9991264939308167, 0.9999058246612549, 0.9987138509750366, 0.9977860450744629, 0.9989374279975891, 0.9996697902679443, 0.9993206262588501, 0.9909607768058777, 0.9793884754180908, 0.7801221013069153, 0.4561125338077545, 0.0018604784272611141, 0.9974138140678406, 0.6708970665931702, 0.9933692812919617, 0.2682669758796692, 0.024530034512281418, 0.9988963603973389, 0.999822199344635, 0.03077850677073002, 0.8557131886482239, 0.9801440834999084, 0.11423654854297638, 0.01854311302304268, 0.8932809233665466, 0.0013463335344567895, 0.0043210480362176895, 0.02014128491282463, 0.7346739768981934, 0.140823096036911, 0.0493011400103569, 0.9763286709785461, 0.6983093619346619, 0.0001188558671856299, 0.11995761096477509, 0.19595864415168762, 0.013420863077044487, 0.9777402877807617, 0.9982059001922607, 0.5192108750343323, 0.07550915330648422, 0.19152900576591492, 0.9137337803840637, 0.06319909542798996, 0.9280016422271729, 0.02063422091305256, 0.0019828209187835455, 0.1858157366514206, 0.016963167116045952, 0.25925496220588684, 0.9431382417678833, 0.9953771829605103, 0.5515044331550598, 0.48228201270103455, 0.6750598549842834, 0.0003472408570814878, 0.5768716335296631, 0.5744867324829102, 0.8157594799995422, 0.007663986645638943, 0.9969280362129211, 0.6010611653327942, 0.9112321138381958, 0.9076151847839355, 0.020157840102910995, 0.29812151193618774, 0.2773086726665497, 0.8948577642440796, 0.6236411929130554, 0.9996790885925293, 0.6702004075050354, 0.9947201013565063, 0.8815526366233826, 0.004263477865606546, 0.5681784152984619, 0.9936916828155518, 0.9981131553649902, 0.011283802799880505, 0.9954277276992798, 0.7257727980613708, 0.9981865286827087, 0.6422479152679443, 0.723020613193512, 0.06944695860147476, 0.9993849992752075, 0.27748361229896545, 0.9957218170166016, 0.6072667241096497, 0.9074556231498718, 0.025716988369822502, 0.8935907483100891, 0.9983344674110413, 0.998571515083313, 0.4130036532878876, 0.0015864020679146051, 0.9870482087135315, 0.997345507144928, 0.7283486127853394, 0.9666937589645386, 0.0215874332934618, 0.9987782835960388, 0.9353572130203247, 0.9996638298034668, 0.5032687783241272, 0.5107023119926453, 0.990013837814331, 0.9871434569358826, 0.0006105824722908437, 0.6559031009674072, 0.08565747737884521, 0.9984713196754456, 0.9669572114944458, 0.9105160236358643, 0.002633884083479643, 0.09728756546974182, 0.017008492723107338, 0.004504965152591467, 0.4661615192890167, 0.23869739472866058, 0.9982518553733826, 0.9996770620346069, 0.030553722754120827, 0.005445970222353935, 0.07385152578353882, 0.8043044209480286, 0.00010883913637371734, 0.08706221729516983, 0.8607403039932251, 0.716469407081604, 0.23364070057868958, 0.7357160449028015, 0.0017587196780368686, 0.9574271440505981, 0.510048508644104, 0.03253093734383583, 0.2942597270011902, 0.012496561743319035, 0.0019645076245069504, 0.02034371718764305, 0.7505318522453308, 0.673217236995697, 0.0006715015042573214, 0.5188961625099182, 0.8921566605567932, 0.9995438456535339, 0.2596833407878876, 0.9978760480880737, 0.9997110962867737, 0.01151847280561924, 0.5398711562156677, 0.30211663246154785, 0.019419794902205467, 0.005212144460529089, 0.18592049181461334, 4.0705082938075066e-05, 0.5549392104148865, 0.9703824520111084, 0.8225096464157104, 0.30599507689476013, 0.8901457190513611, 0.997159481048584, 0.00014047176227904856, 0.01092225220054388, 0.08198770135641098, 0.6171047687530518, 0.0036727956030517817, 0.9604954719543457, 0.11176436394453049, 0.5265360474586487, 0.988565981388092, 0.9998383522033691, 0.04374401271343231, 0.0033750878646969795, 0.9953279495239258, 0.7899379730224609, 0.004156383685767651, 0.9910627603530884, 0.9999436140060425, 0.9997690320014954, 0.3069157898426056, 0.15618127584457397, 0.37165752053260803, 0.936901330947876, 0.053216204047203064, 0.010962371714413166, 0.345022588968277, 0.04713569954037666, 0.9867336750030518, 0.5451390743255615, 0.20532961189746857, 0.0043672071769833565, 0.5158467888832092, 0.03912988677620888, 0.408202201128006, 0.36282873153686523, 0.640324056148529, 0.012876183725893497, 0.13029853999614716, 0.15221628546714783, 0.0017537929816171527, 0.28670376539230347, 0.906165599822998, 0.01623518392443657, 0.14260928332805634, 0.6066944599151611, 0.6213757395744324, 0.18360333144664764, 0.47672519087791443, 0.010532532818615437, 0.021849237382411957, 0.2523421049118042, 0.8910150527954102, 0.21825800836086273, 0.07039007544517517, 0.9812043309211731, 0.7124762535095215, 0.05462433770298958, 0.06003452464938164, 0.1514795869588852, 0.006600659340620041, 0.004668257664889097, 0.036249734461307526, 0.960702657699585, 0.9988337159156799, 0.6019144058227539, 0.9973249435424805, 0.006714606191962957, 0.40392494201660156, 0.3919711410999298, 0.6087009310722351, 0.04450024664402008, 0.581339955329895, 0.04685785993933678, 0.17965231835842133, 0.7413233518600464, 0.5681658387184143, 0.0946979895234108, 0.001712352386675775, 0.008627979084849358, 0.09532178938388824, 0.9098004102706909, 0.22537241876125336, 0.004956335294991732, 0.9045096635818481, 0.06987672299146652, 0.9764360785484314, 0.09612315148115158, 0.6088585257530212, 0.35379040241241455, 0.9739581346511841, 0.9996922016143799, 0.693162739276886, 0.9978570342063904, 0.04972146451473236, 0.525913655757904, 0.06442581117153168, 0.3849843144416809, 0.038283124566078186, 0.9823930263519287, 0.04327757656574249, 0.23718872666358948, 0.06717589497566223, 0.01251768134534359, 0.14392881095409393, 0.03200168535113335, 0.2034422755241394, 0.0060088178142905235, 0.007714007515460253, 0.004901102278381586, 0.00945059023797512, 0.2398766130208969, 0.6546866297721863, 0.0067993039265275, 0.00613771565258503, 0.0019189503509551287, 0.09976205229759216, 0.03192634508013725, 0.7247956395149231, 0.0021896895486861467, 0.9896206855773926, 0.9028432369232178, 0.9558869004249573, 0.11781742423772812, 0.9682639241218567, 0.6521633267402649, 0.49698853492736816, 0.25783446431159973, 0.7732818126678467, 0.24998590350151062, 0.3226732909679413, 0.9806398749351501, 0.12659862637519836, 0.004988220985978842, 0.5133009552955627, 0.06830837577581406, 0.8537508249282837, 0.3801422119140625, 0.9867367148399353, 0.5748564600944519, 0.9999039173126221, 0.7781890630722046, 0.9084643125534058, 0.9381128549575806, 0.01863931305706501, 0.9992504715919495, 0.17267821729183197, 0.0497470498085022, 0.5298881530761719, 0.0655747801065445, 0.9930524230003357, 0.9988853335380554, 0.742466390132904, 0.9486658573150635, 0.01695260778069496, 0.9985020160675049, 0.8854957818984985, 0.9994551539421082, 0.749006450176239, 0.057952798902988434, 0.987785816192627, 0.9600894451141357, 0.0009071259992197156, 0.6809072494506836, 0.10044675320386887, 0.9994966983795166, 0.8430835604667664, 0.8830713033676147, 0.012794733047485352, 0.6430476307868958, 0.8116623759269714, 0.9972586631774902, 0.9999306201934814, 0.11599323153495789, 0.6322990655899048, 0.9051435589790344, 0.9984221458435059, 0.5992270112037659, 0.9907945990562439, 0.01645308919250965, 0.04106156527996063, 0.8637750744819641, 0.1447315663099289, 0.9238049387931824, 0.5961605310440063, 0.17809493839740753, 0.446344256401062, 0.28888630867004395, 0.9997592568397522, 0.9882556200027466, 0.9998032450675964, 0.010633223690092564, 0.7679567337036133, 0.014771335758268833, 0.672772228717804, 0.5424807667732239, 0.12871064245700836, 0.6770679354667664, 0.001634892076253891, 0.864564836025238, 0.8595048785209656, 0.9905009269714355, 0.01661127246916294, 0.9961724877357483, 0.11298628896474838, 0.07442004233598709, 0.716031551361084, 0.6875680088996887, 0.27241629362106323, 0.9747872948646545, 0.09679633378982544, 0.022192655131220818, 0.8828826546669006, 0.30199703574180603, 0.9970299005508423, 0.026506071910262108, 0.9944986701011658, 0.28672584891319275, 0.9976958632469177, 0.6691119074821472, 0.9228635430335999, 0.6210998892784119, 0.09745277464389801]]}
{"url": "", "domain": "", "title": "", "authors": [], "publish_date": "03-32-7184", "text": "Alcohol has 0 MEDICINAL VALUE. AT ALL. Cannabis treats a plethora of issues for many many people. For me, I am on blood thinners and cannot take lots of pain medication at a time due to risk of internal bleeding, I am stuck using tylenol for pain or prescriptions. Cannabis actually helps with my agoraphobia and relaxes my anxiety instead of raising it. Also I am having a decently major surgery next year and the surgeon told me I could use cannabis for post care pain 24 hours after using heavy addictive habit forming prescriptions. And I am definitely doing that. I HATE prescribed pain killers. They have purpose for temporary uses but long term NO. I was in a bad accident last year and just weened off Tramadol from being on it for like 7-8 months straight. I am a high functioning person that uses cannabis daily. In fact I'm so all over the place my wife has decided to just have me stay at home instead of work. I know people who actually drink alcohol AT WORK. How messed up is that? And employers tout the people who smoke weed are gonna be any more dangerous than the people who drink. It's ridiculous. I can't wait for most people that are skeptics to have that \"aha\" moment or have the light bulb finally turn on upstairs. Without cannabis many things in existence would not be here like music, art, movies, innovations. In fact if you knew how many people I do that do worse and are in professions like medicine I think your opinion would change. LSD25 is amazing in microdosing for your brain. Without consuming LSD for instance the front part of the brain is cut of of circulation. After consuming LSD this part of the brain opens up and lets the blood flow, which is also the creative parts of the brain. I have never been more on point with everyday things I would not have without microdosing. This probably wouldn't even be a conversation. Cannabis is here to stay and is becoming legal in more and more states as we keep heading towards common sense. We don't even allow alcohol at our house because it's a worthless thing to consume, even once in awhile. My wife almost has her Phd so we are definitely different in our aspects of life. She doesn't use but has no cares in the world that I do. I have been an active advocate for legalizing cannabis since I was 13. It didn't sit well with anyone around me especially in school when they were saying no to drugs and I'm like um, cannabis is not addictive, it's not a typical drug like over the counter and much safer on the body and mind. Not to mention I'm super skinny and getting stoned helps me actually eat fuller meals. So for me, smoking daily makes my life better, not a problem.&#x200B;:) Have a great weekend! I'll take an extra hit for you!\n", "summary": null, "top_ps": [0.949999988079071], "gens_article": ["Winter storm warning and watches issued through Thursday for Tuscaloosa, Prince George, Oakland, Montgomery, Jefferson, Bibb, Monterey, St. Mary, Los Angeles, Black Hawk, Portland, Clearwater, Pacific, Portland, North Shore, Ripley, Burlington, Devon, Avalon, San Antonio, Point Reyes, Alhambra, Malibu, Paradise, Orangewood, Fresno, Mesa, Monterey, California, and East Bay.\n* Action maps and weather warnings are due out across Central and Southern California Thursday. For more information, click here.\n* Highs fall into the 30s.\n* Cooler temperatures will bring warm relief to the LA basin.\n• Tracking a potentially damaging winter storm. Details: MDStormbright%7200754.2500&p=WT1334mJ456/wpxk6\n* Central Valley mountains may be cold in the valley during the afternoon.\n• Atlantic air mass slows. Enjoy the snows and crisp snow!\n• Snowfall temperatures in the 20s and 30s, reaching highs in the 30s and 40s.\nNews and Weather Highlights:\n-Heavy snowfall expected, resulting in significant downed trees and power outages. Please take cover while shoveling.\n- No major road closures.\n- Surf from water down into the mountains. Most are unconfirmed at this time.\n- Yes, traffic and snowing advisories are in effect. Roads will require a limited amount of travel time.\nSource: The Sierra Monitor\nDownload the story from the NOAA Stormbright%720050airp | NOAA Stormbright%720010159.\n"], "gensraw_article": [[35377, 6389, 6510, 291, 16861, 4885, 833, 3636, 330, 310, 16242, 7336, 8547, 12, 9006, 4503, 12, 12370, 12, 21533, 12, 15376, 12, 43279, 66, 12, 5576, 48024, 12, 521, 14, 5336, 12, 5402, 5653, 12, 2620, 26699, 12, 10728, 12, 11460, 7051, 12, 8212, 12, 10728, 12, 2259, 25760, 12, 29497, 1637, 12, 37091, 12, 36890, 12, 39601, 12, 2987, 11367, 12, 6253, 40600, 12, 979, 2764, 16058, 12, 4435, 33829, 12, 20495, 12, 1472, 649, 414, 703, 12, 39928, 12, 26671, 12, 5576, 48024, 12, 3443, 12, 291, 3688, 4697, 14, 199, 10, 7562, 8740, 291, 6194, 14602, 390, 2234, 504, 1974, 5695, 291, 8051, 3443, 3636, 14, 1115, 518, 1322, 12, 3905, 995, 14, 199, 10, 3335, 83, 2122, 657, 263, 1543, 83, 14, 199, 10, 15227, 264, 10102, 482, 2223, 5815, 8260, 285, 263, 9132, 34165, 14, 199, 3582, 37170, 258, 6197, 14791, 7375, 6389, 14, 14891, 26, 10671, 32174, 29200, 5, 23, 2168, 41875, 14, 44689, 6, 80, 29, 39387, 1486, 2683, 77, 42, 20, 3981, 15, 24143, 88, 75, 22, 199, 10, 5695, 6917, 12270, 744, 308, 4693, 288, 263, 19273, 1142, 263, 6673, 14, 199, 3582, 10597, 1634, 2348, 33020, 14, 18180, 263, 3014, 1667, 291, 23454, 6730, 1, 199, 3582, 7968, 7208, 10102, 288, 263, 1161, 83, 291, 1543, 83, 12, 8979, 28228, 288, 263, 1543, 83, 291, 2320, 83, 14, 199, 9981, 291, 15616, 30777, 26, 199, 13, 33211, 6730, 7208, 2939, 12, 7187, 288, 2384, 42282, 7151, 291, 1177, 504, 1096, 14, 4223, 1012, 3003, 982, 33678, 279, 14, 199, 13, 1401, 1689, 2976, 32150, 14, 199, 13, 43772, 423, 1661, 867, 657, 263, 12270, 14, 4043, 390, 556, 36350, 380, 429, 641, 14, 199, 13, 3364, 12, 4980, 291, 6730, 279, 8504, 1750, 390, 288, 1246, 14, 40066, 482, 2422, 258, 3615, 2034, 287, 3068, 641, 14, 199, 7417, 26, 384, 17560, 18290, 199, 10003, 263, 1622, 423, 263, 36185, 8866, 29200, 5, 23, 2168, 1121, 959, 80, 931, 36185, 8866, 29200, 5, 23, 2168, 941, 19708, 14, 199, 50266]], "probs_article": [[0.00013066138490103185, 0.04944572225213051, 0.13260966539382935, 0.0207847710698843, 0.20944269001483917, 0.1212802454829216, 0.013968211598694324, 0.05260959640145302, 0.17139512300491333, 0.0014299872564151883, 0.33182522654533386, 0.8496351838111877, 0.9999681711196899, 0.7110889554023743, 0.0005356837646104395, 0.5550531148910522, 0.4068482220172882, 0.0003935905115213245, 0.677347719669342, 0.07055913656949997, 0.6548976302146912, 0.02238593064248562, 0.718557596206665, 0.00021071144146844745, 0.9416131973266602, 0.770664393901825, 0.001812612172216177, 0.3890478312969208, 0.7879271507263184, 0.010765479877591133, 0.8582711815834045, 0.0842103660106659, 0.3437618911266327, 0.004173211753368378, 0.8419700264930725, 0.8325670957565308, 0.00021405398729257286, 0.24234126508235931, 0.8057209849357605, 0.0022987383417785168, 0.8557001352310181, 0.0007241211133077741, 0.8572306632995605, 0.8609402775764465, 0.0024212896823883057, 0.07661225646734238, 0.008412939496338367, 0.7539733052253723, 0.0022485011722892523, 0.022573305293917656, 0.7974129319190979, 6.171464337967336e-05, 0.7394622564315796, 0.7994210720062256, 0.0005535892560146749, 0.8620699048042297, 6.997070886427537e-05, 0.7385819554328918, 0.00012169845285825431, 0.8925837874412537, 0.014188481494784355, 0.1316947638988495, 0.8914079666137695, 0.0016553658060729504, 0.12420395016670227, 0.8098450899124146, 0.002668933942914009, 0.014774217270314693, 0.9995957016944885, 0.9304762482643127, 0.0007152312318794429, 0.9690845608711243, 0.9243186712265015, 0.001032886328175664, 0.3839680552482605, 0.00034340977435931563, 0.3911951780319214, 0.9635313749313354, 0.9994350075721741, 0.8929827809333801, 0.0010573596227914095, 0.8977444767951965, 0.0007586268475279212, 0.8991115093231201, 0.02084365487098694, 0.9518928527832031, 0.8677066564559937, 0.002645923988893628, 0.7840030789375305, 0.0863613411784172, 0.0008038723608478904, 0.585988461971283, 0.6138217449188232, 0.4051317274570465, 0.011513584293425083, 0.00012851381325162947, 0.0033429027535021305, 0.09985489398241043, 0.07711663097143173, 0.016135942190885544, 0.3665821850299835, 0.007354600355029106, 0.13553528487682343, 0.004560253582894802, 0.013632633723318577, 0.4493730366230011, 0.26153019070625305, 0.9476757645606995, 0.04943270981311798, 0.1872113049030304, 0.013174074701964855, 0.22608882188796997, 0.6353244185447693, 0.4948561191558838, 0.10064519941806793, 0.8769760131835938, 0.8252820372581482, 0.9359267950057983, 0.6952220797538757, 0.0072963726706802845, 0.4272587299346924, 0.0015979827148839831, 0.29391640424728394, 0.9704670906066895, 0.058387309312820435, 0.9603955149650574, 0.023565514013171196, 0.41939643025398254, 0.9323645830154419, 0.007280654739588499, 0.6405660510063171, 0.1609484702348709, 0.13769973814487457, 0.008488927967846394, 0.0031294268555939198, 0.006486677564680576, 0.38525649905204773, 0.31361669301986694, 9.470785880694166e-05, 0.012095740996301174, 0.34193331003189087, 0.4545930325984955, 0.0008524099830538034, 0.0017651874804869294, 0.07957698404788971, 0.002279140753671527, 0.03382757678627968, 0.26990485191345215, 0.9650657176971436, 0.0883563980460167, 0.005145032424479723, 0.0646313801407814, 0.0001925396645674482, 0.0302647165954113, 0.00010540369839873165, 7.140326488297433e-05, 0.025470348075032234, 0.0038589525502175093, 5.207649155636318e-05, 0.1483580321073532, 2.4803754058666527e-05, 0.007957641035318375, 0.008551716804504395, 0.06210026517510414, 0.010138576850295067, 0.0024538899306207895, 0.003349730046465993, 0.0007119617657735944, 0.0035266035702079535, 0.011219581589102745, 0.0001803846680559218, 0.006351102143526077, 0.0022932749707251787, 0.014624898321926594, 0.0034935362637043, 0.023849671706557274, 0.020279165357351303, 0.09128212928771973, 0.0019883685745298862, 0.0177332554012537, 0.0006641813088208437, 0.04003264382481575, 0.09005940705537796, 0.016099613159894943, 0.008773709647357464, 0.3966345489025116, 0.0014358287444338202, 0.011546759866178036, 0.5289273858070374, 0.06189824268221855, 0.3521978557109833, 0.29723045229911804, 0.47975239157676697, 0.0015146754449233413, 0.004357267636805773, 0.08500415086746216, 0.0013870976399630308, 0.05052753910422325, 0.00014639781147707254, 0.22412759065628052, 0.0003483146138023585, 0.9509358406066895, 0.20311953127384186, 0.0028134239837527275, 0.0046796854585409164, 0.03612528741359711, 0.5597342252731323, 0.630337119102478, 0.06340495496988297, 0.0960894450545311, 0.0008314910810440779, 0.12166759371757507, 0.7663523554801941, 0.02507941424846649, 0.9601793885231018, 0.24189530313014984, 0.7573269605636597, 0.9992256164550781, 0.03143559768795967, 0.002177516231313348, 0.05929555743932724, 0.582838237285614, 0.9586755037307739, 0.2543320059776306, 0.9920430779457092, 0.36946582794189453, 0.36568641662597656, 0.9993940591812134, 0.3880422115325928, 0.623553991317749, 0.00020813799346797168, 0.07026161998510361, 0.3329370617866516, 0.015475747175514698, 0.2692345380783081, 0.8790650963783264, 0.006637566722929478, 0.0021645473316311836, 0.664571225643158, 0.2529136836528778, 0.0490720197558403, 0.01775987818837166, 0.003637850284576416, 0.966966986656189, 0.0074119544588029385, 0.00621880404651165, 0.574551522731781, 0.3633703291416168, 0.7223276495933533, 0.6596325039863586, 0.9998928308486938, 0.6326141953468323, 0.0020554098300635815, 0.04909772053360939, 0.02477421797811985, 0.017987100407481194, 0.0372021459043026, 0.9225912094116211, 0.26004892587661743, 0.6755996942520142, 0.8855814337730408, 0.0012393281795084476, 0.12618444859981537, 0.03729058429598808, 0.7895172238349915, 0.2514505982398987, 0.45452043414115906, 0.7985512614250183, 0.00025343458401039243, 0.0028427080251276493, 0.0009220100473612547, 0.00767205934971571, 0.022293448448181152, 0.5208264589309692, 0.05923685058951378, 0.5020594596862793, 0.0022848520893603563, 0.006843723356723785, 0.0021388991735875607, 0.03587481752038002, 0.05031033605337143, 0.9752568006515503, 0.8416458964347839, 0.8759459853172302, 0.7151435613632202, 0.7131692171096802, 0.00016144101391546428, 0.766537606716156, 0.0016559924697503448, 0.012575696222484112, 0.0893644168972969, 0.002481791889294982, 0.019281206652522087, 0.9996225833892822, 0.42762869596481323, 0.765601634979248, 0.8246804475784302, 0.30178698897361755, 0.005961036309599876, 0.14924949407577515, 0.0007929505663923919, 0.06953635066747665, 0.00375854829326272, 0.3664727807044983, 0.9983294606208801, 0.2967633306980133, 0.550014853477478, 0.6562578082084656, 0.738237738609314, 0.0012385416775941849, 0.9807533621788025, 0.022017648443579674, 0.005765638779848814, 0.03377398103475571, 0.6190614700317383, 0.0027973942924290895, 0.36491554975509644, 0.0011582521256059408, 0.10860008001327515, 0.3129793703556061, 0.005101233255118132, 0.09178872406482697, 0.2045159488916397, 0.5221525430679321, 0.9704265594482422, 0.9630036354064941, 0.00017113503417931497, 2.3554004656034522e-05, 0.0033705015666782856, 0.0004063368251081556, 0.06476035714149475, 0.6756617426872253, 0.9795081615447998, 0.9875275492668152, 0.9471216201782227, 0.907244861125946, 0.008706792257726192, 0.00023767030506860465, 0.18954415619373322, 0.6273452639579773, 0.47734901309013367]]}
