{"url": "usasupreme.com/belfast-christian-bakers-sued-not-making-gay-marriage-cake/", "domain": "usasupreme.com", "title": "", "authors": ["Natalie D."], "publish_date": "05-22-2017", "text": "No one should be forced into making anything or doing anything against their beliefs! Sadly, Christian bakers Daniel and Amy McArthur from Northern Ireland were taken to court when they refused to make a cake for a gay wedding with a gay marriage slogan. The owners of Belfast-based Ashers Bakery declined an order placed by gay activist Gareth Lee for a cake with a pro-gay marriage slogan, claiming the message was inconsistent with their deeply held religious beliefs. Through the legal proceedings, Asher’s manager Daniel McArthur insisted Mr. Lee’s sexuality was never an issue, rather the message he wanted the bakery to create. If equality law means people can be punished for politely refusing to support other people’s causes, then equality law needs to change,”-Mr. McArthur said. This ruling undermines democratic freedom. It undermines religious freedom. It undermines free speech. He added: What we refused to do was to be involved with promoting a political campaign to change marriage law in Northern Ireland.” “Because we’re Christians, we support the current law and we felt that making this cake would make us responsible for its message.” “We wouldn’t decorate a cake with a pornographic picture or with swear words. We wouldn’t even decorate a cake with a spiteful message about gay people because to do so would be to endorse and promote it.” He added: “In the meantime, other businesses will have to take advice about whether they have to refuse orders that conflict with their conscience or whether they have to be coerced as well into promoting other people’s views.” But unfortunately, the judge ruled against them and didn’t accept their defense that making this cake would go against their religious beliefs. The rights of the customer to demand any type of cake trumped their right to practice their religion in their own business. However, this hasn’t impacted their profits. The couple has seven outlets throughout the UK and the Republic of Ireland. And their 2016 profits were almost $300,000 higher than the prior years. They may have lost in court, but standing up for their rights and principles apparently has been good for their business! What happened to: “we have the right to refuse service to anyone.” I don’t want anyone mistreated but I don’t think that you should be able to sue for standing for a religious belief. You want to be except for what you believe but you are willing to take that right away from others who don’t support your lifestyle.", "summary": null}
{"url": "commondreams.org/news/2012/04/03/same-sex-couples-challenge-defense-marriage-act", "domain": "commondreams.org", "title": "", "authors": ["Common Dreams staff"], "publish_date": "04-03-2012", "text": "The Defense of Marriage Act, a 1996 law which defines marriage as between a man and a woman, is being challenged in a lawsuit by five same-sex couples. The couples, working with Immigration Equality, a gay rights group that focuses on immigration, brought the case before US District Court yesterday. They argued that the Defense of Marriage Act discriminates against non-citizens in same-sex marriages who might wish to gain legal residence in the US. Salon's Glenn Greenwald, who is forced to live in Brazil with his same-sex partner as a result of the Defense of Marriage Act, said \"[t]his is one of those injustices so extreme and indefensible that it’s difficult, at least for me, to avoid high levels of anger when discussing, and it’s even more difficult to understand how any person could favor its continuation.\" Five same-sex couples challenged a U.S. law barring the federal government from recognizing gay marriages, saying its impact is harsh on non-citizens' spouses. The lawsuit challenging the 1996 Defense of Marriage Act, was filed Monday by Immigration Equality in U.S. District Court for the Eastern District of New York. \"I'm a citizen of this country just like anybody else,\" Heather Morgan, 36, a plaintiff in the lawsuit with her spouse, Maria del Mar Verdugo Yanez, who is from Spain, told The New York Times. \"I'm very proud of this country. I don't want to feel like I have to leave here in order to be with the person I love. I shouldn't have to choose.\" Most of the immigrants have been in the United States legally on temporary visas that will expire soon, the Times said. Under immigration law, a citizen can apply for a foreign spouse to gain legal permanent residency, experts said. However, federal authorities do not recognize same-sex marriages under DOMA, leaving same-sex couples with the choice of deportation for the immigrant or exile for the American. Immigration Equality Executive Director Rachel Tiven said the organization urged federal officials to suspend deportations of immigrants in same-sex marriages as court challenges to DOMA worked through the legal system, but the authorities declined, prompting the lawsuit, the Times said. In February 2011, the Obama administration announced that it considered the key provision of the Defense of Marriage Act unconstitutionally discriminatory, and that officials no longer would defend it in the courts. Five legally married same-sex couples filed a lawsuit on Monday to challenge the 1996 law that bars the federal government from recognizing same-sex marriages, arguing that its impact is particularly harsh on couples that include an American citizen and a foreigner.", "summary": "Gay rights group brings lawsuit; claims DOMA treats non-citizens unfairly"}
{"url": "foxnews.com/us/oregon-bakery-owners-pay-more-than-135g-in-damages-over-refusal-to-make-cake-for-gay-wedding", "domain": "foxnews.com", "title": "", "authors": ["Fox News"], "publish_date": "12-29-2015", "text": "The owners of an Oregon bakery who denied service to a same-sex couple have paid more than $135,000 in state-ordered damages – months after refusing to do so – according to state officials Monday. Aaron Klein, co-owner of Sweet Cakes, by Melissa, dropped a check off for $136,927.07, according to the Bureau of Labor and Industries. The payment includes interest. Klein also paid $7,000 earlier this month. Damages were award in July for emotional suffering caused by the bakery which refused to make a wedding cake for Laurel and Rachel Bowman-Cryer more than two years ago. The bakers said they refused to make the cake because of their religious beliefs. The dispute goes back to January 2013 when Bowman-Cryer came into the shop with her mother for a cake-tasting appointment. However, Aaron Klein told the women that the bakery didn’t do cakes for same-sex weddings. The women filed complaints with the state and triggered a national debate over claims of religious beliefs against anti-discrimination laws. Labor Commissioner Brad Avakian awarded the damages nearly six months ago, saying the owners had violated the women’s civil rights by discriminating on the basis of their sexual orientation. They were also slapped with a gag order that prohibited them from speaking publicly about their refusal to participate in or bake wedding cakes for same-sex marriages. Aaron and his wife Melissa filed an appeal of the ruling and were defying the order to pay the damages before Monday. Tyler Smith, an attorney representing the Kleins, told The Oregonian that his clients have not abandoned their appeal of Avakian’s order. Smith said it was in their clients’ best interests to pay now rather than wait for the appeal date, which is slated for next year. The Oregonian reported the state has received a total of $144,000 from the Kleins. Charlie Burr, an agency spokesman, told the paper the payment might be more than what they owe. \"We have been in touch with their lawyers throughout the process,\" Burr said. The amount might differ because of the accruing interest, according to the paper. A 2007 Oregon law protects the rights of gays, lesbians, bisexual and transgender people in employment, housing and public accommodations. The state ruled it also bars private businesses from discriminating against potential customers.", "summary": null}
{"url": "huffpost.com/entry/same-sex-marriage-laws-lgbt-teen-suicide-attempts_n_58ac934ae4b02eb3a982e288", "domain": "huffpost.com", "title": "", "authors": ["Anna Almendrala"], "publish_date": "02-22-2017", "text": "Living in a community that recognizes gay marriage can improve the mental health of all teens, according to a new study. State marriage equality laws enacted in the years before the 2015 Supreme Court ruling were linked to lower rates of suicide attempts among all high school students but especially among teens who identified as gay, lesbian, bisexual or unsure. Ultimately, the researchers found, for every year that same-sex marriage laws were in place, 134,000 fewer teens attempted suicide. This is noteworthy because queer teens are more than four times as likely to attempt suicide as their straight peers. While the study doesn’t demonstrate that these laws actually caused a reduction in suicide attempts, lead study author Julia Raifman theorized that having equal protection under the law may account for much of the change. “These are high school students so they aren’t getting married any time soon, for the most part,” said Raifman, a post-doctoral fellow at the Johns Hopkins University Bloomberg School of Public Health, in a statement about her research. “Still, permitting same-sex marriage reduces structural stigma associated with sexual orientation. There may be something about having equal rights ― even if they have no immediate plans to take advantage of them ― that makes students feel less stigmatized and more hopeful for the future.” Raifman’s theory is an important measure in this new political climate. Same-sex marriage is now federal law, thanks to the 2015 Supreme Court case Obergefell v. Hodges, but there are worrying signs that Republican politicians may start to undermine the right to marriage and LGBTG protections in general, both at the state and federal levels. Studies like this one show that equal marriage rights benefit those who want to marry someone of the same gender but also improve mental health for everyone, especially queer teens. “Policymakers need to be aware that policies on sexual minority rights can have a real effect on the mental health of adolescents,” she concluded. “The policies at the top can dictate in ways both positive and negative what happens further down.” Before 2015, only 35 states had legalized same-sex marriage. During this era, Raifman surveyed nearly 800,000 students of all sexual orientations from 1999 to 2015 about suicide attempts both before and after 32 states had legalized same-sex marriage. She also compared teen suicide attempts in states that legalized marriage to those in states that didn’t. Before the passage of same-sex legislation, nearly 9 percent of all teens and nearly 29 percent of queer-identifying teens had attempted suicide.", "summary": "Tolerant societies have healthier, happier citizens. Period."}
{"url": "reddit.com/r/changemyview/comments/6k968d/cmv_i_do_not_respectunderstand_people_who_are/", "domain": "reddit.com/r/changemyview", "title": "", "authors": ["ShiningConcepts"], "publish_date": "06-29-2017", "text": "I do not respect these people. It's not their place to tell a pair of consenting adults that they have no right to get married. The only reason I know of is religious opposition. One, that is not secular. Two, you already selectively interpret your High and Holy Book as it is. If you are against gay marriage, as a significant number of people still are, I do not respect/understand your position and I consider your position unreasonable. Now let's be clear with the wording of this post. I am not asking you to convince me to be against gay marriage; that's highly unlikely to happen (not even Rule B-compliant tbh). I am asking you to convince me to understand that anti-gay marriage people come from a legitimate place, and that smart and sensible people can have different opinions on it. It's kind of like abortion -- I am pro-choice, but I can understand where the pro-lifers of the world are coming from, and I can say that I respect/understand their opinion however much I disagree with it. Or even with things like immigration, healthcare, and taxes -- I may disagree with the other side, but I can understand that it is an issue that reasonable people will disagree on. But I don't see how a reasonable person can disagree with gay marriage. Now, it's one thing if a private Church was being forced to perform gay marriages against it's will, or if a private Christian school was being forced to teach about birth control and homosexuality in sex ed against it's will; I can't condemn protesting against that. But when you are fighting against the rights of private individuals who have no impact on your lives getting married, you are putting forth an unreasonable position that I have no sympathy, respect or understanding for. Since a significant part of the country disagrees with me on this I would love to have this view changed because I feel like I am missing something.", "summary": null}
{"url": "reddit.com/r/changemyview/comments/7dhhky/cmv_there_is_no_biblical_reason_to_oppose_gay/", "domain": "reddit.com/r/changemyview", "title": "", "authors": ["SurprisedPotato"], "publish_date": "11-16-2017", "text": "The Biblical arguments I have heard against gay marriage go something like this: certain passages in Leviticus are quoted, pointing out that under the Old Testament law, homosexual acts were punishable by death certain New Testament passages are pointed out, for example, where Paul explains that because societies forget God, he gives them up to \"unnatural acts\" for example, homosexual sex. My point of view: this is not a sufficient argument to show that one should oppose changes in the legal definition of marriage, even if one accepts that homosexual acts are condemned. My reasons: The questions \"should I allow myself to do X\" and \"should I allow others to do X\" are separate moral questions. The Bible often draws this distinction - in fact, Christians who feel compelled for religious reasons to impose dietary restrictions on themselves are explicitly warned not to try to impose them on others. It does not automatically follow, even if you are certain that gay sex is wrong, that it is your personal mission to prevent others from engaging in it. The questions \"Should I allow other Christians to do X\" and \"Should I allow unbelievers to do X\" are, in Biblical ethics, separate moral questions. For example, believers are warned to separate themselves from people who claim to be Christians but engage in sexual immorality, but in the same passage told that it's fine to be friends with sexually immoral unbelievers. Therefore, it does not automatically follow that convictions about God's opinion on gay, sexually active Christians has anything at all to do with how you should treat gay, sexually active non-Christians. Thirdly, the Bible says nothing explicit about homosexual marriage. It may be something that the early Christians never thought of (though one would presume God knew about the issue). The Biblical arguments about same-gender marriage, generally, derived from passages stating that God ordained marriage, and the wording of these passages indicate two different genders. Also, since marriage is a metaphor for the relationship between Christ and the church (this is in the Bible), marriage is a holy institution (this is also in the Bible), and therefore should not be \"split apart\". However, this has little to do with how secular governments define marriage - in the context of those passages, the Bible is specifically condemning divorce between Christians. In fact, the Bible even permits a believer, abandoned by an unbelieving spouse, to remarry (\"the brother or sister is not bound in such circumstances\" 1 Cor 7:15).", "summary": null}
{"url": "reddit.com/r/unpopularopinion/comments/9mht9v/same_sex_marriage_is_not_real_marriage/", "domain": "reddit.com/r/unpopularopinion", "title": "", "authors": ["Striker1435"], "publish_date": "10-08-2018", "text": "I was raised as a Christian conservative. Also, I'm not some backwoods hillbilly that has never been exposed to alternate lifestyles. I'm a well educated faculty member at one of the top tier academic institutions in my area (and get exposed to all sorts of people with different backgrounds as a result). I have always been taught that marriage is between one man and one woman as God intended. I do not hate gay people at all. I have met some pretty awesome gay people before. What I hate is the attempt to place same sex marriage and traditional marriage on the same level as if they are the same thing. They aren't. I also don't agree with the argument that \"everyone should have the right to marry who they love\". No. You don't have that right. Love is only one factor in marriage. It isn't the only factor. Just because a 15 year old high school student and their teacher fall in love doesn't give them the right to marry. I'm also sure there are weirdos out there who fall in love with a family member. That doesn't give them the right to get married. Marriage is about love, yes. But it's also about being productive members of society and building a healthy biologically created nuclear family unit. Same sex marriages cannot do that for society. It's only second best. It's also not about \"equal rights\". Gay people have the exact same rights that straight people do. A gay man has the same right to marry a woman that a straight man has. Redefining marriage is an additional right that straight people are not given. If I as a straight man do not have the right to redefine marriage, a gay man shouldn't be given that right either.", "summary": null}
{"url": "usasupreme.com/father-train-asking-gang-stop-smoking/", "domain": "usasupreme.com", "title": "", "authors": ["Alex D."], "publish_date": "08-02-2017", "text": "Many of us have become inured to the presence of violence. Its ubiquity in the news and, for some of us, in our own neighborhoods has numbed us to the shock of this largely preventable condition. The video below offers a sobering reminder of the reality of the costs of violence–financial, human, physical and emotional. We have a violence problem in America. But not from real Americans who are patriots and love their country, usually the violence is conducted by some low scums and thugs who should have their citizenships removed! Kennan Jones was the latest victim of a behavior like this he was attacked by a black gang on Sunday as they rode towards Deep Ellum in Dallas, Texas. He had asked them to stop smoking marijuana on the Dallas Area Rapid Transit train. The group included young men and women who punched him and threw him against the train’s doors before arriving at the station. Some of them pushed off the handle poles to kick Jones from the air. A fellow passenger filmed the attack and shared the footage with DFW, CBS’s local station in Texas. In the video, at least one other passenger tries to intervene but it slapped away. Jones was taken to hospital after the incident but has since been released. He had visible facial injuries when he spoke to the network. Everything just went from 0 to 100. I’m just very happy to be here… happy to hug my kids,’ he said. The man said he tried to recoil during the attack and told the gang: ‘OK, OK. Y’all win,’ but they persisted. That is despicable behavior. The man should not have asked them to stop smoking but should have reported it to the Police. These people are vile and scum. Hope they get caught and put inside. Hope the man gets better soon.", "summary": null}
{"url": "commondreams.org/news/2019/04/17/prohibition-only-ends-once-421-all-group-takes-aim-cannabis-criminal-justice-reform", "domain": "commondreams.org", "title": "", "authors": ["Eoin Higgins"], "publish_date": "04-17-2019", "text": "Activists are taking advantage of the day after the country's biggest weed holiday to spread a message of diversity, inclusion, and restorative justice as legalization at the state and federal level increasingly becomes the law of the land. A new group, 421 For All, aims to use the day after 4/20—a national day to enjoy marijuana products—to promote what organizer Sky Cohen, a New York-based event promoter and activist, called \"equitable growth in the industry.\" \"Prohibition only ends once,\" said Cohen. \"We want to make sure that our intervention encourages policy that guarantees access to those who have been historically criminalized.\" The push for a more equitable marijuana industry begins with the legalization process, 421 For All founder Cristina Buccola told Cannabis Now Wednesday, but shouldn't end there. \"Cannabis legalization all too frequently omits meaningful criminal justice reforms, fails to repair communities that have borne the brunt of prohibition, doesn’t require diverse economic, ownership and educational opportunities, and forgets to protect patients’ rights and our environment,\" said Buccola. The group will kick off its inaugural fundraising event on April 21 at New York's Chelsea Music Hall. \"The event is going to be a mixture of spoken presentation from our beneficiary organizations and music from local talent,\" said Cohen. \"The event will be hosted by Mike Glazer and Mary Jane from Weed + Grub Podcast.\" 421 For All is live-streaming the fundraiser for free. The group's advocacy for equity and fairness in the cannabis industry comes at a unique moment for marijuana policy in the country. \"The concept of 421 was born out of frustration: mainstream cannabis conversations were failing to address the non-commercial aspects of cannabis legalization, like criminal justice reform,\" said Buccola. States are increasingly legalizing the plant—leading to discussions about what to do about thousands of drug convictions. And some are taking the initiative to right the wrongs of the past. In Maine, three separate bills which aim to seal or erase marijuana convictions are moving through the statehouse. Across the country, in Washington state, lawmakers in both chambers of the state's Congress already passed comprehensive legislation that would vacate marijuana convictions for those over 21 at the time of their arrest—over 69,000 cases. Cohen told Common Dreams that he hopes to see the same thing happen in New York, where he lives. \"Soon we will see dispensaries opening up in communities where local cannabis entrepreneurs were incarcerated,\" said Cohen.", "summary": "On 4/20, we celebrate the cannabis plant. On 4/21 we celebrate the people who are focused on these crucial matters of cannabis justice, amplify their message, and have a call to action to continue the work."}
{"url": "foxnews.com/health/marijuana-legalization-illinois-michigan-midwest", "domain": "foxnews.com", "title": "", "authors": ["Frank Miles"], "publish_date": "12-29-2019", "text": "The recreational market selling marijuana is coming to the Midwestern states, and the expensive, challenging industry is bringing a patchwork of legal and cultural snares. The start of legal sales in Michigan on Dec. 1 and in Illinois on Jan. 1 brings a climate to the Midwest where some neighboring states allow limited marijuana use for medical purposes. But, none other has moved to permit recreational use. Officials have been renewing warnings against the dangers of “canna-tourism” and carrying marijuana products over state lines, The Associated Press reported. In Michigan, where $4.7 million of recreational marijuana was sold in the first three weeks of December, regulators said they did not know how much was bought by out-of-state customers. But, many shop owners said business has been brisk, particularly from neighboring Ohio and Indiana and nearby Illinois. “There’s been people from all over,” said Bart Kupczyk, a co-owner and director of retail at Ann Arbor-based Greenstone Provisions, one of 23 Michigan retailers licensed for adult-use recreational sales. “Ann Arbor is close to Ohio. It’s a destination city in its own right as a fairly well-known college town.” Some 45 miles to the south in Morenci, a town of 2,100 people along the Ohio border, a dispensary has reported that a majority of its customers hailed from Ohio, where only medical marijuana has been legal. Another retailer in Morenci secured its state license last week. “It is important for residents of Ohio and nonresidents traveling through the state to understand possession of marijuana remains a criminal violation in Ohio, even if it is purchased legally in another state which permits recreational use,” said Staff Lt. Craig Cvetan, public affairs commander for the Ohio State Highway Patrol. Illinois is the 11th state to allow marijuana’s use and sale broadly, shrinking early states’ market advantages and abilities to draw tourists. Illinois marijuana company executives said they’ve trained employees to remind nonresidents that their products cannot legally be transported across state lines and can be consumed only in private homes or hotels that permit it.", "summary": null}
{"url": "nytimes.com/2019/03/17/us/politics/marijuana-legalize-democrats.html", "domain": "nytimes.com", "title": "", "authors": ["Trip Gabriel"], "publish_date": "03-17-2019", "text": "People in Colorado still remember John Hickenlooper’s crack after the state legalized marijuana, a move he opposed: “Don’t break out the Cheetos or Goldfish too quickly.” But Mr. Hickenlooper, the governor at the time of the 2012 initiative allowing recreational use of cannabis, eventually changed his mind. He acknowledged that fears of increased use by children did not materialize, and he boasted of the tax revenues for social programs that regulated sales delivered. Entering the Democratic presidential race this month, Mr. Hickenlooper joined a field already jammed with pro-legalization candidates, a reflection of swiftly changing public opinion since Colorado became one of the first of 10 states with legal recreational marijuana. The issue today is a pillar of progressive politics, but not because of graying hippies who like their Rocky Mountain High. Rather, for many Democrats, legalization has become a litmus test for candidates’ commitment to equal treatment for all races in policing and criminal justice as well as fighting economic inequality. “A Democrat who is not on board with legalization or addressing it in terms of repairing harms brought by prohibition for decades is going to have a tough time convincing any voter they’re serious about racial justice,” said Vincent M. Southerland, executive director of the Center on Race, Inequality and the Law at New York University Law School. Senator Cory Booker of New Jersey last month introduced the pointedly named Marijuana Justice Act, which would remove the drug from the federal list of controlled substances and expunge past convictions. Supporters note that African-Americans are almost four times more likely to be arrested for marijuana possession than whites, even though rates of use are similar. “It’s not enough to legalize marijuana at the federal level — we should also help those who have suffered due to its prohibition,” Mr. Booker said in a tweet. Other 2020 candidates in the Senate quickly signed on as sponsors, including Kirsten Gillibrand, Bernie Sanders, Elizabeth Warren and Kamala Harris. Beto O’Rourke, who often hedges when asked about contentious policy issues, has endorsed the federal legalization of marijuana unequivocally. Asked about it Thursday — at his first event as a presidential candidate, in Keokuk, Iowa — Mr. O’Rourke framed his position as a matter of practicality and racial justice, given that people of color are imprisoned at disproportionate rates for drug offenses. “I say this as the father of a middle school student, where middle schools are one of the fastest growing markets for marijuana sales today,” he told a coffeehouse crowd.", "summary": null}
{"url": "reddit.com/r/changemyview/comments/aowh26/cmv_marijuana_should_be_legalized/", "domain": "reddit.com/r/changemyview", "title": "", "authors": ["Tuberoinfundibular"], "publish_date": "02-09-2019", "text": "So my glorious senator from my home state Ron Wyden has introduced a bill to legalize marijuana in America. Although I doubt it will actually get passed I think that it ought to. Here are my reasons for why it ought to be legalized: It was made illegal in the first place due to racist fear-mongering and stories made up by people who are clearly ignorant of marijuana and it's effects (i.e. Reefer Madness) Although this is sort of a separate issue, the designation of marijuana as a Schedule I drug is absurd, especially when you look at how other illicit drugs are classified. By definition, Schedule I drugs, are defined as drugs with no currently accepted medical use and a high potential for abuse. The first point is false, marijuana has some medicinal usages such as helping with pain or appetite in cancer patients. Does marijuana have a high potential for abuse? Well, it certainty has a potential for abuse, but is it really worse than meth, cocaine, or fentanyl (which btw are all Schedule II)? I'm well aware that marijuana is not a harmless drug, but look at alcohol and tobacco which are both legal and significantly worse for you than marijuana is. Doesn't make sense that two of the worst substances are perfectly legal whereas weed (which is less worse for you) is demonized and illegal I'm not really knowledgeable about economics so I may be totally wrong but legalizing weed could improve the economy by providing a new business to sell goods and such Legalizing weed will make it easier to do research on its long term effects so we can finally figure out the true risks of smoking it", "summary": null}
{"url": "reddit.com/r/changemyview/comments/ac7y3q/cmv_cannabis_should_be_legalized/", "domain": "reddit.com/r/changemyview", "title": "", "authors": ["KakteenTV"], "publish_date": "01-03-2019", "text": "So here is my opinion on the legalization of Cannabis: It's prohibition was not justified. After the failure of the alcohol prohibition in the states, government officials needed a new enemy: Cannabis. After picking the only negative opinion of a scientist, they proposed it to the Un and they actually agreed (obviously, this is a very simple version of it). Countries like Germany protested but were silenced through it's pharma industry lobbyists, as they saw a danger in this drug making some of their products obsolete. Cannabis can be used as a painkiller, to calm people with behavioral syndromes and some claim even against other diseases. Although it is legalized for medical purposes in some countries, supply is low and the prices ridiculous, as insurances won't pay for it. Cannabis is less harmful than Alcohol and Nicotine. The only risks of consuming it are a psychosis (I'll adress these again) or damaging your lung through smoking (minimized by vaping or edibles). When you're high you drive better and calmer than when you're drunk (driving while high should still be illegal). It destroys a branch of the black market, as people can just buy it (btw. governments can earn millions through taxes). Dealers can't offer you \"harder\" drugs, as you won't be buying from them but from highly regulated official vendors. Through controlling the balance of THC and CBD the danger of psychosis is also lowered. Black market Cannabis tends to have a higher and higher dosis of THC, because it is more efficient and worth more. This means a higher danger of psychosis. With regulated Cannabis though, this problem can be regulated as mentioned above. This is a short version of my argumentation. I am aware that I may have been not accurate enough or not told everything, so you don't have to hate on me. But honestly I think you can't change my mind and that it's a question of time that everyone can enjoy their joint in peace, no matter what country you're in. Best regards.", "summary": null}
{"url": "reddit.com/r/unpopularopinion/comments/8spy7n/marijuana_should_not_be_legalized_for/", "domain": "reddit.com/r/unpopularopinion", "title": "", "authors": ["Slippy_Sloth"], "publish_date": "06-21-2018", "text": "When I was younger, I was the textbook \"young libertarian\" who hated anything the government did to restrict even the most insignificant freedom. But as I became older, I began to realize more and more that \"intrusive\" government regulation is nessicary, not only to protect people from people from themselves, but also to maintain a functional society. There are a couple of reasons why I dislike Marijuana, and none of them are very major, but when they are all considered together, I think they make a compelling argument. Safety. I'm going to cheat on this one a little. The jury is still out on the effects of marijuana on cognitive development, and there is debate on wheater the act of smoking can cause lung issues. What can be safely said though is that smoking Marijuana isn't particularly healthy. At least not compared to other things you could be spending your time and money on. Another aspect to consider is DUI and other hazards caused by impairment. Our society already has a major problem with drunk driving, so why add high driving into the mixture? The real hazard here comes from how quickly Marijuana acts on the nervous system. While it usually takes 2-3 beers to cause significant impairment, a single hit from a joint is enough to impair most people. Economics. A major arguement for legalization is that revenue from Marijuana will stimulate the economy. And this is true for a short period of time. What people fail to realize however is that Marijuana will negatively impact the consumer in the long term. Money spent on Marijuana is like money spent on Alchohol. Usually when money is exchanged for a good, that product either directly or indirectly assists the comsumer in a meaningful way. Money spent on any drug does not provide significant tangible benefit. A large Marijuana market would serve only to take money from the hands of the consumer while not providing any afforememtioned tangible benefit. Money in the hand of the consumer is what ultimately stimulates the economy, not money in the hands of wealthy Marijuana companies. No turning back. I'm sure you're familiar with prohibition and how that all ended up. What prohibition taught us is that once a product (especially a drug) is introduced into a population, it is EXTREMELY hard to remove that product. The same concept applies to Marijuana. Essentially, once Marijuana is legalized, there is no turning back.", "summary": null}
{"url": "reddit.com/r/unpopularopinion/comments/9v73vf/unpopular_opinion_legalization_of_marijuana/", "domain": "reddit.com/r/unpopularopinion", "title": "", "authors": ["Piston75"], "publish_date": "11-07-2018", "text": "I think it's just plain dumb. Dont get me wrong, medicinal marijuana to help aid people who have chronic pain or terminal illnesses is fine. It helps them cope with their condition and, because their illness is terminal, won't affect them later in life. But I feel different about recreational use. I understand a lot of the viewpoints supporting it. It's wrong to persecute and imprison people, especially of color over non violent drug offenses. At the same time, however, a crime is a crime. Knowingly selling and distributing drugs is illegal. I think, perhaps instead, they get fined. But I digress. Marijuana has some serious side effects. Its linked to development problems, cancers and ect. It's basically making a new, potentially more addictive cigarette available to the market. Obviously, normal cigarettes are declining in popularity, but juuling and marijuana use is increasing. This, I fear, will cause another generation of people who will die young and regret ever smoking. Not only this, cigarettes and addictions are costly, and making marijuana legal will just make it easier for people to drain their income. Marijuana is also linked to disorders which cause people to be less active and less willing to work. It's a depressant. So not only will people waste money, they will also produce less money. Like I said, many points supporting it are valid and true. More tax revenue, more potential jobs, less mass incarceration. But I think legalizing it will cause more harm than good. I know there will be some comments like \"but if its legalized it will be more controlled.\" I get that, but, alcohol and juuls are similar, they are controlled, yet dealers and resellers still find a way to the younger market. Overall, the idea to make recreational marijuana legal, is somewhat misleading in its benefits. I'm open minded, and, I'll admit I'm wrong 20 years from now when society is magically transformed and marijuana somehow saved us. But until then, that's my take on it.", "summary": null}
{"url": "reddit.com/r/changemyview/comments/902dof/cmv_marijuana_shouldnt_be_legalized/", "domain": "reddit.com/r/changemyview", "title": "", "authors": [], "publish_date": "07-18-2018", "text": "I’m serious. Weed is especially destructive in teenagers’ brains. It leads to less grey matter, more disorganized white matter, working memory and attention deficiencies, and a loss of IQ points (Current Addiction Reports). And legalization makes it easier for teens to acquire; while Colorado has not seen an overall change in teen use since legalization, legalization of medical pot made it more easily accessible for teens. Monitoring the Future also proved that alcohol and marijuana, which are legal and quasi-legal in our society, are far more accessible to teens than hard drugs like heroin and meth, which debunks the myth that simply regulating it will decrease teen usage. It’s similar regarding traffic and the roads. A study from Nova Scotia found that driving under the influence of marijuana doubles the risk of a serious or fatal car accident. Another study found that marijuana-related traffic fatalities tripled from 1999-2010. And that sure has manifested where weed has become legal. In Washington State, traffic fatalities where the driver tested positive for THC doubled after legalization. In Denver, CO, the same occurred, according to data. Many like to point to how alcohol is far more dangerous and how Prohibition was ineffective. Alcohol has been used by Western culture for thousands of years before we were aware of harmful effects. The social culture surrounding it couldn’t be more different. If we invented it today, it would be treated just like any other drug. It’s exactly the reason why we shouldn’t legalize another psychoactive substance that affects behavior. People also do not drink alcohol recreationally exclusively to get high, for which the opposite is true regarding weed. Many also like to point to Portugal’s policy of decriminalization (though it is still strongly discouraged by law enforcement). I’d point to Sweden’s policy in response, as well as Spain’s. It will not lead to significant increases in revenue. It hasn’t in Colorado. It will not have too large an effect on imprisonment, as people are rarely incarcerated solely for possession (Caulkins, Sevigny 1997). It is also rare for police to arrest solely for possession. In fact, drugs are hardly the reason for mass incarceration at all. Abnormally long sentence lengths imposed in the 1980s under Reagan are, and this caused the prison population to climb more than 400%. The original War on Drugs under Nixon, on the contrary, was never about mass imprisonment, but instead focused on treatment, which decreased in the 1980s due to tougher sentence lengths for all crimes in general.", "summary": null}
{"url": "reddit.com/r/CivStrategy/comments/8sz6q5/civ_5_babylon_what_am_i_doing_wrong/", "domain": "reddit.com/r/CivStrategy", "title": "", "authors": ["rylasasin"], "publish_date": "06-22-2018", "text": "Everyone says babylon is so great. Everyone says it rocks. Yet every time I use it, I just end up getting my ass kicked. I do everything the guides say to do. I play tall. I concentrate on growth. I beeline Writing, get GL out before anyone else. I restrict to 3-4 cities (not that I'm even capable of playing wide, never got the hang of it). I'm being peaceful. I'm going tradition. Just like the guides say. I manage to build GL, Temple of Artemis, and Oracle. I do the Nat Collage thing before I settle my next city. My opening is Scout, Scout, Shrine. Like I'm supposed to. Yet, midgame it all falls apart. Nothing ever goes the way it's supposed to. I end up with happiness problems. They say sell your stuff, but everyone around me is either a complete ass who won't trade with me or already has everything I have or has nothing to trade. I try building Notre Dame but everyone snipes that. I Have no clue where I'm going wrong. And it's angering me to no end. I find myself ragequitting by turn 180. I'm playing Prince. I can't even beat the game on PRINCE with Babylon. I feel like the only civ I can play with any reliability is Venice. That I can beat the game on up to Emperor. Never tried Immortal with it.", "summary": null}
