{"url": "", "domain": "reddit.com/r/changemyview", "title": "Marijuana, LSD, and psilocybin for instance have no addictive effectsI didn't say that all were addictive but there are negative effects, being in an altered state makes you fundamentally less productive and for children who are still developing these can have negative effects. Hallucinogens have some potential for therapy in small amounts but people can also have very bad experiences from them and get PTSD when using them on their own.>Who are you to tell people what they can put in their own body.", "authors": ["debatingaccount"], "publish_date": "00-2-2015", "text": ">Not all drugs are addictive. Marijuana, LSD, and psilocybin for instance have no addictive effectsI didn't say that all were addictive but there are negative effects, being in an altered state makes you fundamentally less productive and for children who are still developing these can have negative effects. Hallucinogens have some potential for therapy in small amounts but people can also have very bad experiences from them and get PTSD when using them on their own.>Who are you to tell people what they can put in their own body. Who am I to tell people they can't murder each other, or steal, I'm just trying to look out for the best interests of people and our laws should be too.>Prohibition of alcohol and the tens of thousands who have been murdered due to the drug wars have proven prohibition doesn't work and is ineffective. I didn't advocate for that, I said I supported decriminalization, but I still think that there should be mandatory rehabilitation and that there are ways you can try and cut off supplies.>Tell me this, if the government can't prevent drugs from entering and circulating maximum security prisons how do you propose they do it out here? Obviously they can't prevent that 100% but they can still prevent it somewhere. Jesus christ you libertarians are stupid.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "It goes either way, a pro marijuana organization isn't going to pay for clinical trials that they think will show harmful benefits of cannabis consumption. It does have proven health benefits though, It's nausea, pain, and anxiety reducing qualities alone are enough for most to consider it medically valuable. With the rate that opiates and other dangerous drugs are getting doled out to people I don't see anyway you can consider that okay but scoff at marijuana being medicine That said, I think as far as drugs go marijuana is the lesser of all evils.", "authors": ["Hoodtrackathlete"], "publish_date": "00-7-2015", "text": "I have to agree about the constant slew of studies that come up with new health benefits. Seems a bit fishy to me. Groups that fund studies usually have an agenda, and that alone is enough to skew studies towards finding results they deem desirable. It goes either way, a pro marijuana organization isn't going to pay for clinical trials that they think will show harmful benefits of cannabis consumption. It does have proven health benefits though, It's nausea, pain, and anxiety reducing qualities alone are enough for most to consider it medically valuable. With the rate that opiates and other dangerous drugs are getting doled out to people I don't see anyway you can consider that okay but scoff at marijuana being medicine That said, I think as far as drugs go marijuana is the lesser of all evils. Alcohol and tobacco have a long track record of being more harmful in terms of health and domestic violence, alcohol especially seems like something society could do without. If somebody out there smokes a joint and watches TV instead of drinking a fifth and starting a fight I would consider that a good thing. People are always going to want to get high and alter their consciousness and weed seems to be the safest way to do that at this point in time. Legalizing it just takes money from the cartels and back to the people, in the form of taxes and small business. Marijuana being illegal didn't really stop people from smoking, just like prohibition didn't stop alcohol consumption. Allowing the government to regulate the industry makes sure you know what you are smoking, as well.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "So reading the first quarter of so of Scalia's piece and the blog, it seems their (the majority's) main rationale hinges on that they believe that California's marijuana market (in this case) interferes with federal regulations of interstate commerce (illegal drug trade). The question to me is whether this interference is really substantial enough to warrant such a potential expansion of powers of the Commerce Clause.", "authors": ["wottaman"], "publish_date": "00-6-2016", "text": "So reading the first quarter of so of Scalia's piece and the blog, it seems their (the majority's) main rationale hinges on that they believe that California's marijuana market (in this case) interferes with federal regulations of interstate commerce (illegal drug trade). The question to me is whether this interference is really substantial enough to warrant such a potential expansion of powers of the Commerce Clause. I think the reality is that creating a legal medical marijuana market *does* have an impact on the marijuana supply in other states as well. It creates a legal market for a previously illegal good within California. However, this good is easily transferable to out of state (it's not like marijuana expires; and if a medical marijuana license was as easy to obtain as it is today, then the restrictions wouldn't prevent out of staters from getting a license). As such, to me it seems understandable at face value that SCOTUS would be concerned about an over extension of a state's ability to impact out of state markets through such a legalization. Furthermore, since the time of the ruling, what qualifies as interstate commerce has only become more complicated with the advances in technology which have taken place which make it even easier to order goods from out of state. Does the ruling open a potential pandora's box of extending federal government power over the commerce clause? The way that the majority opinions seem to state it, it doesn't necessarily. They leave it rather vague, and seem to only validate such a ruling for a case dealing with specific markets such as illegal substances.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "\"Spice\", for example, is billed as a *legal alternative* to marijuana. And bath salts, for example, are billed as a *legal alternative* to cocaine and amphetamines. And how do I know all of this? Because of Portugal. Portugal decriminalized all drugs in 2001. And now they proudly report the fewest users of these \"new drugs\" among all countries with data tracking \"new drug\" users.", "authors": ["Death2Evil"], "publish_date": "00-11-2016", "text": "Of course not, scrub. The Cartels would do as the Mafia did: use their money, power and influence to reestablish themselves as legitimate business operations. And no, scrub. No. They can not \"compete\" with legal drugs by simply introducing new legal drugs. That is not how chemistry works. There is no \"new and improved\" version of heroin, for example. There is only more milligrams of the molecule or less milligrams of the heroin molecule... Or krokodil, which provides a similar high at the cost of melting your skin off... but people will make krokodil and will buy krokodil *because it's legal* and they can't get heroin. So. ironically, prohibition is what gives rise to your so-called \"new drugs\", because \"new drugs\" are means to circumvent detection through cheap, dangerous, experimental knock-offs. \"Spice\", for example, is billed as a *legal alternative* to marijuana. And bath salts, for example, are billed as a *legal alternative* to cocaine and amphetamines. And how do I know all of this? Because of Portugal. Portugal decriminalized all drugs in 2001. And now they proudly report the fewest users of these \"new drugs\" among all countries with data tracking \"new drug\" users. Krokodil, Spice and Bath Salts aren't a big problem in Portugal, because Portuguese people can more safely use heroin, cannabis and cocaine.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "I dont think such a fringe case is easily attributable to recreational marijuana. It could be fairly argued that the main issue regarding sugar is the fast food industry, but even if such an argument could be made, it would be pretty diluted at best. Your point for #4, on the other hand, I feel is contradictory with the sugar argument.", "authors": ["Coffee_dec"], "publish_date": "00-10-2017", "text": "Hmm, the sugar argument I find pretty persuasive. While its tempting to say we can just ban sugar, or go back to my position on cigarettes/ alcohol, I suppose the only decent justification for the continuing legality of sugar is its relative proximity to being neccesary or unharmed up in our society. It could be possible (though heavily unlikely) that cheap, sugary foods are the only way some impoverished Alaskan people survive. I dont think such a fringe case is easily attributable to recreational marijuana. It could be fairly argued that the main issue regarding sugar is the fast food industry, but even if such an argument could be made, it would be pretty diluted at best. Your point for #4, on the other hand, I feel is contradictory with the sugar argument. If marijuana were to be legalized, you say, the average quality of marijuana sold would go up. But clearly, fast food companies are not selling high quality foods that include sugar. Similarly, the explosion in demand for marijuana after its legalization would likely cause a few shifty producers to make marijuana as cheap as possible. This kind of leads into #5, where a sudden increase in opportunity leads to shady practices. Im not defending McDs or coke as good companies, just that two wrongs dont make a right, and limiting the amount of invasive corporation is probably a good thing. Im convinced at least that it wouldnt be that bad, or at least not as bad as sugar is already, but Im not 100 percent on the justification that we do bad things already, so why not do more, not as bad things?", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "I'm not saying that marijuana businesses won't succeed. I said that the economy won't tremendously improve once it becomes illegal. There's a fine difference between those two statements. Breweries don't just hand out beer to their employees. That's a no brainer. They're selling that product for a profit, and employees also know that drinking on the job at a vast majority of places would get them fired.", "authors": ["fortifier22"], "publish_date": "00-11-2017", "text": "I'm not saying that marijuana businesses won't succeed. I said that the economy won't tremendously improve once it becomes illegal. There's a fine difference between those two statements. Breweries don't just hand out beer to their employees. That's a no brainer. They're selling that product for a profit, and employees also know that drinking on the job at a vast majority of places would get them fired. And marijuana businesses don't operate just fine. Just like every other work place there are a lot of bad things going on behind the scenes. Your local news can tell you more about that. Also, are you trying to suggest that marijuana alone is the determining factor of crime rates? That's a straw man argument and an incredibly narrow minded statement. There are far more factors than a single substance that can determine that. Also, [Washington's marijuana related crime rates are unchanged]() despite how they legalized it. Once again, a simple news lookup can tell you that. And if you actually continued to read the entire site, there are clear long term effects listed as well. How can I expect to have a logical and sound argument with you when you cherry pick your evidences and twist your opponent's evidences and words. Until you change this, I refuse to continue debating with you. Goodbye.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "Its literally the exact same thing.> Why is alcohol legal while marijuana is not? Why is ecstasy and LSD outlawed? Just because society tells us it is okay, does not mean that it is. More faux concern. You know the answers to those questions.> We had slavery as long as we had alcohol. Total non sequitur. Alcohol isnt going anywhere.", "authors": ["NewbombTurk"], "publish_date": "00-1-2018", "text": "Youre way overstating it. As I said in my original response to you, youre being hyperbolic. You have a major issue with something that normal people dont, and, like most immature people, you lash out at them, you externalize it, instead of owning it as your problem.> That does not mean that society doesn't have an issue. An issue that you would not give two fucks about it you didnt have severe anxiety even being around alcohol. > Society should change for itself. Don't be so disingenuous. Do you not know how transparent youre being here? Do you really think anyone reading this would believe that was your real concern?> Poison. A substance that attacks your brain and can easily kill you. More exaggeration. Is that what youre worried about? Really? Do you know how much alcohol it would take to kill you? Easily or otherwise? Orders of magnitude more than what your average person drinks in any given situation. But thats not the issue. You cant even be around a person having a glass of wine, right? > Your hypothetical of a person who is afraid of dogs is a straight up fallacy and I can't even begin to address it. Its literally the exact same thing.> Why is alcohol legal while marijuana is not? Why is ecstasy and LSD outlawed? Just because society tells us it is okay, does not mean that it is. More faux concern. You know the answers to those questions.> We had slavery as long as we had alcohol. Total non sequitur. Alcohol isnt going anywhere. You can either get help for your debilitating anxiety, or continue to anonymously lash out on Reddit, at those who have no problems with alcohol. Your choice.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "Smoke all the pot you want, but there are some drugs that should not be in widespread use. There will always be gangs and shitty people doing shitty things to make money, and I'll agree that some drugs should be legalized and regulated in order to take that revenue source away from the black market and to keep people from being needlessly imprisoned, but by no means should it be all of them.", "authors": ["Mr-Chop"], "publish_date": "00-7-2018", "text": "The problem as I see it is that some drugs do constitute a danger to society in and of themselves. Methamphetamine can cause you to completely lose your mind. You will act in ways that you never would sober, and a nonviolent person can become violent as a result. I'm speaking from my own personal experience. I used to be a meth addict and I became totally different from the person I was before over a period of less than six months. I never had a problem with money and I was always able to buy it without any problem. But I became paranoid and dangerous. I became almost exceedingly violent and would go off at the drop of a hat. I once threw someone over my second story balcony because they said \"fuck\" after I told them not to. I don't remember why I told them not too, and I'm not sure it mattered. At the time I had absolutely no compunction about doing it, and I was totally unconcerned about whether or not the fall would hurt or kill them. Luckily the guy was fine other than some scrapes and bruises, but to be perfectly honest it wouldn't have mattered if I had been living on the 5th or 10th floor. Since I have cleaned up I have never been violent with anyone or been in any trouble of any kind, and it's been more than 17 years. Some drugs turn some otherwise normal people into monsters. At the very least those drugs should be illegal. Smoke all the pot you want, but there are some drugs that should not be in widespread use. There will always be gangs and shitty people doing shitty things to make money, and I'll agree that some drugs should be legalized and regulated in order to take that revenue source away from the black market and to keep people from being needlessly imprisoned, but by no means should it be all of them. Some drugs really do create crime in and of themselves.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "I dont think I can convince you that its wrong to legalize, decriminalize weed and I wouldnt try. It probably would be better for the country. A better argument would be the country would be a better place as a whole if inebriating drugs (booze, weed, etc.) didnt exist at all. I know its a silly hypothetical, but if I could go back in time, I would probably be a (slightly) better person today if it werent for the influences of weed, getting drunk and other drugs.", "authors": ["splifs"], "publish_date": "00-2-2019", "text": "I dont think I can convince you that its wrong to legalize, decriminalize weed and I wouldnt try. It probably would be better for the country. A better argument would be the country would be a better place as a whole if inebriating drugs (booze, weed, etc.) didnt exist at all. I know its a silly hypothetical, but if I could go back in time, I would probably be a (slightly) better person today if it werent for the influences of weed, getting drunk and other drugs. This probably applies to most people. For some people they would be completely different if they were only sober. You could even make an argument that inebriating drugs dont improve people in any way really (besides for medicinal purposes). Parties wouldnt be as fun, but thats it. But its hard to argue that in this universe that weed should be illegal considering all the damage the drug war has caused, the havoc its wreaked on the global population, the incarceration rates, the violence, the lies and misinformation. The only possibly valid arguments Ive heard have cited flawed studies, incorrect statistical analysis, and outright lies. Anyway, yeah it would be ultimately good for the country but if we didnt have any of it, it would probably be better for everyone.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "We knew we couldnt make it illegal to be either against the war or black, but by getting the public to associate the hippies with marijuana and blacks with heroin, and then criminalizing both heavily, we could disrupt those communities. We could arrest their leaders, raid their homes, break up their meetings, and vilify them night after night on the evening news.", "authors": ["Vishnej"], "publish_date": "00-6-2019", "text": "It looks barbaric to some of us now.>A top Nixon aide, John Ehrlichman, later admitted: You want to know what this was really all about. The Nixon campaign in 1968, and the Nixon White House after that, had two enemies: the antiwar left and black people. You understand what Im saying. We knew we couldnt make it illegal to be either against the war or black, but by getting the public to associate the hippies with marijuana and blacks with heroin, and then criminalizing both heavily, we could disrupt those communities. We could arrest their leaders, raid their homes, break up their meetings, and vilify them night after night on the evening news. Did we know we were lying about the drugs? Of course we did. Nixon temporarily placed marijuana in Schedule One, the most restrictive category of drugs, pending review by a commission he appointed led by Republican Pennsylvania Governor Raymond Shafer.[...]()> Los Angeles Police Chief Daryl Gates, who believed that casual drug users should be taken out and shot, founded the DARE drug education program, which was quickly adopted nationwide despite the lack of evidence of its effectiveness. The increasingly harsh drug policies also blocked the expansion of syringe access programs and other harm reduction policies to reduce the rapid spread of HIV/AIDS. > >In the late 1980s, a political hysteria about drugs led to the passage of draconian penalties in Congress and state legislatures that rapidly increased the prison population. In 1985, the proportion of Americans polled who saw drug abuse as the nation's \"number one problem\" was just 2-6 percent. The figure grew through the remainder of the 1980s until, in September 1989, it reached a remarkable 64 percent  one of the most intense fixations by the American public on any issue in polling history.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "(You could get around this though by defining a fetus as not a human being, but you do run into the issue of defining human being more clearly) For example, if I gave you the political positions of \"I am in favor of legalizing marijuana\" and \"I am in favor of increasing foreign aid\", there isn't generally an issue.", "authors": ["adorablequilava"], "publish_date": "00-1-2019", "text": "Logically you're correct that, no, there is no inherent contradiction between the two positions, but what's notable about the two positions is that particular principles automatically fail because they contradict at least one of the two positions. This is similar to the potential opposite view, being Pro Choice but also Anti Death Penalty. For the first one, you can't hold the principle \"Killing another human being is only morally permissible in self defense\", because the Death Penalty is not an act of self defense. Similarly, you can't hold the principle if you're pro-choice and anti-death penalty as abortion is not an act of self defense. (You could get around this though by defining a fetus as not a human being, but you do run into the issue of defining human being more clearly) For example, if I gave you the political positions of \"I am in favor of legalizing marijuana\" and \"I am in favor of increasing foreign aid\", there isn't generally an issue. Any principle that would support legalizing marijuana will not usually come into conflict with a position regarding foreign aid. But with an issue like Pro-Life vs Pro-Choice and regarding the death penalty, both involve issues of human life directly being killed, so any principles that support one must not come into conflict with the other, or else you risk acting in contradiction to your own beliefs. They may not be contradictory, but they these ideas are in conflict with which principles will allow both.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "I think federalism is a good compromise because different states have different values.. take for example marijuana. In a unitary system we would not have States were marijuana is legal. That would require congress to approve and right now there is little support among conservatives so at least some liberal states are passing marijuana laws. Since federalism allows states to experiment it leads to congress being able to observe the results.", "authors": ["Oogutache"], "publish_date": "00-9-2019", "text": "I thought initially you were going to argue for a confederate system but you are basically asking for a unitary system. I think federalism is a good compromise because different states have different values.. take for example marijuana. In a unitary system we would not have States were marijuana is legal. That would require congress to approve and right now there is little support among conservatives so at least some liberal states are passing marijuana laws. Since federalism allows states to experiment it leads to congress being able to observe the results. Eventually marijuana will be legal in all 59 states but if no state took any risk to see what would happen if it was made legal it would take much longer. Same thing with same sex marriage. As late as 2008 a majority of Americans were against same sex marriage but it allowed some states to legalize it and the Supreme Court eventually legalized it everywhere. One recent example is trump wants to get rid of emissions requirements for cars. Basically Obama made a law saying that cars needed to incrementally be more energy efficient. California put up their own emissions requirements so since they are so big car manufacturers are just applying it to all its cars. Trump is currently in a legal battle with California over this issue. If we had a unitary system we States wouldnt be able to put up their own efficiency requirements for cars", "summary": null}
