{"url": "", "domain": "reddit.com/r/changemyview", "title": "They smoke marijuana at the exact same rate as white people but are four times more likely to face trial and get on average longer jail sentences when convicted. But none of that is being brought up, they are just trying to start with what is supposed to be the bare minimum.", "authors": ["auandi"], "publish_date": "00-8-2015", "text": "No. 100% no. Talking about racism does not perpetuate racism. Pretending that talking about racism will perpetuate racism is the kind of attitude that does that. People think that just because Obama won that racism is over. An outright majority of white people under 30 say reverse discrimination against white people is more serious than actual discrimination against other races. Hell no. #alllivesmatter is downplaying the problem. It's somehow saying this isn't about race when it is. And stating that reality is not creating racism it's only showing what exists. If white people are getting tired of hearing about how hard it is to be black, imagine how tired black people are of *living* it. Black people are less likely to be called in for job interviews. All things being equal, they are given smaller loans, shown fewer homes, less likely to get accepted to college and less likely to get scholarships when they get there. They smoke marijuana at the exact same rate as white people but are four times more likely to face trial and get on average longer jail sentences when convicted. But none of that is being brought up, they are just trying to start with what is supposed to be the bare minimum. Police should not treat black people differently, and they should not be so quick to use deadly force. Mountains of evidence show they do, that when you remove all other variables, black people are more likely to be killed by police than any other race by a very long shot. And the police are not usually facing any repercussions for their actions either. Is this not a common enough denominator? That people should not fear that the cops will kill them for no reason?", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "I think medical marijuana is a massive con too - as if people would be touting its presumed medical benefits if it had no psychoactive effects. However, marijuana culture is hardly the only pastime which can be criticized on the basis of the culture surrounding it.", "authors": ["GimbertBindon"], "publish_date": "00-12-2015", "text": "Good post! I am an avid pothead and I agree with you on a lot of your points. I hate going into growshops to buy supplies for my garden, and having to talk to dreadlocked hippies, when I am a conservative type who goes to bed at 9.30pm (I am wearing a pair of slippers right now, for example). I think medical marijuana is a massive con too - as if people would be touting its presumed medical benefits if it had no psychoactive effects. However, marijuana culture is hardly the only pastime which can be criticized on the basis of the culture surrounding it. I think the frat boy keg stand show yer tits culture that surrounds alcohol is just as, if not more, overtly gross as all the 420 stuff. Of course, there are also refined scotch drinkers, for example... but I think there are also other groups that appreciate marijuana but don't like to shove it in other's faces, preferring to be more discrete, since it is of course still illegal. With respect to the gangster culture surrounding it, I think that is in a lot of ways a product of it being illegal, hence making it an 'outlaw' pastime. I have a spent a little bit of time in Holland, where it is pretty much legal, and you don't see that sort of attitude to it there (except in the tourist areas, where it is worse than anywhere).", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "When the police punish people for actions that most people don't perceive as serious crimes, such as selling/smoking weed, that relationship is damaged. Police are no longer perceived as allies of the people, working for a peaceful community, and are instead seen as totalitarians who jail and fine on a power trip.", "authors": ["RAGING_VEGETARIAN"], "publish_date": "00-5-2016", "text": "* The unlicensed storefronts don't have regulations yet, but neither do traditional dealers. It's better for people selling unregulated drugs to be out in the open than it is for them to be secretive. Sellers whose activities are visible to the police know that they have to be careful and not poison or rip off their customers, since they are working on borrowed time and can be shut down, fined, or jailed in an instant if somebody complains to the cops. People who buy drugs secretively from strangers who are chronically hiding from the cops have little legal recourse if they are hurt or scammed.* Law enforcement agencies don't have the resources to \"crack down\" on every crime, everywhere, all the time. Like every other group, they have to set priorities. Should the Toronto police divert detectives away from a rape case in order to shut down a dispensary that isn't hurting anyone?* Relationships between police and the general public are fragile. In a civilized society, it's important for people to trust the police. When a crime is committed, we depend on affected individuals to report the crime to the police and cooperate with them. When the police punish people for actions that most people don't perceive as serious crimes, such as selling/smoking weed, that relationship is damaged. Police are no longer perceived as allies of the people, working for a peaceful community, and are instead seen as totalitarians who jail and fine on a power trip.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "Definitely wouldn't go as far as calling these people losers and drug addicts (although I kind of see your point), but yeah, marijuana is constantly glorified here, as if it's some miracle plant that cures everything and turns you into a genius. No, it's really not that great.", "authors": ["BioSamPijanac"], "publish_date": "00-5-2016", "text": "Definitely wouldn't go as far as calling these people losers and drug addicts (although I kind of see your point), but yeah, marijuana is constantly glorified here, as if it's some miracle plant that cures everything and turns you into a genius. No, it's really not that great. It makes you dumb, paranoid and lazy. All of this has been scientifically proven. Sure, THC has medicinal properties, but that doesn't mean rolling and smoking blunts will cure you of cancer - that's just fucking retarded. And for the record - I'm not anti legalization, I think every drug should at least be decriminalized, but I am definitely anti glorification. Cannabis is a mind altering substance and it should be approached with caution and treated with respect. I've seen it affect some people really badly. Especially, If you're predisposed for mental illness, it can seriously fuck you up. Reddit has a few sacred cows and marijuana is one of them (others are cats, Breaking Bad, Bernie Sanders, comic books, \"geek\" culture in general, etc. you catch my drift) and if you say anything negative about it, you're gonna get downvoted into oblivion. This is, essentially, what's turned most subreddits into circle jerks and ego-boosting playgrounds for adults. Another thing that I dislike about marijuana is this loser-stoner-outcast-asocial geek culture that's grown around it. Potheads are like vegans - they think they're better than you for getting high. Seriously people, getting high is easy. It's not really an accomplishment and the fact that you smoke weed doesn't make you smart and special. You just go buy weed and get high. That's pretty much all it takes to be a pothead. I'm all for personal freedom, but are mind altering substances really the way to go? I just wish substance abuse wasn't glorified, but oh well. It's not really something that concerns me anyway. Just felt compelled to write this post after reading what OP has written. Sorry for my English.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "I agree that Marijuana use is on some level harmful to the body, as is the use of any substance, including those that are legal, like alcohol. However, I would argue that the harm caused by making it illegal far exceeds the societal burden created by damage to public health.", "authors": ["ColdNotion"], "publish_date": "00-7-2017", "text": "So, I want to jump in here as someone who actually doesn't smoke all that much (not on moral principles, I just don't like it). I agree that Marijuana use is on some level harmful to the body, as is the use of any substance, including those that are legal, like alcohol. However, I would argue that the harm caused by making it illegal far exceeds the societal burden created by damage to public health. By imprisoning, or even just fining, individuals for safely using a fairly common and relatively harmless drug, we create a significant, and unnecessary legal backlash, which costs a great deal to enforce. Furthermore, its worth noting that anti-marijuana laws have disproportionately affected the poor and communities of color, unintentionally making them tools of institutional prejudice. As such, legalizing cannabis use, with age restrictions similar to alcohol or cigarettes, would probably ultimately be a better choice for ensuring the public's welfare on the whole.>Studies have shown it can mess up one's brain-- especially if under the age of 25, which most weed smokers are. Also makes people lazy and unmotivated in life... we have enough of those people already in society. So, this is going off on a total sidetrack, but I also wanted to speak to this part of your post. Now, there is reason to believe heavy consumption of Cannabis at a young age isn't good for you, but we don't yet have enough research to understand the scope and severity of this risk. While heavy use during adolescence does seem to have some impact on neural development, it isn't clear that this is much different than chronic use of other legal substances during that developmental period. Furthermore, there's still a huge outstanding question of whether other variables, such as poverty, social conditions, use of other substances, etc., much actually explain concerning findings better than Marijuana use. I can't claim to be an expert on this topic, but I would definitely recommend reading the APA's [report on current research](), which does a great job summarizing prominent existing literature. In summary, I certainly wouldn't advocate for allowing teens to use cannabis, but I don't think data suggests that legalizing this drug (which would still include age restrictions) would result in citizens with severe impairment to motivation or other cognitive functions.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "Pot is being legalized Canada Day, 2018. I think its stupid. \"Keep the money from criminals the drugs away from kids\" or something.. I saw someone bitching about legalization in Canada: \"If its legal, there's a stupid new law that says I can't smoke it while I drive, or before I drive or I'll get a DUI.\"Uhhh...", "authors": ["[deleted]"], "publish_date": "00-7-2017", "text": "Agreed. Pot is being legalized Canada Day, 2018. I think its stupid. \"Keep the money from criminals the drugs away from kids\" or something.. I saw someone bitching about legalization in Canada: \"If its legal, there's a stupid new law that says I can't smoke it while I drive, or before I drive or I'll get a DUI.\"Uhhh... People don't realize it does affect your mind. You are impaired. You shouldn't drive after smoking. You shouldn't do a dangerous job.. I wouldn't want to work with someone smoking pot all day and night I weld, and a small mistake could harm someone.. Or if my doctor was high, etc.. They just banned menthol cigarettes because too many kids were smoking them. They can't keep cigarettes or alcohol away from them, so how will they keep pot out of their hands? Medical use, yes. Study it more, do as much research as you can, because there have been breakthroughs. But it isn't a magical cure. It doesn't help everything, sometimes medications or surgery is necessary. It isn't beneficial to some conditions, useless in others, can relieve symptoms in a few, and just be palliative in many. Many people have had their first psychotic breaks and end up in the hospital with marijuana being one factor. They refuse that they were psychotic. They are fine in a few days, stable on meds.. then discharged, start the cycle. I'm schizophrenic, been in many psych wards, you see that a lot. It's sad. It may compromise the immune system (being studied) and smoking it with a compromise immune system can be harmful, especially if the pot has any contamination. Another method should be used.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "The things you're describing aren't new.> All of this for something that barely feels more relaxingThat's subjective> in a time where weed is more available than ever with far less side effectsAnd still illegal almost everywhere in the US. I'm not sure how you can call one person a dumbass for partaking in one vice, while commending another for partaking in a similar vice which also runs the risk of losing them their job.> I can see no reason to begin.", "authors": ["whattodo-whattodo"], "publish_date": "00-10-2018", "text": "> It is more than common knowledge these days that smoking is a direct cause of not only lung cancer, but all kinds of other terrible problems later in lifeYou're operating on the inaccurate premise that this is new. It was common knowledge in the 1960s. By 1969, the surgeon general forced cigarette companies to print it's dangers on every package. Also, most people have eyes. They can just look at other smokers & see their skin, teeth, etc. The things you're describing aren't new.> All of this for something that barely feels more relaxingThat's subjective> in a time where weed is more available than ever with far less side effectsAnd still illegal almost everywhere in the US. I'm not sure how you can call one person a dumbass for partaking in one vice, while commending another for partaking in a similar vice which also runs the risk of losing them their job.> I can see no reason to begin. Recapping on my points above, nothing has changed. There is no \"*then*\" vs \"*now*\". The reasons that people start smoking today are the same reasons as they always were. Admittedly they were never constructive, forward thinking or health conscious. But *so many things* that people do aren't that. I can't disagree with you, but I just think that smokers are as much of a dumbass as moshers, tokers, reckless drivers, people who vote against their interests, etc.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "our democracy isn't for sale though.>Anyway a little tax on weed isnt that bad if in return I would get quality controlled weed from a shop. And most countries that legalize also allow growing your own. So there would be no special tax on that.", "authors": ["thapussypatrol"], "publish_date": "00-10-2018", "text": ">Britian is also in a bad place right now. Everyone under 40 got fucked by old people that wont be affected by the leave vote in any way. I feel sorry for you guys, because I really love your Island and most of its people. (Going to the IOMTT regulary) But that of topic but I dont want you to get me wrong on this. our democracy isn't for sale though.>Anyway a little tax on weed isnt that bad if in return I would get quality controlled weed from a shop. And most countries that legalize also allow growing your own. So there would be no special tax on that. the quality control idea that you're invoking is not going to require very much in taxes though.>The fair share one is hard to say, right now I dont think anywhere on earth anyone pays a fair share. But there are some theories and proposed laws (in Germany) like Taxes for financial transactions (a 0.05% one would bring in more than sales and wage taxes alone). if it's all related to earnings, why would a flat tax be unfair, for instance? a guy with 1,000,000 paying 100,000 and a guy with 10,000 paying 1000 doesn't sound too bad.>Or a tax on inherited wealth and earnings from money you already have. so that's just a second tax then. why isn't an income/VAT tax enough? it just seems like a \"tax tax\", not a necessary or principle-based tax - why tax people just for dying? seems pretty money-grubby, let alone petty", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "Despite the fact that we were underage drinking/smoking weed none of us could face legal consequences because we were trying to help someone.) So a situation like this one wouldnt really be any more or less of an issue because of cameras. > Anyway, the problem could be solved in a different way.", "authors": ["Adamthe_Warlock"], "publish_date": "00-6-2019", "text": ">However I also would like to point at privacy. If a person gets abused or something isn't going well with them, then it could be detrimental to have all of that videotaped. Realistically wed need some kind of classification to determine whether something is sensitive and that video would only be available to the people involved, police, or legal counsel. Im not sure what you mean by detrimental but no one would be forced to watch a video they dont want to watch. > For example if someone is being overdosed on drugs, you want to be able to call for help, without having to consider being filmed. In the US theres something called Good Samaritan laws which prevent you from being charged with crimes involving you calling for EMTs (E. g. I once called for an ambulance for someone with alcohol poisoning. Despite the fact that we were underage drinking/smoking weed none of us could face legal consequences because we were trying to help someone.) So a situation like this one wouldnt really be any more or less of an issue because of cameras. > Anyway, the problem could be solved in a different way. For example currently the statement of a cop is often given a heavier weight than that of a normal civilian. However that could be changed. I disagree, officially and legally the statement of an officer doesnt hold more weight in court than the statement of a bystander. Because of their experience and training in matters of criminal activity as a society were inclined to take their word over civilians. You cant change something that millions of people do subconsciously and we cant very well get rid of juries so there isnt much to be done here. Essentially body cams increase accountability in officers, create a public record of police incidents, and dont (IMO) come with any real downsides except the cost which I think is worthwhile. You make some interesting points but I dont think your concerns are as concerning as you might think", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "One of the big arguments Ive seen if late has been that the people jailed were selling weed to make money, put food on the table. If thats the case, when they are released and realize that the state now runs all pot dispensaries and no one wants to buy pot off the corner, what will they turn to to make money next?", "authors": ["liboriskforlife"], "publish_date": "00-6-2019", "text": "But actions have consequences yes? So if someone j walks they can reasonable assume they may receive a ticket at worst. If someone is willing to commit a crime where they will be imprisoned is a different situation. If j walking was punishable by jailing youd probably see a sharp decline in j walking. One of the big arguments Ive seen if late has been that the people jailed were selling weed to make money, put food on the table. If thats the case, when they are released and realize that the state now runs all pot dispensaries and no one wants to buy pot off the corner, what will they turn to to make money next? Now please, keep in mind I am fully in favor of legalization, this is a purely reap what you sow argument. And yes obviously the system needs fixing, and there are a host of other problems that need to be addressed but at the root of it, I believe that you preformed an action that you had reason to believe would end in you being jailed, so I dont think you should be released early. Not all of this particular response applies to our specific conversation, but Im trying to respond to a few and you actually seem capable of having a civil discussion with someone who has different views without degrading to name calling, so thank you for that.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "For example, getting caught with marijuana can get you put in prison, prison is bad, therefore you shouldn't risk getting caught with marijuana. The best solution is to not do marijuana in the first place. I'm going to try two things here. First of all, what if I *knew* I wouldn't get caught?", "authors": ["monky9997891"], "publish_date": "00-8-2015", "text": "It sounds to me like this has nothing to do with drugs, then. It has to do with following laws. For example, getting caught with marijuana can get you put in prison, prison is bad, therefore you shouldn't risk getting caught with marijuana. The best solution is to not do marijuana in the first place. I'm going to try two things here. First of all, what if I *knew* I wouldn't get caught? I had everything figured out, from removing the evidence of the crime to finding a reliable source of drugs. The system I had set up was absolutely fool-proof, and I therefore had no reason to worry about the legal consequences. Is it still wrong? Yes, it's illegal, but I don't agree with that law and I don't have to be concerned with the repercussions of using an illicit substance in the first place, since I won't ever get caught. If you think that it's wrong to break the law, period, why? If obeying a law requires you to go against your moral compass, why should you follow it? Because the government says so? Disobeying a law that goes against your own constitution is not a lack of self-control. It's being yourself.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "Your arguement is pretty weak and it basicly can be turned into one sentence:\"Man people who don't do weed are geeks, also it's just the best when you are high... and its not bad, other things kill humans too\"Are you around 17? Then it is an acceptable view on the topic, but if you are older than 22 with that opinion then you are a manchild.", "authors": ["Rogue009"], "publish_date": "00-7-2015", "text": "That's falling on the other side of the horse. I don't do drugs and I don't go yelling around that I don't do them. Also you are generalising there, not everyone who doesn't do them choose not to do them just so they can brag about it. I just don't do them and when people I know and they know me aswell try to still force me ontu it then it just gets me pissed off. Also religion has taken more lives than many other wars in human history, yet we don't go around banning it. Also you can be fun if you don't do drugs too. If you are only funny when you are high then I feel sorry for you. But I don't want to bully you here, we are doing a discussion here. Your arguement is pretty weak and it basicly can be turned into one sentence:\"Man people who don't do weed are geeks, also it's just the best when you are high... and its not bad, other things kill humans too\"Are you around 17? Then it is an acceptable view on the topic, but if you are older than 22 with that opinion then you are a manchild.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "I am talking here about another newly-legal option whose exercise does not remove anyone else's freedom, like the legalization of marijuana.>If we wanted to \"restore\" a particular trait, we'd have to locate the gene(s) responsible, which would not be easy, and also introduce the gene on what would probably be a large scale, perhaps in fully grown adults, rather than eggs and embryos, a herculean task.", "authors": ["GnosticGnome"], "publish_date": "00-5-2016", "text": ">consider one (rather extreme, but its the principle that matters) example: the freedom to commit murder. Murder removes others' freedom. I am talking here about another newly-legal option whose exercise does not remove anyone else's freedom, like the legalization of marijuana.>If we wanted to \"restore\" a particular trait, we'd have to locate the gene(s) responsible, which would not be easy, and also introduce the gene on what would probably be a large scale, perhaps in fully grown adults, rather than eggs and embryos, a herculean task. My hope and expectation is that we will be able to use viral vectors to make it a fairly simple task within a few decades.>They are recombinophobes, along with most religious populations, which is most of the non-Western worldLet me give you their own words, from a [prominent anti-GM site](). Other sites have similar messages.\"What ... does Africa need? Not dumping of food aid by rich countries that destroy local efforts to produce. Not the imposition of industrial-style agriculture based on chemicals and \"high yielding\" seeds, with the paradoxical outcome of greater production of a few food crops accompanied by even worse hunger and environmental degradation\"\"And, contrary to the claims of the GM lobby, these crops would not have fed or freed us by giving us greater control over our production, but rather enslaved Africa once more - particularly because of the patenting aspect.\"I am not able to find many examples of religious objections to GMOs. Can you find me some? What I am able to find is an objection to the various forms of Western control that comes with GM crops. Give the gene editing technology to local doctors rather than trying to come in and impose a set of Western restrictions, and people will want it everywhere. I agree they won't be able to afford it in areas that can't even afford labor epidurals. My hope is that global leveling will continue to increase.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "If I was interested in keeping the population dumbed down, lazy, apathetic and uninterested, weed is what I would be looking to sell them. Tobacco, obviously, has many negative side effects, but it's also a mild nootropic (cognitive enhancer), just like caffeine for example. Tobacco in itself is not nearly as harmful as the chemicals that end up in manufactured cigarettes.", "authors": ["BioSamPijanac"], "publish_date": "00-5-2016", "text": "I agree that these companies are currently in charge are ingrained in the justice system, but every now and again a change of elite is happening. Industries goe up, industries go down. People switch sides, people lobby... It gets pretty hectic. I think we are on the verge of a large change in how we view mind-altering substances and what will come out of it is a powerful industry. I don't know... If I was interested in keeping the population dumbed down, lazy, apathetic and uninterested, weed is what I would be looking to sell them. Tobacco, obviously, has many negative side effects, but it's also a mild nootropic (cognitive enhancer), just like caffeine for example. Tobacco in itself is not nearly as harmful as the chemicals that end up in manufactured cigarettes. If companies sold pure tobacco, the entire situation would be a lot different. Who can guarantee marijuana won't be sold packaged with additives, chemicals and what not? But that its just my own theory and just a small piece of the puzzle. I think there is indeed a lot of money in marijuana. Once it becomes decriminalized and legalized, we can expect it to be grown, transported and sold everywhere. Obviously it will also be taxed. In essence, I think cannabis is an absolutely enormous industry waiting to happen and now it's just a matter of who gets to reap the benefits of that boom that will, inevitably, occur and I think that is the reason legalization hasn't fully happened yet. We are in a transitional phase now of bringing marijuana closer to the public through popular media, advertising it as some magical, God given herb.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "There is no evidence that black people smoke or use marijuana more than other races, yet they are [arrested as if they are. ]()> You're saying we should give drug dealers who are black a free pass because they're black. Jesus. I wonder why these arguments always devolve into claiming I'm saying something that I'm not.", "authors": ["Mitoza"], "publish_date": "00-7-2017", "text": "It's not chicken and the egg stuff, it's the way the system works. The system does not codify any rules that disproportionately effect black people. Since there is a disparity in outcome from the policy, it can only be concluded that the origin of the disparity is in the practical enforcement of the policy. There is no evidence that black people smoke or use marijuana more than other races, yet they are [arrested as if they are.]()> You're saying we should give drug dealers who are black a free pass because they're black. Jesus. I wonder why these arguments always devolve into claiming I'm saying something that I'm not. Actually, I know exactly why:> Because if you did then that would be a ridiculous beliefBecause it is easier for you to reject the moderate, common sense reckoning of what is happening in our society if you blow up my argument into something that is patently absurd. Get a hold of yourself.>By saying the laws target black people, you're saying that the laws were designed to imprison only black people and it's just a few white people who got caught up in the system.... No. I've said the laws disproportionately affect black people because it is unfairly enforced. The only racism in the design of the law is incidental in the fact that no safe guards or oversight was provided to make sure the enforcement was rolled out fairly.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "It is not uncommon, especially in young people, to be socially liberal (gays and pot are ok) while being economically conservative (low taxes on individuals and business, lower social safety net, less government regulation). I think most libertarians fall into this group. Sometimes I feel like an anomaly, because I live in the Bible belt and come from a religious family, but I am really pretty liberal on social and economic fronts.", "authors": ["TheSnowNinja"], "publish_date": "00-7-2017", "text": "Well, I was raised pretty conservative, and now I am pretty liberal. But there are so many issues, that most people can't really reduce their views into a single label. At least in the US, you have to look at economic and social views. It is not uncommon, especially in young people, to be socially liberal (gays and pot are ok) while being economically conservative (low taxes on individuals and business, lower social safety net, less government regulation). I think most libertarians fall into this group. Sometimes I feel like an anomaly, because I live in the Bible belt and come from a religious family, but I am really pretty liberal on social and economic fronts. I am a big supporter of working towards UBI. I probably break with many liberals because I am increasingly wary of gun control laws. I think we have some serious issues with gun violence in the US, but I am not sure that laws will be accepted or that they will help. We have an interesting gun culture that I think is not common in many countries. I think we need to do a lot more to focus on how dangerous guns can be and teaching gun safety instead of pushing for regulation. I feel like too much of the US treats guns like toys. There are so many facets of politics that I wish we would break away from labels and parties and focus on specific issues instead.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "It's a lot easier to convince the federal government that there will be no problem legalizing marijuana if you have a track record that it has worked in five different states and counting. If you tried to launch this at the federal level, first of all it would never pass, and second there's the fact that IF there were problems involved in a new policy, then only the states that implemented it would be \"ruined.\"", "authors": ["Zap_Meowsdower"], "publish_date": "00-10-2018", "text": "States can be \"[laboratories of democracy](),\" places where we try out new and crazy laws to see what works and what doesn't. It's a lot easier to convince the federal government that there will be no problem legalizing marijuana if you have a track record that it has worked in five different states and counting. If you tried to launch this at the federal level, first of all it would never pass, and second there's the fact that IF there were problems involved in a new policy, then only the states that implemented it would be \"ruined.\" Marriage equality is another good example of this; of course in retrospect (and even at the time) it's like duh, of course there wouldn't be any problems with SSM. But legal SSM had a decade-plus of solid evidence of its being a good thing, which undoubtedly influenced SCOTUS when Obergefell came to trial. Also, moving states to get access to laws you like isn't really that hard if you're talking about the Northeastern states or a person who lives on a state border. Fireworks were illegal in the state I grew up in, so everyone drove twenty minutes to get fireworks in the next state over. This is certainly harder west of the Mississippi but still not impossible. The electoral college and senate don't really have anything to do with having different laws in different states.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "I believe legalizing marijuana and a few other drugs would solve a lot of issues. I'm strongly against affirmative action. I could go on. I don't understand the second half of your post, though. Everyone wants change, and once they get what they want, they want the change to stop.", "authors": ["SilvertheCat"], "publish_date": "00-10-2018", "text": "I'd like to limit immigration, and require all immigrants to speak English at a conversational level. I'd like to see universal healthcare be implemented at some point. I believe our gun control legislation is strict enough as is, just needs to be better enforced. I believe legalizing marijuana and a few other drugs would solve a lot of issues. I'm strongly against affirmative action. I could go on. I don't understand the second half of your post, though. Everyone wants change, and once they get what they want, they want the change to stop. Politics isn't a leftist dragging his conservative dog by a leash because it doesn't want to go for a walk, it's more like a tug of war. Regardless, if our only options here are \"no change\" and \"change everything\", and if all of that change is going to be *bad*, don't be surprised if people spring for the lesser evil. But that's still completely discounting all the centrists that *did* vote left. I don't understand how you could possibly lump all centrists into one group, is all. Edit: And I didn't mean to imply all leftists are bad with that last statement. Probably just your black and white thinking rubbing off on me a bit there.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "Although to be clear I do agree that we should decriminalize marijuana, or at the very least make it a slap on the wrist regardless of quantity. The vast majority of marijuana arrests are not targeted operations against marijuana, they are usually connected with some other crime or reported incident, or something like a traffic stop.. and the majority of charges are misdemeanors.", "authors": ["zurrain"], "publish_date": "00-6-2019", "text": "Federal aid is only restricted if you convicted during a period you're already receiving federal aid. And it is reinstated after passing two unscheduled drug tests and completing a program, which is quite easy. I believe the only exception to this is a trafficking charge. When you control for students going to college (aka on federal aid), the disparity in arrest rates between races plummet. Most likely because elevated arrest rates are highly tied to areas of high crime, which doesn't typically describe a college campus. Frankly it's not nearly as big of a deal as you're making it out to be. The primary issue is that young black men seem to fall into a pattern of crime early in life and get eaten by it. They drop out of high school, and they don't go to college (or get a steady legal job) because they never even consider it, not because of federal aid restrictions. Although to be clear I do agree that we should decriminalize marijuana, or at the very least make it a slap on the wrist regardless of quantity. The vast majority of marijuana arrests are not targeted operations against marijuana, they are usually connected with some other crime or reported incident, or something like a traffic stop.. and the majority of charges are misdemeanors. Felony arrests are almost always for distribution or trafficking. To expand on my meaning, my sister in-law works for the DAs office in a district in MO. She explained to me that they almost never target for marijuana distribution anymore, but instead marijuana is an almost given added charge because almost every drug distributer is going to sell it. So they'll raid a house for meth or heroine, and then there is almost always going to be a substantial enough amount of marijuana that they can tack on additional felony charges. When you look at trafficked drugs seized by law enforcement, Meth leads the pack. They did pass a law back in the early 2000s that made it more difficult to get the mats to cook it stateside, but that loss of production has largely been covered by Mexico in recent years.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "> Now that weed is legal, it is unfair and unjust to not free the people in jail for weed offenses gotten in the past when weed was illegalyou are missing an underlying premise here. The liberal you are talking to likely believes that the original law was unjust and that the change in the law was the recognition of that injustice.", "authors": ["TripRichert"], "publish_date": "00-6-2019", "text": "> progressives claim the right to healthcare. To this I ask, where does this right come fromyou claim that conservatives hold the view that there is a \"right to life\". The liberal view \"there is a right to healthcare\" is essentially \"the right to right to life should not be conditional on financial means.\"> if you reject the concept of natural rightsmost liberals do not reject the concept of natural rights. They often disagree with conservatives and among themselves on what those rights are and under which principle those rights are derived.> right and wrong are a matter of opinion\"you seem to be under the misconception that most liberals are moral relativists. That is not the case. Just because liberals have different moral claims than you doesn't mean that they don't believe in objective morality at all. > Now that weed is legal, it is unfair and unjust to not free the people in jail for weed offenses gotten in the past when weed was illegalyou are missing an underlying premise here. The liberal you are talking to likely believes that the original law was unjust and that the change in the law was the recognition of that injustice. If one accepts the premise that the law was unjust, the demand that those who are being punished for violating that unjust law should be released from their punishment is logically consistent with this view. I think you have an oversimplified view of liberal moral values. Because of this oversimplification, you view the conclusions based on these moral values as illogical. Strawmen rarely hold logical views, but the blame for that falls on those who constructed them.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "> It's not the fact that marijuana can be harmful,(although IMO, it is less harmful than alcohol and I support the legalization of it) it's the fact that it's illegal. Why would any rational parent let their child risk getting caught with marijuana and getting arrested?", "authors": ["RicoBeau"], "publish_date": "00-8-2015", "text": "For clarification, based off of your response to /u/Hq3473, your CMV does not refer to parents that monitor/teach their children about safe drug consumption but rather those that **literally** don't care about it. This may be a tough one. I agree with you that the type of parenting your CMV is referring to is bad, but we need to remember that good vs. bad is totally subjective. I believe in this situation, a \"bad parent\" refers to one that does not act in the best interest of a child's present/future as a parent's job is to raise their child. > It's not the fact that marijuana can be harmful,(although IMO, it is less harmful than alcohol and I support the legalization of it) it's the fact that it's illegal. Why would any rational parent let their child risk getting caught with marijuana and getting arrested? This can jeopardize their future if it goes on their record. Here you are arguing that allowing your child to take part in something illegal with possible legal repercussions makes one a bad parent. By that argument, allowing them to drink alcohol underaged, watch/listen to pirated movies/music, drive above the speed limit, etc. all also make one a bad parent. As everyone has their own parenting style, it is difficult to argue this based off of the only parenting factor that your CMV describes, that is that someone that allows their child to freely smoke weed is a bad parent. Two parents that both let their children smoke freely may have entirely different reasonings behind it. Does this make them bad parents? Maybe, maybe not. I'd argue that a parent that doesn't let their child smoke weed freely but beats them at home is a much, much worse parent.", "summary": null}
{"url": "", "domain": "reddit.com/r/unpopularopinion", "title": "Ive studied drug addiction how it works and what it effects ive lost people to addiction i grew up without a father cuz he was a drunk yet thats legal i can go get a 12 pack get sloppy drunk and start a fight but i cant roll a joint and take a nap after a long day at work i respect your dislikes for drugs but dont use propoganda in your argument marijuana has made alot of cancer patients better idk if it cures it i doubt it but it definately makes the patients happier they can eat they have a higher quality of life (again no pun intended).", "authors": ["klusterfukm8"], "publish_date": "00-1-2015", "text": "Ive studied drug addiction how it works and what it effects ive lost people to addiction i grew up without a father cuz he was a drunk yet thats legal i can go get a 12 pack get sloppy drunk and start a fight but i cant roll a joint and take a nap after a long day at work i respect your dislikes for drugs but dont use propoganda in your argument marijuana has made alot of cancer patients better idk if it cures it i doubt it but it definately makes the patients happier they can eat they have a higher quality of life (again no pun intended). Also im not saying there arent risks of smoking weed you can develop depression or even lung cancer (yes stoners weed is corrosive you know that rez in your pipes? Thats in your lungs) but at the same time so do cigarettes there legal and ridiculously taxed. Marijuana is a new cash crop havent had one of those since the industrial revolution its good for the economy. I respect your views just please use facts to back them up. Keep your hatred for drugs that RUIN lives (heroin, coke, crack... etc) dont take the actions of a few potheads against the rest of us. Everyone has there vices(Apologies for spelling and grammatical errors on my phone)", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "The vast majority of people, do not buy pounds of Marijuana. There's simply no good reason to spend that much to have that much if you're a casual or even heavy user. That said, the prices listed are easily above street prices for \"normal\" amounts of weed.", "authors": ["[deleted]"], "publish_date": "00-2-2013", "text": "You sound like a Marxist when you boil everybody's motivations down to a pure profit/loss equation. I like it :)You make some false assumptions though. In California for example, dispensaries are taxed and regulated by locality. A typical dispensary charges:1g = $15-$20, 1/8 = $45-$60, 1/4 = $90-$120, 1/2 = $175-$200 and 1o = $325-$400First, notice how I didn't list a pound? The vast majority of people, do not buy pounds of Marijuana. There's simply no good reason to spend that much to have that much if you're a casual or even heavy user. That said, the prices listed are easily above street prices for \"normal\" amounts of weed. People want to buy weed in a legal fashion because it's safe. They don't need to worry about having \"connections\" or whether they're getting ripped off or dealing with unsavory people just to save a few bucks. It also has very practical benefits for them as well. You can go whenever you want, prices and quality are consistent, and there's typically more variety. This is just the normal human side though. The direct evidence against your point is that even now, with federal law outlawing it, states are still passing MMJ laws and getting good tax revenue from it. California pulled in tens of millions of dollars from it.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "> Some are against the prison industrial complex, some for weed legalization, some want to protect the environment, some want to hold the banks accountable... my point is that all of those are truly impossible while this alliance persists but that any of them might be doable if everyone dropped their pet cause, embraced campaign finance reform and we got something real done.", "authors": ["[deleted]"], "publish_date": "00-2-2014", "text": "> Some are against the prison industrial complex, some for weed legalization, some want to protect the environment, some want to hold the banks accountable... my point is that all of those are truly impossible while this alliance persists but that any of them might be doable if everyone dropped their pet cause, embraced campaign finance reform and we got something real done. you're completely right. but i doubt it is possible to unify those groups. the government employs intelligence agents to infiltrate political movements and destroy them from the inside by inciting bipartisan conflicts. any initial success will be met with dozens of government shills trying to redirect everyone towards fighting each other over trivial differences, and in every instance i have seen, those government shills are amazingly effective. that is why i think rather than creating a political movement, we need to influence public opinion directly, reminding people that \"while you argue about abortion, the government is destroying the 4th and 5th ammendments, and is making a determined attack on the 2nd. left-right conflicts dont matter now, because the very fabric of our nation is under attack from both sides of politics.\"also, something we NEED to push is preferential voting (which allows people to vote for third parties, without losing their choice between the big two). it works well in australia, and it is EXACTLY what the US needs. unfortunately, bipartisan interests will fight it tooth and nail to prevent this from happening. lucky for us, there is literally no situation in which first past the post (the current system) is better than preferential voting (the australian system). the demopublican willingness to strongly oppose preferential voting is exactly what will convince the people that it is neccesary. and once preferential voting is implemented, the big parties wont be able to say \"a vote for a third party is a vote wasted\", and we just might have a chance of reversing the current creep towards totalitarianism. as i see it, the first past the post system is the biggest impediment to the proper functioning of american democracy, and it is what makes it possible for the two big parties to dominate politics.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "Pot like other drugs since they are illegal are shitty american enterprises and if you want to see the effect of a demand that can only be met by criminal entities you just have to look at the cartels in mexico. Look at the death rate in juarez and realize the pain that is caused by creating a system that only criminals can profit from.", "authors": ["Aniketos33"], "publish_date": "00-2-2013", "text": "I'd like to say that \"transition_mechanism\" had some really great points and that information should be enough to give the legal status a real consideration, but what does it over for me is what making the drug illegal causes. The amount of non-violent drug offenders in jail is abhorrent, these people enter jail as possibly kids that would annoy you with their BS attitudes and leave jail as hardened thugs because they didn't wanna be big tony's bitch in prison. Honestly to me I don't think any drug addict or user should be incarcerated on non-violent charges, it doesn't work and doesn't address the issue. For the harder drugs the worst that should be is confiscation and rehab/education. In economic terms the cost of the war on drugs and the prison management could be redirected towards much cheaper and more effective regulatory/treatment options. This next point I'm moving off to the side because this is the reason I don't smoke, but I'd love to if it was legal. Pot like other drugs since they are illegal are shitty american enterprises and if you want to see the effect of a demand that can only be met by criminal entities you just have to look at the cartels in mexico. Look at the death rate in juarez and realize the pain that is caused by creating a system that only criminals can profit from. There are regimes held up by mota, dictators that have loved the business, so if you like terrorist and the criminals that profit from street killings and gang violence then by all means hold up their product falsely by government over-regulation. (edit: obviously if you know where it was grown or grew it yourself then don't worry so much, but billions of dollars of the stuff makes it over the border so someone out there is using it and paying way too much for it.)", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "Honestly, I don't believe we would be on the way to legalizing pot at all if we had been a Pure Democracy for the last couple decades.", "authors": ["novagenesis"], "publish_date": "00-2-2014", "text": "This is about tyranny of the majority. If 51% of the country were murderers, they could legalize violent crimes. If 51% of the country were extremely racist, they could re-legalize slavery. The root cause for us *not* being a pure democracy is fear of a 51% majority being able to completely suppress the whims of a large minority. In your case, if the prevailing sentiment was that drugs were terrible (as it was until very recently), they could both worsen the penalties for drug abuse, *and* increase propaganda education to make sure they never became a minority. For non-hotbed issues, it's not a big deal, but for any of the \"big issues\" these days, it'd be damning. What's to prevent pro-lifers from mandating pro-life training in school? The same flip-side is viable for pro-choice. Sometimes, our represented officials screw this up... but they're there to prevent laws from being enacted solely because 51% of the country wants them. They represent a \"slowing\" process in change, and also represent a process of trying to make sure laws are constitutional before they make it to the courts. You can ruin someone's life by passing an unconstitutional law that affects him/her, and the life could be completely ruined before a \"validating\" body like the Supreme Court steps in. Right and wrong, even in the law, is not a popularity contest, and for good reason. History shows that mob rule is almost always more anti-liberty than pro-liberty. Honestly, I don't believe we would be on the way to legalizing pot at all if we had been a Pure Democracy for the last couple decades.", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "As a person who once smoked pot, and doesn't anymore, I don't agree that weed isn't addictive. It may not be as addictive as cigarettes or heroin, but there is an addictive aspect to it. I have seen a friend make the switch from weed to meth, another was a great football player in highschool and is now on his third stint in jail.", "authors": ["nathan587"], "publish_date": "00-2-2013", "text": "As a person who once smoked pot, and doesn't anymore, I don't agree that weed isn't addictive. It may not be as addictive as cigarettes or heroin, but there is an addictive aspect to it. I have seen a friend make the switch from weed to meth, another was a great football player in highschool and is now on his third stint in jail. All because they didnt want to quit. They had all the chances in the world to quit, they had help, rehab, jail, all these chances to just stop. But they just said \" its only weed, its not like I'm doing anything hard.\" It's the reason I quit, I watched what happened with almost everyone I hung out with back then, and it scared me straight. I'm not saying everyone will be this way, but I think to many are this way. And saying that imbibing weed doesnt hurt yourself is false, a girl in the area I am from stopped at a rest stop, smoked a bowl, turned into oncoming traffic and killed herself, and put a friend of mine and her brother in the hospital. The girl that got high died instantly, the girl I know broke both her legs and has years of physical therapy and more than likely psychotherapy from this. Just another story you never hear from someone who wants to. legalise", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "As prisons are being overfilled with people whose only crime was carrying some marijuana with them, the legalization folks started getting louder. Lumping cigarettes and weed together... because, c'mon, smoking anything is bad... The anti-smokers followed suit and got even louder. Back and forth, both sides trying to outshout each other.", "authors": ["NotNowImOnReddit"], "publish_date": "00-2-2014", "text": "I think what we're currently seeing is the two forces rushing together in a manic fervor of tolerance vs. intolerance. Anti-smokers have been around for ages, same as the pro-legalization crowd. As prisons are being overfilled with people whose only crime was carrying some marijuana with them, the legalization folks started getting louder. Lumping cigarettes and weed together... because, c'mon, smoking anything is bad... The anti-smokers followed suit and got even louder. Back and forth, both sides trying to outshout each other. This will build and build and build until it finds a societal balance. My two cents? Relax marijuana laws, and allow further research into its medicinal properties, while still moderately regulating and legally restricting it in the same fashion as cigarettes and/or alcohol (including considering any negative health issues it may cause; to yourself, or to those around you). Social reasoning shifts somewhat like tectonic plates would. They crash into each other with tremendous force, but slowly. There are earth shattering events, constant tension and enormous pressure. Both sides always gain ground onto the other. Then, bit by bit, they form into a conjoined landscape for a while before shifting again. (Admittedly, this may not be a fully accurate description of how tectonic plates actually shift, but I saw a metaphor and I went for it)", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "To get into some real harm, where does your pot come from? Do you grow it yourself or get it from a local grower? Are you sure you know where it's from? Hard numbers don't exist, but anywhere from half to two-thirds of the pot in the US is smuggled in from the border, mostly over the Mexican border by some gangs who I don't think you'd like to be funding.", "authors": ["Cavemonster"], "publish_date": "00-2-2013", "text": "I don't know if I'd go so far as to say it's wrong, but it does have its negatives that you may not have considered. Its illegality has made it a little difficult to study the effects, but as information is coming out, there are some possible health risks.[It may significantly increase your risk of stroke]()[It may lower your IQ]()[It may increase your chances of testicular cancer]()[If you are prone to psychosis, it may hasten or exacerbate your symptoms]()And it may have effects we don't know about yet. Remember, we're not too far away from a time when all the doctors smoked cigarettes and nobody knew smoking while pregnant was bad. MJ is possibly as unstudied now as tobacco was then. These possible risks and others like them may or may not be borne out, but let me ask you this. How would you feel about consuming a food additive if it had such a big question mark over it and such possible risks? Would you be happy to find it in your cereal? To get into some real harm, where does your pot come from? Do you grow it yourself or get it from a local grower? Are you sure you know where it's from? Hard numbers don't exist, but anywhere from half to two-thirds of the pot in the US is smuggled in from the border, mostly over the Mexican border by some gangs who I don't think you'd like to be funding. If you don't grow your own or know directly who grows it, don't believe the exotic beautiful story your dealer may tell you. They're a salesman and a middleman. More likely than not, your money is funding terrorism. If you have any problem buying clothes and electronics from people who mistreat sweatshop employees, I'd imagine you wouldn't be happy funding the Zeta's in Mexico. If your pot comes through Mexico, then you've got some of this blood on your hands:", "summary": null}
{"url": "", "domain": "reddit.com/r/changemyview", "title": "It's like ... supposedly there's a religious exception to drug laws, where if you have a genuinely held religious belief that calls for hashish or peyote, then you can celebrate it ... how many people in real-life practice are using pot or ... buttons (?", "authors": ["Thoguth"], "publish_date": "00-2-2014", "text": "The phrase \"tilting the scales\" implies that the scales are perfectly balanced as it is. I don't believe they are, or even that there is a place of perfect balance. There is just a zone of contention, where on one side you have \"religious views should be deferred to in every case, even if it causes discrimination\" and in the other you have \"discrimination cannot be tolerated, even if it violates religious views\". And we're currently somewhere in between, and I believe that all the proposed modifications to the law will ultimately leave us somewhere else in-between (or due to judicial review, possibly in exactly the same place.)I guess by \"middle ground\" you're really looking for a \"perfect balance\" though, right? In my opinion, a law that made it acceptable for someone to conscientiously refuse to participate in a gay marriage (e. g. photographers, entertainers, decorators or bakers, etc.) the same way we currently allow priests to refuse (acknowledging their religious freedom to do so) would * be consistent enough with current precedent to seem sane* prevent the (in my opinion) perverse idea that someone should be forced to celebrate or beautify something they disapprove of, and * be limited enough that nobody would consider it Jim Crow II: Homophobic Boogaloo. I feel that it would be a better equilibrium position than both what's currently on the books and what's proposed... except I (maybe way too optimistically) feel that in practice, that's how the proposed laws will actually play out. Reading the law it seems pretty clear that it's only applicable for genuinely held religious beliefs, and nobody (to my knowledge) has a genuinely held religious belief that it's morally wrong for a plumber to fix a gay person's toilet, or for a waitress to serve them coffee. It's like ... supposedly there's a religious exception to drug laws, where if you have a genuinely held religious belief that calls for hashish or peyote, then you can celebrate it ... how many people in real-life practice are using pot or ... buttons (? is that what peyote comes in?) and using religion as an excuse? Even though maybe some people would enjoy that, in practice it seems unheard-of. (And illegal... for all the challenges of proving \"genuinely-held-ness\" a judge is a person, and not likely to be bowled over by \"honest officer, it's religious\" type of statements.)", "summary": null}
{"url": "", "domain": "reddit.com/r/science", "title": ".. \"legal medical marijuana\" is not the same as state-wide legal-for-everyone marijuana. It's still illegal for the average Joe!> if guns were illegal, the black market would grow... but I don't see that ever happening. there are a lot more gun freaks than pot heads.", "authors": ["[deleted]"], "publish_date": "00-6-2008", "text": "I'm lazy? I hang out with my friends all the time and I'm *telling you* that it's easier.> it's been shown that it's easier to get it from a doctorWhat are you basing this on, magic? Ahhh, there it is, I was waiting for it. .. \"legal medical marijuana\" is not the same as state-wide legal-for-everyone marijuana. It's still illegal for the average Joe!> if guns were illegal, the black market would grow... but I don't see that ever happening. there are a lot more gun freaks than pot heads. WOOSH! Let me rephrase my last comment so you understand...> Let's say that you didn't have the right to bare arms [, like you don't have the right to bare pot], and buying/possession any type of gun was illegal [, just like buying/possession of pot is]. Would the black-market for weapons [or pot] become larger, or smaller if that buying/possession ban was lifted?...> There are a lot more gun freaks than pot headsHave you been to Canada?> if you want to buy pot in a store, go to Amsterdam, where crime and drug use has gone UP since they legalized marijuana.... > Amsterdam does have a high crime rate. Poverty amongst a relatively large percentage of the population likely plays a role. So does the presence of tourists. Pickpockets and other thieves have their hands full, so to speak.> Much crime in Amsterdam is of a different nature, though. In recent years, a revenge-war amongst top criminals has resulted in a number of assassinations  with hits often taking place in public. > In the 2007 version of its annual listing of the Worlds Best Cities to live in, Mercer Consulting ranked Amsterdam at number 13.   love to visit, actually. > legalizing it won't solve ANY problems except making it easier for the average guy (like you) to go get some weed.- It will (really) lower the black-market for the drug, thus taking would-be profits away from those nasty Colombian drug lords- It would be taxed, bringing in millions of dollars for the government- The enforcement of the drug would be halted, freeing billions of dollars of spending.- Regular \"average guy[s]\" (like me) wouldn't be sentenced to hard time. Yeah, wouldn't solve any problems... just like ending prohibition didn't.> marijuana is not just about smoking joints... No shit, what the fuck do you think we've been talking about.", "summary": null}
{"url": "", "domain": "reddit.com/r/politics", "title": "I am in support of legalizing marijuana and I do not mind admitting that partly i want it legalized just so i can smoke weed where ever i want. But at the same time I also think that I would be great for the economy.", "authors": ["gorilla956"], "publish_date": "00-3-2009", "text": "I am in support of legalizing marijuana and I do not mind admitting that partly i want it legalized just so i can smoke weed where ever i want. But at the same time I also think that I would be great for the economy. I would product an influx of cash by being taxed and it would also free up cash being spent housing \"criminals\" arrested for possession. In 2007 there were a total of 1,841,720 drug arrest, 872,720 of those were for marijuana. Now many people might say that those are good stats for the supposed \"war on drugs\" that the US had \"working on\", but what you need to take into consideration is how many traffickers have been arrested. out of the total marijuana arrests made only 97,583 have been for trafficking or sales. A total of 775,137 have been for possession, to me this does not look like a \"war on drugs\" but a war on users. And when you take into consideration that on average it cost $52 a day to imprison a person, and the average sentence for possession is up to 6 months. Thats a total just over $9,360 per person, now per year thats $7,255,282,320 spent on possession charges. Forget race and the difference in how many blacks, whites or hispanics or even my asian friends are in jail non of that shit matter, we are all Americans or at least we live in America, cause most hispanics are not born Americans, myself included. I say legalize the shit and stop spending money and start making money. I would not mind paying a tax on weed if I can smoke a joint while cutting my grass or before I go to the mall with my wife, that way Im not bored as fuck while she tries in 30 outfits and only buys a skirt. You would think that Obama would be for legalizing it, aint all nigga for getting that paper.", "summary": null}
{"url": "", "domain": "reddit.com/r/Christianity", "title": "Of course there are issues of victim-less moral dilemmas, and this is why you have Atheist places in the world happy to partake in marijuana, open sexual relationships and that ilk. But you'll note that crimes that involve victims are greatly diminished in Atheist countries.", "authors": ["gaytor35"], "publish_date": "00-2-2010", "text": "Where do atheists get their morality? Evolution can't explain Emotions. Empathy is understanding how you would feel in someone else's position. If you teach your child to be empathetic, Morality will establish itself. Of course there are issues of victim-less moral dilemmas, and this is why you have Atheist places in the world happy to partake in marijuana, open sexual relationships and that ilk. But you'll note that crimes that involve victims are greatly diminished in Atheist countries. One of my aunt's once asked me, \"Where do you get your Morality?\" I responded, \"Jesus isn't here to forgive me, I have to live with what I do.\" Blind forgiveness does not lead to morality, only teaching empathy does. So how does Empathy (or all of emotions) \"evolve\"? People lived in social groups. Those groups started out small. If you killed your vegetable gatherer, you might go hungry when you couldn't find meat. Your likelihood of survival just went down. If you killed the fertile woman, your chances of spreading your genes just went down. The emotional ties that caused us to protect one another and care for each other furthered survival. Those that didn't, would die out. Again, this is why in religion neutral countries, victim-less crimes are not considered important, whereas in religious countries having sex might mean execution. Which one of these is moral again?", "summary": null}
{"url": "", "domain": "reddit.com/r/trees", "title": "Really, I think it depends upon the type of high and the person's personal interaction with weed. I've been with people who drive high my entire life, some even smoking while driving, and felt completely comfortable with them because they were comfortable with themselves and I eventually came to trust their driving stoned or not.", "authors": ["ElNido"], "publish_date": "00-10-2011", "text": "alex3ka took whatthekluck's sentence and skewed it with a mythbusters segment to make it look like driving high = driving on the urge of falling asleep. Really, I think it depends upon the type of high and the person's personal interaction with weed. I've been with people who drive high my entire life, some even smoking while driving, and felt completely comfortable with them because they were comfortable with themselves and I eventually came to trust their driving stoned or not. I've also been with people driving tired. It's pretty scary shit. My step-dad had the moving van a few years back and almost veered into the other lane completely. We kept calling him till he answered and eventually got him to pull over. Dude almost fell completely asleep at the wheel. So you see, I'm not going to argue that driving tired is good in any situation. But I will argue that every single tired driver situation I've seen has been potentially a hundred times more dangerous than any of the high driver encounters I've had, so I'm telling you that you really can't compare the two. Bringing it back to my original point, I think it depends solely on the person. Just because some may not be able to drive stoned like kluck and I, doesn't mean you have to take a downvote dump all over us for having an opposite truth. We all smoke here, no reason to hate.", "summary": null}
{"url": "", "domain": "reddit.com/r/politics", "title": "For instance, if officers claiming they \"smell marijuana\" turn up evidence of marijuana less than 50% (70%?) of the time, that justification becomes off limits for probable cause purposes. Notice that I didn't say \"turn up evidence of a crime\"; the PC was legitimate only if evidence recovered matches the original PC claim.", "authors": ["soupwell"], "publish_date": "00-6-2012", "text": "Perhaps the possibility of being shot upon serving a no-knock warrant based on flimsy justification will deter the use of such tactics. It really bothers me how loose the standards for \"probable cause\" have become. Detecting that someone is expending more energy than \"normal\" in their home (the grow operation signature) does not strike me as reasonable justification for bursting in on them in the middle of the night with a military style force. Maybe I'm ignorant of something like this already in place, but I think there should be concrete standards for the use of probable cause (both in issuing warrants and on-scene PC based searches). For on-scene PC searches, an officer should be required to record his probable cause (and state it to the citizen) *before* he executes a search of a citizen's person or property (Warrants are already subject to this kind of record keeping). This needs to be done in a way that makes it at least difficult to \"fill in the blank\" on the form after the search. Then, there needs to be serious, standards based auditing of these searches. For instance, if officers claiming they \"smell marijuana\" turn up evidence of marijuana less than 50% (70%?) of the time, that justification becomes off limits for probable cause purposes. Notice that I didn't say \"turn up evidence of a crime\"; the PC was legitimate only if evidence recovered matches the original PC claim. Alongside this system to audit specific types of probable cause, there could also be a review of PC uses by individual officers. If an individual officer fails to muster 50% (or whatever), they lose privileges to overrule the constitutional rights of citizens by claiming probable cause. Perhaps they should be fired as well, and maybe they would be, but at a minimum, they should be denied the opportunity to continue violating the 4th amendment rights of the public. I feel like I always show up late to these discussions, but I would be very interested to know how redditors feel about this idea. TL;DR - Since \"probable cause\" is used to justify curtailing constitutional rights, its use should be much more carefully monitored. EDIT: TL;DR", "summary": null}
{"url": "", "domain": "reddit.com/r/science", "title": "once again (said this in two other threads on this page) -- your marijuana didn't fall from the sky and wasn't manufactured in a factory in america. even if it was grown here, the seeds came from a place where people die over the drugs.", "authors": ["asaturn"], "publish_date": "00-6-2008", "text": "once again (said this in two other threads on this page) -- your marijuana didn't fall from the sky and wasn't manufactured in a factory in america. even if it was grown here, the seeds came from a place where people die over the drugs. it's sold along side cocaine and other dangerous drugs by people who kill people. if you look at the drug USE being safer... sure, if you ONLY look at the use by white teens in the suburbs. you guys need to see the entire picture here. I'm not bashing weed, I'm just saying these stories are misleading by saying \"drugs are safe.\"I don't want to get into a rant about it because frankly I don't care that a bunch of white kids smoke weed after school. weed by itself is a harmless drug, but the way it's produced and delivered harms more people than alcohol ever could. think of alcohol during prohibition... even then, the drug trade is still more dangerous. another analogy I made was hybrid cars. they're touted as better for the environment... but that's misleading: the technology that goes into PRODUCING hybrid cars is a LOT worse than what it takes to produce a Hummer H3 or Ford Excursion. if you only count the impact AFTER they're driven off the dealer's lot... then yeah they're better... but that isn't seeing the ENTIRE PICTURE.", "summary": null}
{"url": "", "domain": "reddit.com/r/business", "title": "The same thing will apply to marijuana sales.> So again, it seems childish to offer up a couple of dollars when the government can do a lot more already. Most voters are hesitant to improve tax increases. Legalizing and taxing marijuana will create new (legal) industry that can be taxed.", "authors": ["quiller"], "publish_date": "00-3-2009", "text": "> What they don't understand is that every drop of alcohol in the US that is fit for sale to consumers is taxed. I don't see what your point is? The same thing will apply to marijuana sales.> So again, it seems childish to offer up a couple of dollars when the government can do a lot more already. Most voters are hesitant to improve tax increases. Legalizing and taxing marijuana will create new (legal) industry that can be taxed. Rather than increase existing taxes, we legitimize an already popular product and generate a new source of income for the government.> They heavily taxed the rich and the poor were too numerous to keep tight monitoring checks. How is this any different than today? All the numbers I've seen suggest the gap between the very rich and the poor has widened since Prohibition days.> Also you seem to forget that during the depression, the US was on the gold standard, which prevented it from printing the money it needed. Today, they simply spend whatever money they want and they have no incentive to tax anything. I officially have no idea where you're heading with this argument. The public appears to be painfully aware of the economic depression we're currently in, and certainly most people are aware that a lot of governments (local and otherwise) are low on funds. > We're moving towards socialism and away from capitalism after all, so trying to play the game using the rules from 70 years ago is doomed to fail. When was the last time America had a purely capitalistic system, and what is so wrong with incorporating elements of socialism if it improves society and saves money?> The government doesn't want, nor does it need such a small amount of taxes for such a large headache of collection and enforcement. I don't care what this monolithic, single-hive-mind government of yours wants. It wasn't The Government that repealed Prohibition, it was the influence of the people.", "summary": null}
{"url": "", "domain": "reddit.com/r/reddit.com", "title": "He has come out and said multiple times, he believes that using marijuana damages people, that it harms their life, that they shouldn't do it, that they should be prevented from doing it. He voted to increase the prison terms of first-time possession offenders. >as far as i've been able to see, he seems to be in favor of states handling this issue (hence the \"no federal resources used to prosecute those in compliance with state drug laws\").", "authors": ["otakucode"], "publish_date": "00-2-2010", "text": ">ok, hold on here. it's certainly apparent to me that obama is not in favor of legalization, but where do you get the idea that he will definitely take action to stop legalization? What the hell do you think \"not in favor of legalization\" means? He has come out and said multiple times, he believes that using marijuana damages people, that it harms their life, that they shouldn't do it, that they should be prevented from doing it. He voted to increase the prison terms of first-time possession offenders. >as far as i've been able to see, he seems to be in favor of states handling this issue (hence the \"no federal resources used to prosecute those in compliance with state drug laws\"). He is somewhat OK with states handling the MEDICAL marijuana issue. He has never made any statements about anything else. And, really, his statements on that don't make any sense. He is maintaining the federal laws against it when he could be moving to remove them. He is specifically maintaining the ability for the feds to raid these places, fight it in court a bit, and, as they always do, win big and gain an even more permanent place for the Drug War. It would be a nice crowning piece. We already got the Supreme Court saying \"Yeah, when the stuff doesn't cross state lines we admit that we can't really cover it under the interstate commerce clause, but we don't care, we're going to keep the laws even though we admit they are unconstitutional\". >i don't doubt that he'd veto a legalization bill that came from the national congress (like that would ever happen), Umm, that's exactly what I said. Obama can't veto state congress bills, you know. It will be interesting to see what Obama does if some place completely legalizes pot and businesses open up selling it. I expect you will see those places destroyed by the DEA, and Obama will be very, very quiet about it.", "summary": null}
{"url": "", "domain": "reddit.com/r/TwoXChromosomes", "title": "I know a lot of young conservatives and old, grizzled tea party members, and the nonreligious ones are almost all completely in support of abortion, gay marriage, and even the legalization of marijuana. I honestly think that as older conservatives die out, younger, more socially liberal conservatives are going to change the face of the party.", "authors": ["Snowleaf"], "publish_date": "00-10-2011", "text": "I would step in to say that *religious* conservatives tend to do this. I'm an honest moderate - I attend both Democrat and Republican events, fundraisers, and speeches - and the tides are changing. I was at a large Republican fundraiser a couple of years ago, and after saying the Pledge, where everyone said \"... and liberty and justice for all\" someone in the back yelled \"for the born and the unborn!\" and the entire room let out a loud groan. The speaker for the evening got up and said \"That's what we need to fight, people. We've allowed this party to get hijacked by the bible belt and now Republican politicians are arguing about banning abortion, prosecuting homosexuality, and other religious interests in order to get votes from the extreme religious right - why are we allowing this? We need to nip this in the bud as a party. We're alienating younger conservatives by doing this. These issues are not things we should be fighting about as a party - having women in control of their biological processes is not what's going to ruin this country.\" That led to a 3-minute long standing ovation from 90% of the crowd. I know a lot of young conservatives and old, grizzled tea party members, and the nonreligious ones are almost all completely in support of abortion, gay marriage, and even the legalization of marijuana. I honestly think that as older conservatives die out, younger, more socially liberal conservatives are going to change the face of the party. At least, I really hope so. Denying women birth control in the year 2011 just makes my brain hurt.", "summary": null}
{"url": "", "domain": "reddit.com/r/politics", "title": "On the positive side, I don't see many of the other 99 Senators:* [Joining an Oregon Democrat to sponsor hemp legalization legislation]()* [Speaking passionately from the Senate floor about ending the Patriot Act]()* [Speaking passionately from the Senate floor about the shame of NDAA's indefinite detention]()* [Constitutionally and historically arguing to the Senate that Congress needs to take back the power to declare and wage war to limit the war-waging power of the executive]()* [Introducing legislation to abolish the TSA and establish a Passenger Bill of Rights]()* [Wanting to require warrants for domestic drone surveillance]()Just trying to not throw out the good with the bad.", "authors": ["zugi"], "publish_date": "00-6-2012", "text": "I agree and I hope this ridiculous amendment fails. And I agree that Rand Paul is a lot like the others when it comes to playing political games to get things done in Washington. Apparently Rand Paul knows his amendment won't go anywhere but is trying to make a point that you can't say \"no unrelated riders!\" and then also not allow things to be voted on as standalone bills. From [Huffington Post]():> Paul told reporters on Tuesday afternoon that he is \"just trying to get a vote for people who elected me.\"> \"Can you believe that they're exasperated with me?\" he said, responding to criticism of his attempt to attach the unrelated amendment. \"If [Reid will] give me a freestanding vote, I'll take a freestanding vote any time.\"So indeed he's playing games to try to get Reid to allow an up-or-down freestanding vote on this amendment, which will fail, so he can go home and tell his constituents that he tried. However, I disagree that that alone makes him \"no different from any of the others.\" On the positive side, I don't see many of the other 99 Senators:* [Joining an Oregon Democrat to sponsor hemp legalization legislation]()* [Speaking passionately from the Senate floor about ending the Patriot Act]()* [Speaking passionately from the Senate floor about the shame of NDAA's indefinite detention]()* [Constitutionally and historically arguing to the Senate that Congress needs to take back the power to declare and wage war to limit the war-waging power of the executive]()* [Introducing legislation to abolish the TSA and establish a Passenger Bill of Rights]()* [Wanting to require warrants for domestic drone surveillance]()Just trying to not throw out the good with the bad.", "summary": null}
{"url": "", "domain": "reddit.com/r/science", "title": "The ONE study that was used back in the 70s and 80s to justify the whole \"weed kills brain cells\" argument, done by Gabriel Nahas and colleagues, involved 6 rhesus monkeys. The method of ingestion similar to gas masks, where they basically force fed the monkeys smoke constantly.", "authors": ["veritaze"], "publish_date": "00-6-2008", "text": "Another problem with these types of studies and the ones that involve lung damage is not really having any control over the control group - you're basically on good faith to their word that they smoked that much everyday (like they remember, lol), and on top of that, what other substances did they ingest that might have tainted that? Most of the potheads I know also drink alcohol, often smoke cigarettes and more frequently mess around with other illegal drugs as well as prescription ones. This uncertainty, combined with such a small sample size, in my mind requires repeated experiments with larger sample groups to really start to mean anything. The ONE study that was used back in the 70s and 80s to justify the whole \"weed kills brain cells\" argument, done by Gabriel Nahas and colleagues, involved 6 rhesus monkeys. The method of ingestion similar to gas masks, where they basically force fed the monkeys smoke constantly. Well, it's no wonder they experienced brain damage, their oxygen supply was being repeatedly deprived. Oh, and I just noticed this from Bixie:>I know many people who smoke that much a day. I simply disagree with using joints as a measurement since they are not accurately quantifying the amount of pot smoked. Yet another good point about the quality of the science being practiced here - a joint can vary VASTLY in quantity, not to mention the quality of the marijuana being used in terms of potency, variety and so on. There are so many varieties of weed, just as there are for wine.", "summary": null}
{"url": "", "domain": "reddit.com/r/AskReddit", "title": "He couldn't have been too uncomfortable when he went though because he still had a pipe packed with weed clutched in his hand.", "authors": ["carnylove"], "publish_date": "00-3-2009", "text": "Not actually witnessed the death, but I had a pretty gruesome encounter a couple of summers ago. I work in property management and one summer a older disabled man moved into a basement apartment we had. We didn't see him often, but often enough that when we didn't hear from him for a week I remember saying something to my coworker about it. Another week went by and rent was due, but he hadn't paid. At this point we suspected something was up, but we can't just go busting into people's apts. every time we don't hear from them for a couple weeks. Also, it was summer and his apartment was right next to the recycling room, so the smell *could* have been coming from there. We just weren't sure. We knocked on his door when rent was due and 72-HR notices were about to go out. There was no answer. My co-worker went around to the side of the building to peak in the window, and he could visibly see a socked foot propped up and the TV going. At that point we called the police. He had literally melted in the summer heat, and once the door was opened, the smell of decomposing flesh was overwhelming. I found it really sad that no one had called us concerned. He had no family or friends. He couldn't have been too uncomfortable when he went though because he still had a pipe packed with weed clutched in his hand.", "summary": null}
{"url": "", "domain": "reddit.com/r/politics", "title": "This means no criminalizing marijuana, no criminalizing abortion, no DOMA, no Federal Assault Weapons Ban, and on and on for a whole host of other issues over which there is a split consensus. Most importantly, it means no using tax dollars to subsidize businesses. If the whole population of the US decides that something is worth enacting on a national level, the Constitution can be amended.", "authors": ["xLittleP"], "publish_date": "00-2-2010", "text": "Really? I downvoted it for the following reasons:>On the federal level, he sounds great -- he's against the federal government doing pretty much anything. I'm glad that you agree that this is a great thing. This happens to be why I most like RP.>But instead he wants to give the individual states vastly more power than the current federal and state governments combined. False. He wants to take away power from the Federal government (for example, education), and give it back to the states. He's not advocating the creation of new powers, but if States wanted to create them, then that would be for them to decide.>I sure as hell wouldn't want to live in the south under a Ron Paul presidency. So don't, then; no one is asking you to. Do you live in the South now? If not, why the hell do you care whether it is a livable place (in your mind)? I personally think the South is a great place to live. If you don't, that's fine by you.> [From a later post in the thread]Right now the Bill of Rights removes a lot of state rights and grants a lot of individual rights. Paul wants to remove most of those individual rights and let the states decide on which of them they should implement on a piecemeal basis. This just couldn't be more wrong. The Bill of Rights cannot be taken away. They are part of the US Constitution, the Supreme Law of the Land. All other powers not explicitly mentioned in it are granted to the States, or to the People. This means no criminalizing marijuana, no criminalizing abortion, no DOMA, no Federal Assault Weapons Ban, and on and on for a whole host of other issues over which there is a split consensus. Most importantly, it means no using tax dollars to subsidize businesses. If the whole population of the US decides that something is worth enacting on a national level, the Constitution can be amended. It's my understanding that this is how the Constitution was intended. Seriously, please read Ron Paul's book, The Revolution, to find out where he is really coming from. The paperback version is [10 bucks at Amazon.]()", "summary": null}
{"url": "", "domain": "reddit.com/r/trees", "title": "How the timber/oil/plastics industries wanted it illegal because hemp was their competition. Also Harry J. Anslinger. A racist who was able to convince everyone that mexicans and blacks go crazy when they smoke marijuana. Medical Benefits: It has countless medical benefits including but not limited to insomnia, appetite stimulation, treating AIDS wasting syndrome, the effects of chemotherapy, MS, chronic pain, and there is even some evidence that it shrinks tumors (although the jury is still out on this on) Organizations including the American Medical Association and the American Cancer Society have acknowledged that marijuana does have some health benefits.", "authors": ["IShireBeTolkien"], "publish_date": "00-10-2011", "text": "Things to include: Why it is illegal: History behind how it first became illegal. How the timber/oil/plastics industries wanted it illegal because hemp was their competition. Also Harry J. Anslinger. A racist who was able to convince everyone that mexicans and blacks go crazy when they smoke marijuana. Medical Benefits: It has countless medical benefits including but not limited to insomnia, appetite stimulation, treating AIDS wasting syndrome, the effects of chemotherapy, MS, chronic pain, and there is even some evidence that it shrinks tumors (although the jury is still out on this on) Organizations including the American Medical Association and the American Cancer Society have acknowledged that marijuana does have some health benefits. Effects on the Body: You have been lied to your whole life. Marijuana does not give you schizophrenia (although if you have genetic predisposition you have to be careful) it does not give you cancer, it doesn't give you brain damage. There are zero deaths every year because of marijuana. There is some damage to lungs, but any time you inhale burning plant matter this will happen. The effects can be reduced by filtering with water, or almost completely removed by vaporizing. Crime: In 2001 Portugal decriminalized cannabis and several other drugs. Today they have the most sensible and well controlled drug population of any western country. Since decriminalizing drug crime rates have dropped drastically. Addiction rates to hard drugs has dropped, The usage rates of cannabis have even dropped. That's a crazy thought, if you want people to stop using it, legalize it. The contrast here would be Mexico. The drug violence there is absolutely insane. Granted most of it is not due to drug use in the country itself, but the illegal trade of drugs to the US. The war on drugs is responsible for countless deaths in Mexico. If we were to legalize, the main funding for cartels would be cut off and they would fall apart. Sorry for the wall of text, I hope it helps. I would also recommend watching the documentary, The Union: The Business Behind Getting High. It is a fantastic film and not only educational but also fun to watch. Happy smoking and post your essay when you finish!", "summary": null}
